import { StemBranch } from '@reinhard2019/cw-calendar-translate/lib/types';

export const IncidentTypes = [
  '官吏',
  '推举人才',
  '灾害',
  '救济',
  '战争',
  '外交',
  '疆界',
  '律法',
  '后宫',
  '外戚',
  '宗室',
  '天文',
  '文化',
  '祭祀',
  '诏书',
  '财政',
  '年度总结',
  '改元',
  '水土工程',
  '祥瑞',
  '出行',
  '其他',
] as const;
export type IncidentType = typeof IncidentTypes[number];

type Season = '春' | '夏' | '秋' | '冬';

type EraName =
  | '章帝章和'
  | '和帝永元'
  | '和帝元兴'
  | '殇帝延平'
  | '安帝永初'
  | '安帝元初'
  | '安帝永宁'
  | '安帝建光'
  | '安帝延光'
  | '顺帝永建'
  | '顺帝阳嘉'
  | '顺帝永和'
  | '顺帝汉安'
  | '顺帝建康'
  | '冲帝永嘉'
  | '质帝本初';

export type Date = [
  EraName,
  number?,
  (Season | number)?,
  (StemBranch | number)?,
];

export interface Incident {
  id?: number;
  time?: Date | [Date, Date];
  // isSuspicious?: boolean; // 是否存疑
  title?: string;
  type: IncidentType;
  tags?: string[];
  // antecedent?: string; // 前因
  incident: string; // 事件详情
  // aftereffect?: string; // 后果
  source?: string; // 原文
  // place?: string;
}

// 和帝--刘肇
const 和帝: Incident[] = [
  {
    time: ['章帝章和', 2, 2, '壬辰'],
    type: '其他',
    incident: '和帝即位，年十岁。尊皇后为皇太后，太后临朝处理政事。',
  },
  {
    time: ['章帝章和', 2, 3, '丁酉'],
    type: '疆界',
    incident:
      '改淮阳为陈国，楚郡为彭城国，西平合并到汝南郡，六安恢复为庐江郡。遗诏调任西平王刘羡为陈王，六安王为彭城王。',
  },
  {
    time: ['章帝章和', 2, 3, '癸卯'],
    type: '其他',
    incident: '葬孝章皇帝于敬陵',
  },
  {
    time: ['章帝章和', 2, 3, '庚戌'],
    type: '官吏',
    incident:
      '皇太后下诏，侍中窦宪为先帝器重，亲自授予遗诏，当以先人的典章成法辅佐国政。窦宪供养帝宫和太后宫，值宿警卫宫中左右。太尉邓彪为太傅，赐爵关内侯，录尚书事。',
    source:
      '皇太后诏曰：“先帝以明圣，奉承祖宗至德要道，天下清静，庶事咸宁。今皇帝以幼年，茕茕在疚，朕且佐助听政。外有大国贤王并为蕃屏，内有公卿大夫统理本朝，恭己受成，夫何忧哉！然守文之际，必有内辅以参听断。侍中宪，朕之元兄，行能兼备，忠孝尤笃，先帝所器，亲受遗诏，当以旧典辅斯职焉。宪固执谦让，节不可夺。今供养两宫，宿卫左右，厥事已重，亦不可复劳以政事。故太尉邓彪，元功之族，三让弥高，海内归仁，为群贤首，先帝褒表，欲以崇化。今彪聪明康强，可谓老成黄耇矣。其以彪为太傅，赐爵关内侯，录尚书事，百官总己以听，朕庶几得专心内位。于戏！群公其勉率百僚，各修厥职，爱养元元，绥以中和，称朕意焉。”',
  },
  {
    time: ['章帝章和', 2, 3, '辛酉'],
    type: '其他',
    incident: '有司上奏给孝章皇帝上庙号，肃宗。',
    source:
      '有司上奏：“孝章皇帝崇弘鸿业，德化普洽，垂意黎民，留念稼穑。文加殊俗，武畅方表，界惟人面，无思不服。巍巍荡荡，莫与比隆。周颂曰：‘于穆清庙，肃雝显相。’请上尊庙曰肃宗，共进武德之舞。”制曰：“可。”',
  },
  {
    time: ['章帝章和', 2, 3, '癸亥'],
    type: '宗室',
    incident:
      '陈王刘羡、彭城王刘恭、乐成王刘党、下邳王刘衍、梁王刘畅开始到各自到封国就任。',
  },
  {
    time: ['章帝章和', 2, 4, '丙子'],
    type: '其他',
    incident: '拜谒高祖神庙',
  },
  {
    time: ['章帝章和', 2, 4, '丁丑'],
    type: '其他',
    incident: '拜谒世祖神庙',
  },
  {
    time: ['章帝章和', 2, 4, '戊寅'],
    type: '财政',
    incident:
      '下诏重申先帝告诫各郡国解除煮盐铸铁之事，使之有如过去一样向天子纳税。',
    source:
      '诏曰：“昔孝武皇帝致诛胡、越，故权收盐铁之利，以奉师旅之费。自中兴以来，匈奴未宾，永平末年，复修征伐。先帝即位，务休力役，然犹深思远虑，安不忘危，探观旧典，复收盐铁，欲以防备不虞，宁安边境。而吏多不良，动失其便，以违上意。先帝恨之，故遗戒郡国罢盐铁之禁，纵民煮铸，入税县官如故事。其申敕刺史、二千石，奉顺圣旨，勉弘德化，布告天下，使明知朕意。”',
  },
  {
    time: ['章帝章和', 2, 5],
    type: '灾害',
    incident: '京师大旱',
  },
  {
    time: ['章帝章和', 2, 5],
    type: '其他',
    incident: '诏令长乐少府恒郁到宫内给皇帝讲学',
  },
  {
    time: ['章帝章和', 2, 10, '乙亥'],
    type: '战争',
    incident: '以侍中窦宪为车骑将军，讨伐北匈奴。',
  },
  {
    time: ['章帝章和', 2, 10, '乙亥'],
    type: '外交',
    incident: '安息国派遣使者向朝廷进献狮子、扶拔。',
  },
  {
    time: ['和帝永元', 1, 3, '甲辰'],
    type: '官吏',
    incident:
      '开始令郎官因诏令免官职到人可得自报县丞、县尉的待遇，以仿效此俸禄进行优待。',
  },
  {
    time: ['和帝永元', 1, 6],
    type: '战争',
    incident:
      '车骑将军窦宪出鸡鹿塞，度辽将军邓鸿出棝阳塞，南单于出满夷谷，与北匈奴战于稽落山，大破之，追至和渠北鞮海。窦宪遂登燕然山，刻石勒功而还。北单于遣弟右温禺鞮王奉奏贡献。',
  },
  {
    time: ['和帝永元', 1, 7, '乙未'],
    type: '灾害',
    incident: '会稽山崩。',
  },
  {
    time: ['和帝永元', 1, -7, '丙子'],
    type: '诏书',
    incident: '因为扫平匈奴，下诏让有关主管官员举行祭祀以功近告上天。',
    source:
      '诏曰：“匈奴背叛，为害久远。赖祖宗之灵，师克有捷，丑虏破碎，遂扫厥庭，役不再籍，万里清荡，非朕小子眇身所能克堪。有司其案旧典，告类荐功，以章休烈。”',
  },
  {
    time: ['和帝永元', 1, 9, '庚申'],
    type: '官吏',
    incident: '以车骑将军窦宪为大将军，以中郎将刘尚为车骑将军。',
  },
  {
    time: ['和帝永元', 1, 10],
    type: '其他',
    incident:
      '诏令各郡国把除去枷锁的罪犯送入军营。其从军出塞征战的，刑期虽未满，全部免除刑罚让他们返归家乡种田。',
  },
  {
    time: ['和帝永元', 1, 10, '庚子'],
    type: '宗室',
    incident: '阜陵王刘延薨',
  },
  {
    time: ['和帝永元', 1],
    type: '灾害',
    incident: '这一年，有九个郡国发生大水灾。',
  },
  {
    time: ['和帝永元', 2, 1, '丁丑'],
    type: '其他',
    incident: '大赦天下囚徒',
  },
  {
    time: ['和帝永元', 2, 2, '壬午'],
    type: '天文',
    tags: ['日食'],
    incident: '日食',
  },
  {
    time: ['和帝永元', 2, 2, '己亥'],
    type: '官吏',
    incident: '再次设置西河、上郡属国都尉官职。',
  },
  {
    time: ['和帝永元', 2, 5, '庚戌'],
    type: '疆界',
    incident: '分泰山为济北国，分乐成、涿郡、渤海的部分为河间国。',
  },
  {
    time: ['和帝永元', 2, 5, '丙辰'],
    type: '宗室',
    incident:
      '封皇弟刘寿为济北王，刘开为河闲王，刘淑为城阳王，继封已故淮阳王刘昞的儿子刘侧为常山王。赐公卿以下至佐史钱布各有差。',
  },
  {
    time: ['和帝永元', 2, 5, '己未'],
    type: '战争',
    incident: '遣副校尉阎磐讨北匈奴，取伊吾卢地。',
  },
  {
    time: ['和帝永元', 2, 5, '丁卯'],
    type: '宗室',
    incident:
      '继封故齐王刘晃的儿子刘无忌为齐王，北海王刘睦的儿子刘威为北海王。',
  },
  {
    // time: ['和帝永元', , , ''],
    type: '外交',
    incident: '车师前王、后王都派遣王子入朝侍奉天子。',
  },
  {
    // time: ['和帝永元', , , ''],
    type: '战争',
    incident: '月氏国遣兵攻西域长史班超，班超率军回击并迫使他们投降。',
  },
  {
    time: ['和帝永元', 2, 6, '辛卯'],
    type: '宗室',
    incident: '中山王刘焉薨。',
  },
  {
    time: ['和帝永元', 2, 7, '乙卯'],
    type: '其他',
    incident: '大将军窦宪出屯凉州',
  },
  {
    time: ['和帝永元', 2, 9],
    type: '外交',
    incident: '北匈奴遣使称臣',
  },
  {
    time: ['和帝永元', 2, 10],
    type: '战争',
    incident:
      '遣行中郎将班固回访南单于。遣左谷蠡王师子出鸡鹿塞，击北匈奴于河云北，大破之。',
  },
  {
    time: ['和帝永元', 3, 1, '甲子'],
    type: '其他',
    incident: '皇帝加冠着朝服',
    source:
      '皇帝加元服，赐诸侯王、公、将军、特进、中二千石、列侯、宗室子孙在京师奉朝请者黄金，将、大夫、郎吏、从官帛。赐民爵及粟帛各有差，大酺五日。郡国中都官系囚死罪赎缣，至司寇及亡命，各有差。',
  },
  {
    time: ['和帝永元', 3, 1, '庚辰'],
    type: '其他',
    incident: '赏赐京师百姓酒宴，以及每两户共一匹布。',
  },
  {
    time: ['和帝永元', 3, 2],
    type: '战争',
    incident:
      '大将军窦宪遣左校尉耿夔出居延塞，围北单于于金微山，大破之，获其母阏氏。',
  },
  {
    time: ['和帝永元', 3, 6, '辛卯'],
    type: '外戚',
    incident: '尊皇太后之母比阳公主为长公主。',
  },
  {
    time: ['和帝永元', 3, 6, '辛丑'],
    type: '宗室',
    incident: '阜陵王刘种薨。',
  },
  {
    time: ['和帝永元', 3, 10, '癸未'],
    type: '诏书',
    incident:
      '和帝巡行到长安。因为匈奴和西域纷纷投降的缘故，下诏赏赐官员和百姓。',
    source:
      '行幸长安。诏曰：“北狄破灭，名王仍降，西域诸国，纳质内附，岂非祖宗迪哲重光之鸿烈欤？寤寐叹息，想望旧京。其赐行所过二千石长吏已下及三老、官属钱帛，各有差；鳏、寡、孤、独、笃缮、贫不能自存者粟，人三斛。”',
  },
  {
    time: ['和帝永元', 3, 11, '癸未'],
    type: '祭祀',
    incident:
      '祭祀高祖庙，接着祭扫前朝十一座陵墓。下诏派使者以中牢祭祀二臣，大鸿胪选择其近亲作为继承者，继承封侯。',
    source:
      '十一月癸卯，祠高庙，遂有事十一陵。诏曰：“高祖功臣，萧、曹为首，有传世不绝之义。曹相国后容城侯无嗣。朕望长陵东门，见二臣之垄，循其远节，每有感焉。忠义获宠，古今所同。可遣使者以中牢祠，大鸿胪求近亲宜为嗣者，须景风绍封，以章厥功。”',
  },
  {
    time: ['和帝永元', 3, 12],
    type: '官吏',
    incident: '恢复设置西域都尉、骑都尉、戊己校尉官职',
  },
  {
    time: ['和帝永元', 3, 12, '庚辰'],
    type: '其他',
    incident:
      '和帝从长安返回，减去那些除掉枷锁跟随军队出征的罪犯五个月的刑期。',
  },
  {
    time: ['和帝永元', 4, 1],
    type: '外交',
    incident:
      '北匈奴右谷蠡王于除鞬自立为单于，叩塞门请求朝廷接受自己投降。 和帝派遣大将军左校尉耿夔授予他印玺官绶。',
  },
  {
    time: ['和帝永元', 4, 3, '癸丑'],
    type: '官吏',
    incident: '司徒袁安薨',
  },
  {
    time: ['和帝永元', 4, -3, '丁丑'],
    type: '官吏',
    incident: '太常丁鸿为司徒',
  },
  {
    time: ['和帝永元', 4, 4, '丙辰'],
    type: '其他',
    incident: '大将军窦宪返回京师',
  },
  {
    time: ['和帝永元', 4, 6, '戊戌'],
    type: '天文',
    tags: ['日食'],
    incident: '日食',
  },
  {
    time: ['和帝永元', 4, 6, '丙辰'],
    type: '灾害',
    incident: '十三个郡国地震',
  },
  {
    time: ['和帝永元', 4, 6, '丙辰'],
    type: '其他',
    incident: '窦宪密谋弑君',
  },
  {
    time: ['和帝永元', 4, 6, '庚申'],
    type: '其他',
    incident: '和帝到达北宫，下诏铲除窦宪党羽。',
    source:
      '幸北宫。诏收捕宪党射声校尉郭璜，璜子侍中举，卫尉邓叠，叠弟步兵校尉磊，皆下狱死。使谒者仆射收宪大将军印绶，遣宪及弟笃、景就国，到皆自杀。',
  },
  {
    time: ['和帝永元', 4, '夏'],
    type: '灾害',
    incident: '发生旱灾，蝗虫成灾。',
  },
  {
    time: ['和帝永元', 4, 7, '己丑'],
    type: '官吏',
    incident: '太尉宋由因定罪为窦宪的党羽而自杀',
  },
  {
    time: ['和帝永元', 4, 8, '辛亥'],
    type: '官吏',
    incident: '司空任隗薨',
  },
  {
    time: ['和帝永元', 4, 8, '癸丑'],
    type: '官吏',
    incident: '大司农尹睦为太尉，录尚书事。',
  },
  {
    time: ['和帝永元', 4, 8, '丁巳'],
    type: '其他',
    incident: '赐公卿以下至佐史钱谷各有差。',
  },
  {
    time: ['和帝永元', 4, 10, '己亥'],
    type: '官吏',
    incident: '宗正刘方为司空。',
  },
  {
    time: ['和帝永元', 4, 12, '壬辰'],
    type: '救济',
    incident: '下诏减免灾民租税',
    source:
      '诏：“今年郡国秋稼为旱蝗所伤，其什四以上勿收田租、刍稿；有不满者，以实除之。”',
  },
  {
    // time: ['和帝永元', , , ''],
    type: '战争',
    incident: '武陵零陵澧中蛮反叛。烧当羌侵犯金城。',
  },
  {
    time: ['和帝永元', 5, 1, '乙亥'],
    type: '祭祀',
    incident: '宗祀五帝于明堂，遂登灵台，望云物。大赦天下。',
  },
  {
    time: ['和帝永元', 5, 1, '戊子'],
    type: '宗室',
    incident: '千乘王刘伉薨',
  },
  {
    time: ['和帝永元', 5, 1, '辛卯'],
    type: '宗室',
    incident: '封皇弟刘万岁为广宗王。',
  },
  {
    time: ['和帝永元', 5, 2, '戊戌'],
    type: '诏书',
    incident:
      '诏有司省减内外厩及凉州诸苑马。自京师离宫果园上林广成囿悉以假贫民，恣得采捕，不收其税。',
  },
  {
    time: ['和帝永元', 5, 2, '丁未'],
    type: '诏书',
    incident: '下诏警告官吏',
    source:
      '诏曰：“去年秋麦入少，恐民食不足。其上尤贫不能自给者户口人数。往者郡国上贫民，以衣履釜鬵为赀，而豪右得其饶利。诏书实核，欲有以益之，而长吏不能躬亲，反更徵召会聚，令失农作，愁扰百姓。若复有犯者，二千石先坐。”',
  },
  {
    time: ['和帝永元', 5, 2, '甲寅'],
    type: '官吏',
    incident: '太傅邓彪薨',
  },
  {
    time: ['和帝永元', 5, 2, '戊午'],
    type: '灾害',
    incident: '陇西地震',
  },
  {
    time: ['和帝永元', 5, 3, '戊子'],
    type: '诏书',
    incident: '下诏警告对选举推荐人才这一职责失职的二千石等官员',
    source:
      '诏曰：“选举良才，为政之本。科别行能，必由乡曲。而郡国举吏，不加简择，故先帝明敕在所，令试之以职，乃得充选。又德行尤异，不须经职者，别署状上。而宣布以来，出入九年，二千石曾不承奉，恣心从好，司隶、刺史讫无纠察。今新蒙赦令，且复申敕，后有犯者，显明其罚。在位不以选举为忧，督察不以发觉为负，非独州郡也。是以庶官多非其人。下民被奸邪之伤，由法不行故也。”',
  },
  {
    time: ['和帝永元', 5, 3, '庚寅'],
    type: '救济',
    incident: '派使者巡行，开仓赈济粮食三十余郡。',
    source: '遣使者分行贫民，举实流冗，开仓赈禀三十馀郡。',
  },
  {
    time: ['和帝永元', 5, 4, '壬子'],
    type: '宗室',
    incident: '册封阜陵王刘种之兄刘鲂为阜陵王。',
  },
  {
    time: ['和帝永元', 5, 6, '丁酉'],
    type: '灾害',
    incident: '三个郡国遭受冰雹',
  },
  {
    time: ['和帝永元', 5, 9, '辛酉'],
    type: '宗室',
    incident: '广宗王刘万岁薨，无子，国除。',
  },
  {
    type: '战争',
    incident: '匈奴单于於除鞬反叛朝廷，派遣中郎将任尚前往讨伐并消灭了他们。',
  },
  {
    time: ['和帝永元', 5, 9, '壬午'],
    incident: '下诏推行有利于百姓的政策',
    type: '诏书',
    source: '令郡县劝民蓄蔬食以助五谷。其官有陂池，令得采取，勿收假税二岁。',
  },
  {
    time: ['和帝永元', 5, 10, '辛未'],
    type: '官吏',
    incident: '太尉尹睦薨。',
  },
  {
    time: ['和帝永元', 5, 11, '乙丑'],
    type: '官吏',
    incident: '太仆张酺为太尉',
  },
  {
    time: ['和帝永元', 5],
    type: '其他',
    incident: `
      1. 武陵郡兵马攻破反叛的蛮人，迫使他们投降。
      2. 护羌校尉贯友领兵讨伐烧当羌，烧当羌便逃散而去。
      3. 南单于安国反叛，其舅骨都侯喜杀死安国。
    `,
  },
  {
    time: ['和帝永元', 6, 1],
    type: '外交',
    incident: '永昌边界以外的夷人派遣传译的信使向朝廷贡献犀牛、大象。',
  },
  {
    time: ['和帝永元', 6, 1, '己卯'],
    type: '官吏',
    incident: '司徒丁鸿薨',
  },
  {
    time: ['和帝永元', 6, 2, '乙未'],
    type: '救济',
    incident:
      '派遣掌管进见的谒者分别巡行三河、兖州、冀州、青州开仓禀贷赈济贫民。',
  },
  {
    time: ['和帝永元', 6, 2, '乙未'],
    type: '其他',
    incident: '许阳侯马光自杀。',
  },
  {
    time: ['和帝永元', 6, 2, '丁未'],
    type: '官吏',
    incident: '司空刘方为司徒，太常张奋为司空。',
  },
  {
    time: ['和帝永元', 6, 3, '庚寅'],
    type: '诏书',
    incident: '诏令流民所过郡国都要以实情来报告，适量减免田租、更赋。',
    source:
      '诏流民所过郡国皆实禀之，其有贩卖者勿出租税，又欲就贱还归者，复一岁田租、更赋。',
  },
  {
    time: ['和帝永元', 6, 3, '丙寅'],
    type: '诏书',
    incident: '下诏令三公、中二千石、二千石、内郡守相举贤良。',
    source:
      '诏曰：“朕以眇末，承奉鸿烈。阴阳不和，水旱违度，济河之域，凶馑流亡，而未获忠言至谋，所以匡救之策。寤寐永叹，用思孔疚。惟官人不得于上，黎民不安于下，有司不念宽和，而竞为苛刻，覆案不急，以妨民事，甚非所以上当天心，下济元元也。思得忠良之士，以辅朕之不逮。其令三公、中二千石、二千石、内郡守相举贤良方正、能直言极谏之士各一人。昭岩穴，披幽隐，遣诣公车，朕将悉听焉。”帝乃亲临策问，选补郎吏。',
  },
  {
    time: ['和帝永元', 6, 4],
    type: '外交',
    incident: '蜀郡边界以外的羌族首领率其部族并派遣使者归附朝廷。',
  },
  {
    time: ['和帝永元', 6, 5],
    type: '宗室',
    incident: '城阳王刘淑薨，无子，国除。',
  },
  {
    time: ['和帝永元', 6, 6, '己酉'],
    type: '其他',
    incident: '开始令伏日为闭尽日而不做他事。',
  },
  {
    time: ['和帝永元', 6, 7],
    type: '灾害',
    incident: '京师旱。',
    source: '京师旱。诏中都官徒各除半刑，谪其未竟，五月已下皆免遣。',
  },
  {
    time: ['和帝永元', 6, 7, '丁巳'],
    type: '其他',
    incident: '和帝到达洛阳官舍，审查囚犯，指出冤案。',
    source:
      '幸洛阳寺，录囚徒，举冤狱。收洛阳令下狱抵罪，司隶校尉、河南尹皆左降。未及还宫而澍雨。',
  },
  {
    incident: '西域都护班超大败焉耆、尉犁，斩其王。西域降服。',
    type: '战争',
    source:
      '西域都护班超大破焉耆、尉犁，斩其王。自是西域降服，纳质者五十馀国。',
  },
  {
    incident: '南单于安国堂弟的儿子逢侯率反叛的胡人逃亡出塞。',
    type: '其他',
  },
  {
    time: ['和帝永元', 6, 9, '癸丑'],
    type: '战争',
    incident:
      '以光禄勋邓鸿代行车骑将军理事，与越骑校尉冯柱、行度辽将军朱徽、使匈奴中郎将杜崇前往讨伐他们。',
  },
  {
    time: ['和帝永元', 6, 11],
    type: '战争',
    incident:
      '护乌桓校尉任尚率领乌桓、鲜卑兵马，大败逢侯，冯柱派兵追击，又打败了他们。',
  },
  {
    // time: ['和帝永元', 6, 11],
    incident: '诏令把渤海郡归属冀州管辖。',
    type: '疆界',
  },
  {
    // time: ['和帝永元', 6, 11],
    type: '战争',
    incident: '武陵漊中蛮叛，郡守发兵讨伐并且平息了叛乱。',
  },
  {
    time: ['和帝永元', 7, 1],
    type: '官吏',
    incident: '行车骑将军邓鸿、度辽将军朱徽、中郎将杜崇都因罪下狱死。',
  },
  {
    time: ['和帝永元', 7, 4, '辛亥'],
    type: '天文',
    tags: ['日食'],
    incident:
      '日食。皇帝召见官员询问得失。下诏在郎官中选三十人担任县令，随后以所选郎官补充县长、侯相。',
    source:
      '日有食之。帝引见公卿问得失，令将、大夫、御史、谒者、博士、议郎、郎官会廷中，各言封事。诏曰：“元首不明，化流无良，政失于民，谪见于天。深惟庶事，五教在宽，是以旧典因孝廉之举，以求其人。有司详选郎官宽博有谋才任典城者三十人。”既而悉以所选郎出补长、相。',
  },
  {
    time: ['和帝永元', 7, 5, '辛卯'],
    type: '疆界',
    incident: '改千乘国为乐安国。',
  },
  {
    time: ['和帝永元', 7, 6, '丙寅'],
    type: '宗室',
    incident: '沛王刘定薨。',
  },
  {
    time: ['和帝永元', 7, 7, '乙巳'],
    type: '灾害',
    incident: '易阳出现地裂现象。',
  },
  {
    time: ['和帝永元', 7, 9, '癸卯'],
    type: '灾害',
    incident: '京师地震。',
  },
  {
    time: ['和帝永元', 8, 2, '己丑'],
    type: '外戚',
    incident: '立贵人阴氏为皇后。',
    source:
      '立贵人阴氏为皇后。赐天下男子爵，人二级，三老、孝悌、力田三级，民无名数及流民欲占者一级；鳏、寡、孤、独、笃缮、贫不能自存者粟，人五斛。',
  },
  {
    time: ['和帝永元', 8, 4, '癸亥'],
    type: '宗室',
    incident: '乐成王刘党薨。',
  },
  {
    time: ['和帝永元', 8, 4, '甲子'],
    type: '救济',
    incident: '诏令救济并州四郡的贫民。',
  },
  {
    time: ['和帝永元', 8, 5],
    type: '灾害',
    incident: '河内、陈留发生蝗灾。',
  },
  {
    // time: ['和帝永元', 8, 5],
    type: '战争',
    incident: '南匈奴右温禺犊王反叛，为寇。',
  },
  {
    time: ['和帝永元', 8, 7],
    type: '战争',
    incident: '行度辽将军庞奋、越骑校尉冯柱前往追击讨伐他们，斩右温禺犊王。',
  },
  {
    // time: ['和帝永元', 8, 7],
    type: '战争',
    incident: '车师后王反叛，攻击其前王。',
  },
  {
    time: ['和帝永元', 8, 8, '辛酉'],
    incident: '饮酎', // 一种礼节
    type: '其他',
    source:
      '饮酎。诏郡国中都官系囚减死一等，诣敦煌戍。其犯大逆，募下蚕室；其女子宫。自死罪已下，至司寇及亡命者入赎，各有差。',
  },
  {
    time: ['和帝永元', 8, 9],
    type: '灾害',
    incident: '京师蝗灾',
    source:
      '京师蝗。吏民言事者，多归责有司。诏曰：“蝗虫之异，殆不虚生，万方有罪，在予一人，而言事者专咎自下，非助我者也。朕寤寐恫瘝，思弭忧衅。昔楚严无灾而惧，成王出郊而反风。将何以匡朕不逮，以塞灾变？百僚师尹勉修厥职，刺史、二千石详刑辟，理冤虐，恤鳏寡，矜孤弱，思惟致灾兴蝗之咎。”',
  },
  {
    time: ['和帝永元', 8, 9, '庚子'],
    type: '疆界',
    incident: '恢复设置广阳郡。',
  },
  {
    time: ['和帝永元', 8, 10, '乙丑'],
    type: '宗室',
    incident: '北海王刘威有罪自杀。',
  },
  {
    time: ['和帝永元', 8, 12, '辛亥'],
    type: '宗室',
    incident: '陈王刘羡薨。',
  },
  {
    time: ['和帝永元', 8, 12, '丁巳'],
    type: '灾害',
    incident: '南宫宣室殿发生火灾。',
  },
  {
    time: ['和帝永元', 9, 1],
    type: '外交',
    incident: '永昌界外的蛮夷及掸国通过辗转翻译向朝廷贡奉。',
  },
  {
    time: ['和帝永元', 9, 3, '庚辰'],
    type: '灾害',
    incident: '陇西发生地震。',
  },
  {
    time: ['和帝永元', 9, 3, '癸巳'],
    type: '宗室',
    incident: '济南王刘康薨。',
  },
  {
    time: ['和帝永元', 9, 3, '癸巳'],
    type: '战争',
    incident: '西域长史王林攻打车师后王，并杀死了他。',
  },
  {
    time: ['和帝永元', 9, 4, '丁卯'],
    type: '宗室',
    incident: '册封乐成王刘党的儿子刘巡为乐成王。',
  },
  {
    time: ['和帝永元', 9, 6],
    type: '灾害',
    incident: '有蝗虫灾害、旱灾。',
  },
  {
    time: ['和帝永元', 9, 6, '戊辰'],
    type: '救济',
    incident: '下诏',
    source:
      '今年秋稼为蝗虫所伤，皆勿收租、更、刍稿；若有所损失，以实除之，馀当收租者亦半入。其山林饶利，陂池渔采，以赡元元，勿收假税。',
  },
  {
    time: ['和帝永元', 9, 7],
    type: '灾害',
    incident: '蝗虫飞过京师。',
  },
  {
    time: ['和帝永元', 9, 8],
    type: '其他',
    incident: '鲜卑侵犯肥如县，辽东太守祭参因罪下狱死。',
  },
  {
    time: ['和帝永元', 9, -8, '辛巳'],
    type: '外戚',
    incident: '皇太后窦氏崩。',
  },
  {
    time: ['和帝永元', 9, -8, '丙申'],
    type: '外戚',
    incident:
      '安葬章徳皇后，烧当羌侵犯陇西，和帝派遣征西将军刘尚、越骑校尉赵世等领兵前往讨伐并大败他们。',
  },
  {
    time: ['和帝永元', 9, 9, '庚申'],
    type: '官吏',
    incident: '以策书罢免司徒刘方官职，刘方自杀。',
  },
  {
    time: ['和帝永元', 9, 9, '甲子'],
    type: '外戚',
    incident: '追尊皇帝去世的母亲梁贵人为皇太后。',
  },
  {
    time: ['和帝永元', 9, 10, '乙酉'],
    type: '外戚',
    incident: '将恭怀梁皇后葬于西陵。',
  },
  {
    time: ['和帝永元', 9, 11, '癸卯'],
    type: '官吏',
    incident: '光禄勋河南吕盖为司徒。',
  },
  {
    time: ['和帝永元', 9, 12, '丙寅'],
    type: '官吏',
    incident: '司空张奋被罢官。',
  },
  {
    time: ['和帝永元', 9, 12, '壬申'],
    type: '官吏',
    incident: '太仆韩棱为司空。',
  },
  {
    time: ['和帝永元', 9, 12, '己丑'],
    type: '官吏',
    incident: '恢复设置若卢狱官。',
  },
  {
    time: ['和帝永元', 10, 3, '壬戌'],
    type: '诏书',
    incident: '下诏警告刺史、二千石不要松懈修筑堤防沟渠之事。',
    source:
      '堤防沟渠，所以顺助地理，通利壅塞。今废慢懈弛，不以为负。刺史、二千石其随宜疏导。勿因缘妄发，以为烦扰，将显行其罚。',
  },
  {
    time: ['和帝永元', 10, 5],
    type: '灾害',
    incident: '京师发大水',
  },
  {
    time: ['和帝永元', 10, 7, '己巳'],
    type: '官吏',
    incident: '司空韩棱薨。',
  },

  {
    time: ['和帝永元', 10, 8, '丙子'],
    type: '官吏',
    incident: '太常巢堪为司空。',
  },
  {
    time: ['和帝永元', 10, 9, '庚戌'],
    type: '官吏',
    incident: '恢复设置廪牺官。',
  },
  {
    time: ['和帝永元', 10, 10],
    type: '灾害',
    incident: '五州发生大雨水',
  },
  {
    time: ['和帝永元', 10, 12],
    type: '外交',
    incident: '烧当羌首领迷唐等率族人到朝门行礼贡献。',
  },
  {
    time: ['和帝永元', 10, 12, '戊寅'],
    type: '宗室',
    incident: '梁王刘畅薨。',
  },
  {
    time: ['和帝永元', 11, 2],
    type: '救济',
    incident: '和帝派遣使者循行郡国，开仓赈济。',
    source: '遣使循行郡国，禀贷被灾害不能自存者，令得渔采山林池泽，不收假税。',
  },
  {
    time: ['和帝永元', 11, 2, '丙午'],
    type: '诏书',
    incident: '下诏',
    source: '诏郡国中都官徒及笃缮老小女徒各除半刑，其未竟三月者，皆免归田里。',
  },
  {
    time: ['和帝永元', 11, 4, '丙寅'],
    type: '其他',
    incident: '大赦天下囚徒',
  },
  {
    time: ['和帝永元', 11, 4, '己巳'],
    type: '官吏',
    incident: '恢复设置右校尉官职。',
  },
  {
    time: ['和帝永元', 11, 7, '辛卯'],
    type: '诏书',
    incident: '下诏重申节制安葬过于奢华行为的法令。',
    source:
      '吏民逾僭，厚死伤生，是以旧令节之制度。顷者贵戚近亲，百僚师尹，莫肯率从，有司不举，怠放日甚。又商贾小民，或忘法禁，奇巧靡货，流积公行。其在位犯者，当先举正。巿道小民，但且申明宪纲，勿因科令，加虐羸弱。',
  },
  {
    time: ['和帝永元', 12, 2],
    type: '外交',
    incident: '旄牛边界外的白狼、貗薄夷率部族内归朝廷。',
  },
  {
    time: ['和帝永元', 12, 2],
    type: '救济',
    incident: '下诏救济灾民。',
    source:
      '诏贷被灾诸郡民种粮。赐下贫、鳏、寡、孤、独、不能自存者，及郡国流民，听入陂池渔采，以助蔬食。',
  },
  {
    time: ['和帝永元', 12, 3, '丙申'],
    type: '救济',
    incident: '下诏谴责官吏，并救济灾民。',
    source:
      '诏曰：“比年不登，百姓虚匮。京师去冬无宿雪，今春无澍雨，黎民流离，困于道路。朕痛心疾首，靡知所济。‘瞻仰昊天，何辜今人？’三公朕之腹心，而未获承天安民之策。数诏有司，务择良吏。今犹不改，竞为苛暴，侵愁小民，以求虚名，委任下吏，假埶行邪。是以令下而奸生，禁至而诈起。巧法析律，饰文增辞，货行于言，罪成乎手，朕甚病焉，公卿不思助明好恶，将何以救其咎罚？咎罚既至，复令灾及小民。若上下同心，庶或有瘳。其赐天下男子爵，人二级，三老、孝悌、力田三级，民无名数及流民欲占者人一级；鳏、寡、孤、独、笃缮、贫不能自存者粟，人三斛。”',
  },
  {
    time: ['和帝永元', 12, 3, '壬子'],
    type: '其他',
    incident: '赏赐在太学的博士员弟子布，每人三匹。',
  },
  {
    time: ['和帝永元', 12, 4],
    type: '其他',
    incident: '日南象林蛮夷反叛，郡兵前往讨伐并打败了他们。',
  },
  {
    time: ['和帝永元', 12, -5],
    type: '救济',
    incident: '救济敦煌、张掖、五原百姓中非常贫穷的人粮食。',
  },
  {
    time: ['和帝永元', 12, -5, '戊辰'],
    type: '灾害',
    incident: '赈归山崩',
  },
  {
    time: ['和帝永元', 12, 6],
    type: '灾害',
    title: '舞阳大水',
    incident:
      '舞阳发生大水，赏赐给被水灾侵害所致而导致特别贫穷的人粮食，每人三斛',
  },
  {
    time: ['和帝永元', 12, 7, '辛亥'],
    type: '天文',
    tags: ['日食'],
    incident: '日食',
  },
  {
    time: ['和帝永元', 12, 9, '戊午'],
    type: '官吏',
    incident: '太尉张酺免',
  },
  {
    time: ['和帝永元', 12, 9, '丙寅'],
    type: '官吏',
    incident: '大司农张禹为太尉',
  },
  {
    time: ['和帝永元', 12, 11],
    type: '外交',
    incident: '西域蒙奇、兜勒二国遣使内附，赐其王金印紫绶。',
  },
  {
    time: ['和帝永元', 12],
    type: '其他',
    incident: '烧当羌又反叛',
  },
  {
    time: ['和帝永元', 13, 1, '丁丑'],
    type: '官吏',
    incident:
      '和帝出行到东观，观览书林，浏览书籍，广泛选拔那些有学术和技艺之士以充任官吏。',
  },
  {
    time: ['和帝永元', 13, 2],
    type: '宗室',
    incident: '任城王刘尚薨。',
  },
  {
    time: ['和帝永元', 13, 2, '丙午'],
    type: '救济',
    incident: '赈济灾民',
    source: '赈贷张掖、居延、朔方、日南贫民及孤、寡、羸弱不能自存者。',
  },
  {
    time: ['和帝永元', 13, 8],
    type: '救济',
    incident: '下诏赈济灾民',
    source: '诏象林民失农桑业者，赈贷种粮，禀赐下贫谷食。',
  },
  {
    time: ['和帝永元', 13, 8, '己亥'],
    type: '灾害',
    incident: '白宫盛馔门阁失火',
  },
  {
    // time: ['和帝永元', 13, 8, '己亥'],
    type: '战争',
    incident: '护羌校尉周鲔击烧当羌，破之。',
  },
  {
    time: ['和帝永元', 13, 9, '壬子'],
    type: '灾害',
    incident: '荆州连续下雨。下诏减免部分租税。',
    source:
      '荆州雨水。九月壬子，诏曰：“荆州比岁不节，今兹淫水为害，馀虽颇登，而多不均浃，深惟四民农食之本，惨然怀矜。其令天下半入今年田租、刍稿；有宜以实除者，如故事。贫民假种食，皆勿收责。”',
  },
  {
    time: ['和帝永元', 13, 11],
    type: '外交',
    incident: '安息国遣使贡献狮子及条支国的鸵鸟',
  },
  {
    time: ['和帝永元', 13, 11, '丙辰'],
    type: '推举人才',
    incident: '下诏令边郡举孝廉',
    source:
      '诏曰：“幽、并、凉州户口率少，边役众剧，束修良吏，进仕路狭。抚接夷狄，以人为本。其令缘边郡口十万以上岁举孝廉一人，不满十万二岁举一人，五万以下三岁举一人。”',
  },
  {
    // time: ['和帝永元', , , ''],
    type: '战争',
    incident: '鲜卑寇右北平，于是进入渔阳，渔阳太守派兵马攻打并击败了他们。',
  },
  {
    time: ['和帝永元', 13, 11, '戊辰'],
    type: '官吏',
    incident: '司徒吕盖被罢免',
  },
  {
    time: ['和帝永元', 13, 12, '丁丑'],
    type: '官吏',
    incident: '光禄勋鲁恭为司徒',
  },
  {
    time: ['和帝永元', 13, 12, '辛卯'],
    type: '战争',
    incident: '巫蛮叛乱，侵犯南郡。',
  },
  {
    time: ['和帝永元', 14, 2, '乙卯'],
    type: '宗室',
    incident: '东海王刘政薨。',
  },
  {
    time: ['和帝永元', 14, 2, '乙卯'],
    type: '其他',
    incident: '修缮过去的西海郡，调金城西部校尉前往戍守。',
  },
  {
    time: ['和帝永元', 14, 3, '戊辰'],
    type: '其他',
    incident: '和帝亲临辟雍，宴饮宾客并举行射箭之礼，大赦天下囚徒。',
  },
  {
    time: ['和帝永元', 14, 4],
    type: '战争',
    incident: '和帝派遣使者督师荆州兵马讨伐巫蛮，打败并迫使他们投降。',
  },
  {
    time: ['和帝永元', 14, 4, '庚辰'],
    type: '救济',
    incident: '救济张掖、居延、敦煌、五原、汉阳、会稽的流民。',
  },
  {
    time: ['和帝永元', 14, 5, '丁未'],
    type: '官吏',
    incident: '开始设置象林将兵长吏官',
  },
  {
    time: ['和帝永元', 14, 6, '辛卯'],
    type: '外戚',
    incident: '废皇后阴氏，皇后的父亲特进阴纲自杀。',
  },
  {
    time: ['和帝永元', 14, 7, '甲寅'],
    type: '诏书',
    incident: '诏令免除象林县二年的更赋、田租、草料。',
  },
  {
    time: ['和帝永元', 14, '秋'],
    type: '灾害',
    incident: '这一年秋天，兖州、豫州、荆州因雨而涝。',
  },
  {
    time: ['和帝永元', 14, 10, '甲申'],
    type: '救济',
    incident: '和帝下诏减免灾民的租税',
    source:
      '诏：“兖、豫、荆州今年水雨淫过，多伤农功。其令被害什四以上皆半入田租、刍稿；其不满者，以实除之。”',
  },
  {
    time: ['和帝永元', 14, 10, '辛卯'],
    type: '外戚',
    incident: '立贵人邓氏为皇后',
  },
  {
    time: ['和帝永元', 14, 10, '丁酉'],
    type: '官吏',
    incident: '司空巢堪被罢免',
  },
  {
    time: ['和帝永元', 14, 11, '癸卯'],
    type: '官吏',
    incident: '大司农徐防为司空',
  },
  {
    time: ['和帝永元', 14],
    type: '其他',
    incident: '开始恢复设置郡国上计补郎官职',
  },
  {
    time: ['和帝永元', 15, -1, '乙未'],
    type: '诏书',
    incident: '诏令流民想要归乡官府要提供帮助，不想要归乡的不要勉强。',
    source:
      '诏流民欲还归本而无粮食者，过所实禀之，疾病加致医药；其不欲还归者，勿强。',
  },
  {
    time: ['和帝永元', 15, 2],
    type: '诏书',
    incident: '诏令赈济颍川、汝南、陈留、江夏、梁国、敦煌的贫民',
  },
  {
    time: ['和帝永元', 15, 4, '甲子'],
    type: '天文',
    tags: ['日食'],
    incident: '日食',
  },
  {
    time: ['和帝永元', 15, 5, '戊寅'],
    type: '灾害',
    incident: '南阳有大风',
  },
  {
    time: ['和帝永元', 15, 6],
    type: '诏书',
    incident:
      '诏令百姓当中的骡夫和寡妇可以在山坡池塘采集捕捞，并且两年不要收他们的租税。',
  },
  {
    time: ['和帝永元', 15, 7, '丙寅'],
    type: '宗室',
    incident: '济南王刘错薨。',
  },
  {
    time: ['和帝永元', 15, 7, '丙寅'],
    type: '官吏',
    incident: '恢复设置涿郡故安铁官',
  },
  {
    time: ['和帝永元', 15, 9, '壬午'],
    type: '其他',
    incident: '南巡，赏赐所经过地区的官员及百姓',
    source:
      '南巡狩，清河王庆、济北王寿、河闲王开并从。赐所过二千石长吏以下、三老、官属及民百年者钱布，各有差。',
  },
  {
    time: ['和帝永元', 15, '秋'],
    type: '灾害',
    incident: '四州因大雨而发大水',
  },
  {
    time: ['和帝永元', 15, 10, '戊申'],
    type: '其他',
    incident: '和帝到达章陵，祭祀旧宅。',
  },
  {
    time: ['和帝永元', 15, 10, '癸丑'],
    type: '其他',
    incident: '祭祀园庙，在旧庐会见宗室族亲，作乐并慰劳行赏',
  },
  {
    time: ['和帝永元', 15, 10, '戊午'],
    type: '其他',
    incident: '和帝行进到云梦，亲临汉水而还。',
  },
  {
    time: ['和帝永元', 15, 11, '甲申'],
    type: '其他',
    incident:
      '皇帝一行返回洛阳宫，赏赐随从大臣和留守朝政的公卿以下官员钱和布，按级分等。',
  },
  {
    time: ['和帝永元', 15, 12, '庚子'],
    type: '宗室',
    incident: '琅琊王刘宇薨',
  },
  {
    time: ['和帝永元', 15, 12, '庚子'],
    type: '其他',
    incident:
      '有关主管上奏，以为夏至之时则微阴起，靡细之草枯死时，可以判决小罪。',
  },
  {
    time: ['和帝永元', 15],
    type: '其他',
    incident: '这一年，开始命令郡国以太阳北至之时起审理较轻的罪行。',
  },
  {
    time: ['和帝永元', 16, 1, '己卯'],
    type: '诏书',
    incident: '诏令贫民中有田业而因资用缺乏而不能自耕的人，贷给他们粮食。',
  },
  {
    time: ['和帝永元', 16, 2, '己未'],
    type: '诏书',
    incident:
      '诏令兖州、豫州、徐州、冀州四州因连年多雨而损伤庄稼，禁止酿酒买卖。',
  },
  {
    time: ['和帝永元', 16, 4],
    type: '其他',
    incident:
      '派遣三府掾官分别巡行四州，贫苦百姓没有能力耕种的，为他们雇犁具和耕牛植耕田地。',
  },
  {
    time: ['和帝永元', 16, 5, '壬午'],
    type: '宗室',
    incident: '赵王刘商薨',
  },
  {
    time: ['和帝永元', 16, 7],
    type: '灾害',
    incident: '发生旱灾',
  },
  {
    time: ['和帝永元', 16, 7, '戊午'],
    type: '诏书',
    incident:
      '因为旱灾，怀疑是官吏所作苛刻所致。下诏暂缓在法律上有疑问的囚徒的判决，检查苛刻的官吏。',
    source:
      '诏曰：“今秋稼方穗而旱，云雨不沾，疑吏行惨刻，不宣恩泽，妄拘无罪，幽闭良善所致。其一切囚徒于法疑者勿决，以奉秋令。方察烦苛之吏，显明其罚。”',
  },
  {
    time: ['和帝永元', 16, 7, '辛酉'],
    type: '官吏',
    incident: '司徒鲁恭被罢免',
  },
  {
    time: ['和帝永元', 16, 7, '庚午'],
    type: '官吏',
    incident: '光禄勋张酺为司徒',
  },
  {
    time: ['和帝永元', 16, 7, '辛巳'],
    type: '救济',
    incident: '下诏减免租税',
    source:
      '诏令天下皆半入今年田租、刍稿；其被灾害者，以实除之。贫民受贷种粮及田租、刍稿、皆勿收责。',
  },
  {
    time: ['和帝永元', 16, 8, '己酉'],
    type: '官吏',
    incident: '司徒张酺薨',
  },
  {
    time: ['和帝永元', 16, 10, '辛卯'],
    type: '官吏',
    incident: '司空徐防为司徒，大鸿胪陈宠为司空。',
  },
  {
    time: ['和帝永元', 16, 11, '己丑'],
    type: '其他',
    incident: '和帝巡行到缑氏，登上百岯山，各按等级赏赐随从到百官和群臣。',
  },
  {
    time: ['和帝永元', 16, 11, '己丑'],
    type: '外交',
    incident: '北匈奴派遣使者向朝廷贡献称臣。',
  },
  {
    time: ['和帝永元', 16, 12],
    type: '官吏',
    incident: '恢复设置辽东西部都尉官职',
  },
  {
    time: ['和帝元兴', 1, 1, '戊午'],
    type: '官吏',
    incident:
      '和帝在宫中召见三署郎，选出七十五人，补充谒者、县长、郡相的官职。',
  },
  {
    // time: ['和帝元兴', , , ''],
    type: '战争',
    incident: '高句骊侵犯辽东郡边界',
  },
  {
    time: ['和帝元兴', 1, 4, '庚午'],
    type: '其他',
    incident:
      '大赦天下囚徒，改年号为元兴。宗室中因罪而取消其显贵地位的，全部恢复他们所属宗室祖籍的地位。 ',
  },
  {
    time: ['和帝元兴', 1, 5, '癸酉'],
    type: '灾害',
    incident: '雍地发生地裂',
  },
  {
    time: ['和帝元兴', 1, 9],
    type: '战争',
    incident: '辽东太守庚夔攻打貊人，打败了他们。',
  },
  {
    time: ['和帝元兴', 1, 12, '辛未'],
    type: '其他',
    incident: '和帝崩于章徳前殿，年二十七。立皇子隆为皇太子。赏赐天下。',
    source:
      '帝崩于章德前殿，年二十七。立皇子隆为皇太子。赐天下男子爵，人二级，三老、孝悌、力田人三级，民无名数及流民欲占者人一级；鳏、寡、孤、独、笃缮、贫不能自存者粟，人三斛。',
  },
];

// 殇帝--刘隆
const 殇帝: Incident[] = [
  {
    time: ['和帝永元', 1, 12, '辛未'],
    type: '其他',
    incident: '即皇帝位，当时他才诞生一百余日。尊皇后曰皇太后，太后临朝。',
  },
  {
    type: '外交',
    incident: '北匈奴遣使称臣，到敦煌进贡奉献。',
  },
  {
    time: ['殇帝延平', 1, 1, '辛卯'],
    type: '官吏',
    incident:
      '太尉张禹为太傅。司徒徐防为太尉，参录尚书事，百官都听从他的管理。',
  },
  {
    time: ['殇帝延平', 1, 1, '辛卯'],
    type: '宗室',
    incident: '封皇兄刘胜为平原王',
  },
  {
    time: ['殇帝延平', 1, 1, '癸卯'],
    type: '官吏',
    incident: '光禄勋梁鲔为司徒',
  },
  {
    time: ['殇帝延平', 1, 3, '甲申'],
    type: '其他',
    incident: '葬孝和皇帝于慎陵，尊庙号为穆宗。',
  },
  {
    time: ['殇帝延平', 1, 3, '丙戌'],
    type: '宗室',
    incident: '清河王刘庆、济北王刘寿、河闲王刘开、常山王刘章开始到封国就任。',
  },
  {
    time: ['殇帝延平', 1, 4, '庚申'],
    type: '官吏',
    incident: '诏令罢免祀官不在祀典之位的人的官职',
  },
  {
    // time: ['殇帝延平', 1, , ''],
    type: '战争',
    incident: '鲜卑侵犯渔阳，渔阳太守张显追击，战死。',
  },
  {
    time: ['殇帝延平', 1, 4, '丙寅'],
    type: '官吏',
    incident: '以虎贲中郎将邓骘为车骑将军',
  },
  {
    time: ['殇帝延平', 1, 4, '丙寅'],
    type: '官吏',
    incident: '司空陈宠薨',
  },
  {
    time: ['殇帝延平', 1, 5, '辛卯'],
    type: '其他',
    incident: '皇太后诏令大赦天下囚徒',
    source:
      '皇太后诏曰：“皇帝幼冲，承统鸿业，朕且权佐助听政，兢兢寅畏，不知所济。深惟至治之本，道化在前，刑罚在后。将稽中和，广施庆惠，与吏民更始。其大赦天下。自建武以来诸犯禁锢，诏书虽解，有司持重，多不奉行，其皆复为平民。”',
  },
  {
    time: ['殇帝延平', 1, 5, '壬辰'],
    type: '灾害',
    incident: '河东垣县发生山崩',
  },
  {
    time: ['殇帝延平', 1, 6, '丁未'],
    type: '官吏',
    incident: '太常尹勤为司空',
  },
  {
    // time: ['殇帝延平', , , ''],
    type: '灾害',
    incident: '三十七个郡国因大雨而发水',
  },
  {
    time: ['殇帝延平', 1, 6, '己未'],
    type: '其他',
    incident:
      '下诏说因为大雨的灾害，为了对局势有所帮助，裁减太官、导官、尚方、内署各种服用的珍膳及那些靡贵华丽且很难得到的物品。',
    source:
      '诏曰：“自夏以来，阴雨过节，飕气不效，将有厥咎。寤寐忧惶，未知所由。昔夏后恶衣服，菲饮食，孔子曰‘吾无闲然’。今新遭大忧，且岁节未和，彻膳损服，庶有补焉。其减太官、导官、尚方、内署诸服御珍膳靡丽难成之物。”',
  },
  {
    time: ['殇帝延平', 1, 6, '丁卯'],
    type: '其他',
    incident: '诏令司徒、大司农、长乐少府遣送宫人',
    source:
      '诏司徒、大司农、长乐少府曰：“朕以无德，佐助统政，夙夜经营，惧失厥衷。思惟治道，由近及远，先内后外。自建武之初以至于今，八十馀年，宫人岁增，房御弥广。又宗室坐事没入者，犹托名公族，甚可愍焉。今悉免遣，及掖庭宫人，皆为庶民，以抒幽隔郁滞之情。诸官府、郡国、王侯家奴婢姓刘及疲缮羸老，皆上其名，务令实悉。”',
  },
  {
    time: ['殇帝延平', 1, 7, '庚寅'],
    type: '其他',
    incident: '告诫司隶校尉、部刺史，让他们好好履行监察各郡国的职责。',
    source:
      '敕司隶校尉、部刺史曰：“夫天降灾戾，应政而至。闲者郡国或有水灾，妨害秋稼。朝廷惟咎，忧惶悼惧。而郡国欲获丰穰虚饰之誉，遂覆蔽灾害，多张垦田，不揣流亡，竞增户口，掩匿盗贼，令奸恶无惩，署用非次，选举乖宜，贪苛惨毒，延及平民。刺史垂头塞耳，阿私下比，‘不畏于天，不愧于人’。假贷之恩，不可数恃，自今以后，将纠其罚。二千石长吏其各实核所伤害，为除田租、刍稿。”',
  },
  {
    time: ['殇帝延平', 1, 8, '辛亥'],
    type: '其他',
    incident: '殇帝崩',
  },
  {
    time: ['殇帝延平', 1, 8, '癸丑'],
    type: '其他',
    incident: '在崇德前殿停放灵柩，年二岁。',
  },
];

// 安帝--刘祜
const 安帝: Incident[] = [
  {
    time: ['殇帝延平', 1, 8, '辛亥'],
    type: '其他',
    incident:
      '孝章皇帝之孙，清河王刘庆之子，刘祜被皇太后及其兄车骑将军邓骘拥立，拜为长安侯。',
  },
  {
    time: ['殇帝延平', 1, 8, '癸丑'],
    type: '其他',
    incident: '刘祜即皇帝位，年十三岁。皇太后仍然临朝听政。',
  },
  {
    time: ['殇帝延平', 1, 9, '庚子'],
    type: '祭祀',
    incident: '拜谒高祖庙',
  },
  {
    time: ['殇帝延平', 1, 9, '辛丑'],
    type: '祭祀',
    incident: '拜谒光武庙',
  },
  {
    // time: ['殇帝延平', 1, , ''],
    type: '灾害',
    incident: '六个州发大水。',
  },
  {
    time: ['殇帝延平', 1, 9, '己未'],
    type: '救济',
    incident: '派遣谒者分别到各地察看实际情况，报告灾害结果，救济穷困的人。',
  },
  {
    time: ['殇帝延平', 1, 9, '丙寅'],
    type: '其他',
    incident: '葬孝殇皇帝于康陵',
  },
  {
    time: ['殇帝延平', 1, 9, '乙亥'],
    type: '灾害',
    incident: '有陨石落在陈留',
  },
  {
    // time: ['殇帝延平', 1, , ''],
    type: '战争',
    incident:
      '西域各国叛乱，攻击都护任尚，派遣副校尉梁慬援救任尚，击败了他们。',
  },
  {
    time: ['殇帝延平', 1, 10],
    type: '灾害',
    incident: '四个州发大水，下冰雹。皇帝下令因冬麦无收成，救济贫困的人。',
  },
  {
    time: ['殇帝延平', 1, 12, '甲子'],
    type: '宗室',
    incident: '清河王薨，派司空持符节去吊祭，车骑将军邓骘主持办理丧事。', // 安帝之父
  },
  {
    time: ['殇帝延平', 1, 12, '乙酉'],
    type: '其他',
    incident: '命令停止表演鱼龙曼延等各种戏目',
  },
  {
    time: ['安帝永初', 1, 1, '癸酉'],
    type: '其他',
    incident: '大赦天下',
  },
  {
    // time: ['安帝永初', , , ''],
    type: '外交',
    incident: '蜀郡边境外羌人内附',
  },
  {
    time: ['安帝永初', 1, 1, '戊寅'],
    type: '疆界',
    incident: '分犍为南部为属国都尉',
  },
  {
    time: ['安帝永初', 1, 1, '戊寅'],
    type: '救济',
    incident: '司隶、兖、豫、徐、冀、并等州官府开仓共给贫民粮食',
  },
  {
    time: ['安帝永初', 1, 2, '丙午'],
    type: '救济',
    incident: '以广成游猎的土地以及受灾郡国的公田借给贫民耕种',
  },
  {
    time: ['安帝永初', 1, 2, '丁卯'],
    type: '宗室',
    incident: '分清河国封给皇帝的兄弟刘常保为广川王。',
  },
  {
    time: ['安帝永初', 1, 2, '庚午'],
    type: '官吏',
    incident: '司徒梁鲔薨',
  },
  {
    time: ['安帝永初', 1, 3, '癸酉'],
    type: '天文',
    tags: ['日食'],
    incident: '日食',
  },
  {
    time: ['安帝永初', 1, 3, '癸酉'],
    type: '推举人才',
    incident:
      '诏公卿内外众官、郡国守相，举贤良方正、有道术之士，明政术、达古今、能直言极谏者，各一人。',
  },
  {
    time: ['安帝永初', 1, 3, '己卯'],
    type: '外交',
    incident: '永昌边境外僬侥种夷贡献物品内附',
  },
  {
    time: ['安帝永初', 1, 3, '甲申'],
    type: '宗室',
    incident: '葬清河孝王，赠举龙旗、虎贲仪仗送葬。',
  },
  {
    time: ['安帝永初', 1, 5, '甲戌'],
    type: '官吏',
    incident: '长乐卫尉鲁恭为司徒',
  },
  {
    time: ['安帝永初', 1, 5, '丁丑'],
    type: '宗室',
    incident: '下诏封北海王刘睦的孙子寿光侯刘普为北海王。',
  },
  {
    // time: ['安帝永初', 1, , ''],
    type: '外交',
    incident: '九真境外夜郎蛮夷全境内附',
  },
  {
    time: ['安帝永初', 1, 6, '戊申'],
    type: '外戚',
    incident: '封皇太后之母阴氏为新野君的爵位',
  },
  {
    time: ['安帝永初', 1, 6, '丁巳'],
    type: '灾害',
    incident: '河东出现地陷',
  },
  {
    time: ['安帝永初', 1, 6, '壬戌'],
    type: '官吏',
    incident: '罢西域都护',
  },
  {
    // time: ['安帝永初', 1, , ''],
    type: '战争',
    incident:
      '先零种羌叛变，截断蜀道，大肆抢掠，派遣车骑将军邓骘、征西校尉任尚讨伐他们。',
  },
  {
    time: ['安帝永初', 1, 6, '丁卯'],
    type: '其他',
    incident: '赦免各羌互相勾结阴谋叛乱人的罪行',
  },
  {
    time: ['安帝永初', 1, 9, '庚午'],
    type: '其他',
    incident:
      '皇帝令三公明确重申旧有法令，禁止奢侈，不要作浮华奇巧的物品，耗尽财物隆重办理丧葬。',
  },
  {
    time: ['安帝永初', 1, 9, '庚午'],
    type: '官吏',
    incident: '太尉徐防被罢免',
  },
  {
    time: ['安帝永初', 1, 9, '辛未'],
    type: '官吏',
    incident: '司空尹勤被罢免',
  },
  {
    time: ['安帝永初', 1, 9, '癸酉'],
    type: '其他',
    incident: '调扬州五郡的租米，供给东郡、济阴、陈留、梁国、下邳、山阳等地。',
  },
  {
    time: ['安帝永初', 1, 9, '丁丑'],
    type: '官吏',
    incident:
      '诏书说：“自今以后长吏被考查尚未作答复的，除非是父母丧亡无故就离职的人，大县十年，平县五年以上，才能依次任用。”',
  },
  {
    time: ['安帝永初', 1, 9, '壬午'],
    type: '其他',
    incident:
      '皇帝令太仆、少府减去黄门鼓吹手，将他们补充羽林军；厩中养的马匹不是皇帝经常驾车的，都减少一半饲料喂养；各种建造，不是为了供宗庙陵园所用的，都暂时停止修建。',
  },
  {
    time: ['安帝永初', 1, 9, '丙戌'],
    type: '其他',
    incident: '皇帝下令凡死罪以下以及逃亡的可以赎罪，根据犯罪轻重各有差别。',
  },
  {
    time: ['安帝永初', 1, 9, '庚寅'],
    type: '官吏',
    incident: '太傅张禹为太尉，太常周章为司空。',
  },
  {
    time: ['安帝永初', 1, 10],
    type: '外交',
    incident: '倭国派遣使者奉献礼物。',
  },
  {
    time: ['安帝永初', 1, 10, '辛酉'],
    type: '灾害',
    incident: '新城山泉水大量涌出。',
  },
  {
    time: ['安帝永初', 1, 11, '丁亥'],
    type: '官吏',
    incident: '司空周章密谋废立皇帝，策令免职。自杀。',
  },
  {
    time: ['安帝永初', 1, 11, '戊子'],
    type: '官吏',
    incident:
      '警告司隶校尉、冀并二州刺史，令他们去规劝因谣言而流浪在外的百姓。',
    source:
      '敕司隶校尉、冀并二州刺史：“民讹言相惊，弃捐旧居，老弱相携，穷困道路。其各敕所部长吏，躬亲晓喻。若欲归本郡，在所为封长檄；不欲，勿强。”',
  },
  {
    time: ['安帝永初', 1, 12, '乙卯'],
    type: '官吏',
    incident: '颍川太守张敏为司空。',
  },
  {
    time: ['安帝永初', 1],
    type: '年度总结',
    incident:
      '这一年，有十八个郡国发生地震；四十一各县下雨发大水，或者山洪暴发；二十八个县刮大风，下冰雹。',
  },
  {
    time: ['安帝永初', 2, 1],
    type: '救济',
    incident: '河南、下邳、东莱、河内官府开仓供给贫困百姓粮食。',
  },
  {
    time: ['安帝永初', 2, 1],
    type: '战争',
    incident: '车骑将军邓骘被种羌打败于冀西。',
  },
  {
    time: ['安帝永初', 2, 2, '乙丑'],
    type: '救济',
    incident:
      '派遣光禄大夫樊准、吕仓分别到冀兖二州，开官仓借贷给流浪百姓粮食。',
  },
  {
    time: ['安帝永初', 2, 4, '甲寅'],
    type: '灾害',
    incident: '汉阳城中发生火灾，烧死三千五百七十人。',
  },
  {
    time: ['安帝永初', 2, 5],
    type: '灾害',
    incident: '天旱',
  },
  {
    time: ['安帝永初', 2, 5, '丙寅'],
    type: '其他',
    incident:
      '皇太后到洛阳寺及若处监狱，考察囚徒，赏赐河南尹、廷尉、卿及官属以下各有差别，即日降雨。',
  },
  {
    time: ['安帝永初', 2, 6],
    type: '灾害',
    incident: '京师及四十个郡国发大水，刮大风，下冰雹。',
  },
  {
    time: ['安帝永初', 2, 7, '戊辰'],
    type: '推举人才',
    title: '举贤良',
    incident: '下诏令公卿郡国推荐贤良方正的人才。',
    source:
      '诏曰：“昔在帝王，承天理民，莫不据琁机玉衡，以齐七政。朕以不德，遵奉大业，而阴阳差越，变异并见，万民饥流，羌貊叛戾。夙夜克己，忧心京京。闲令公卿郡国举贤良方正，远求博选，开不讳之路，冀得至谋，以鉴不逮，而所对皆循尚浮言，无卓尔异闻。其百僚及郡国吏人，有道术明习灾异阴阳之度琁机之数者，各使指变以闻。二千石长吏明以诏书，博衍幽隐，朕将亲览，待以不次，冀获嘉谋，以承天诫。”',
  },
  {
    time: ['安帝永初', 2, -7, '辛丑'],
    type: '宗室',
    incident: '广川王刘常保薨。无子，国除。',
  },
  {
    time: ['安帝永初', 2, -7, '癸未'],
    type: '外交',
    incident: '蜀郡边境外羌全境来内附。',
  },
  {
    time: ['安帝永初', 2, 9, '庚子'],
    type: '推举人才',
    incident:
      '皇帝令王国国相每年登记精通经义可以任博士以及才能可管理百姓的人的名字，报送尚书，让他们去朝外补充空缺。',
    source:
      '诏王主官属墨绶下至郎、谒者，其经明任博士，居乡里有廉清孝顺之称，才任理人者，国相岁移名，与计偕上尚书，公府通调，令得外补。',
  },
  {
    time: ['安帝永初', 2, 10, '庚寅'],
    type: '救济',
    incident: '济阴、山阳、玄菟开官仓供给贫困百姓粮食。',
  },
  {
    time: ['安帝永初', 2, 10, '庚寅'],
    type: '战争',
    incident: '征西校尉任尚与先零羌战于平襄，任尚军队被打败。',
  },
  {
    time: ['安帝永初', 2, 11, '辛酉'],
    type: '官吏',
    incident: '拜邓骘为大将军，征召回京师，留任尚屯兵陇右。',
  },
  {
    time: ['安帝永初', 2, 11, '辛酉'],
    type: '战争',
    incident:
      '先零羌滇零自称天子于北地，侵犯三辅，往东侵犯赵、魏，往南进入益州，杀汉中太守董炳。',
  },
  {
    time: ['安帝永初', 2, 12, '辛卯'],
    type: '救济',
    incident: '东郡、钜鹿、广阳、安定、定襄、沛国开官仓供给贫困百姓粮食。',
  },
  {
    time: ['安帝永初', 2, 12, '辛卯'],
    type: '外交',
    incident: '广汉边境以外的参狼羌投降。',
  },
  {
    time: ['安帝永初', 2, 12, '辛卯'],
    type: '疆界',
    incident: '分广汉北部为属国都尉。',
  },
  {
    time: ['安帝永初', 2],
    type: '年度总结',
    incident: '这一年，十二个郡国发生地震。',
  },
  {
    time: ['安帝永初', 3, 1, '庚子'],
    type: '其他',
    incident: '皇帝举行加冠仪式。大赦天下。赏赐官员及百姓。',
    source:
      '皇帝加元服。大赦天下。赐王、主、贵人、公、卿以下金帛各有差；男子为父后，及三老、孝悌、力田爵，人二级，流民欲占者人一级。',
  },
  {
    time: ['安帝永初', 3, 1, '庚子'],
    type: '战争',
    incident: '派遣骑都尉任仁讨伐先零羌，失败，羌于是攻陷临洮。',
  },
  {
    time: ['安帝永初', 3, 1, '庚子'],
    type: '外交',
    incident: '高句骊派遣使臣来攻陷物品。',
  },
  {
    time: ['安帝永初', 3, 3],
    type: '灾害',
    tags: ['人相食'],
    incident: '京师发生大饥荒，出现人吃人的现象。',
  },
  {
    time: ['安帝永初', 3, 3, '壬辰'],
    type: '其他',
    incident: '公卿到朝廷谢罪。',
    source:
      '公卿诣阙谢。诏曰：“朕以幼冲，奉承鸿业，不能宣流风化，而感逆阴阳，至令百姓饥荒，更相啖食。永怀悼叹，若坠渊水。咎在朕躬，非群司之责，而过自贬引，重朝廷之不德。其务思变复，以助不逮。”',
  },
  {
    time: ['安帝永初', 3, 3, '癸巳'],
    type: '救济',
    incident: '皇帝令把鸿池借给贫困百姓耕种。',
  },
  {
    time: ['安帝永初', 3, 3, '壬寅'],
    type: '官吏',
    incident: '司徒鲁恭被罢免。',
  },
  {
    time: ['安帝永初', 3, 4, '丙寅'],
    type: '官吏',
    incident: '大鸿胪九江夏勤为司徒。',
  },
  {
    time: ['安帝永初', 3, 4, '丙寅'],
    type: '官吏',
    tags: ['卖官鬻爵'],
    incident:
      '三公因国家用费不足，奏议令官吏和百姓缴纳钱谷，就能授予关内侯、虎贲羽林郎、五大夫、官府吏、缇骑、营士等，交钱谷各有差别。',
  },
  {
    time: ['安帝永初', 3, 4, '己巳'],
    type: '救济',
    incident: '皇帝下令上林、广成苑可以开垦的，交给贫困百姓。',
  },
  {
    time: ['安帝永初', 3, 4, '甲申'],
    type: '宗室',
    incident: '清河王刘虎威薨。',
  },
  {
    time: ['安帝永初', 3, 5, '丙申'],
    type: '宗室',
    incident: '封乐安王刘宠的儿子刘延平为清河王。',
  },
  {
    time: ['安帝永初', 3, 5, '丁酉'],
    type: '宗室',
    incident: '沛王刘正薨。',
  },
  {
    time: ['安帝永初', 3, 5, '癸丑'],
    type: '灾害',
    incident: '京师大风。',
  },
  {
    time: ['安帝永初', 3, 6],
    type: '战争',
    incident: '乌桓侵犯代郡、上谷、涿郡。',
  },
  {
    time: ['安帝永初', 3, 7],
    type: '战争',
    incident:
      '海贼张伯路等抢掠沿海九郡，派遣侍御史庞雄督促州郡兵讨伐打败他们。',
  },
  {
    time: ['安帝永初', 3, 7, '庚子'],
    type: '救济',
    incident:
      '皇帝令长吏察访巡行暂住处所，都让种冬麦和蔬菜，一定要地尽其用，那些贫困地供给种子和饭食。',
  },
  {
    time: ['安帝永初', 3, 9],
    type: '战争',
    incident: '雁门乌桓及鲜卑叛变，打败五原郡兵于高渠谷。',
  },
  {
    time: ['安帝永初', 3, 10],
    type: '战争',
    incident: '南单于叛变，围中郎将耿种于美稷。',
  },
  {
    time: ['安帝永初', 3, 11],
    type: '战争',
    incident: '派遣车骑将军何熙讨伐南单于。',
  },
  {
    time: ['安帝永初', 3, 12, '辛酉'],
    type: '灾害',
    tags: ['地震'],
    incident: '九个郡国发生地震。',
  },
  {
    time: ['安帝永初', 3, 12, '乙亥'],
    type: '天文',
    tags: ['彗星'],
    incident: '有彗星出现在天苑星座出现。',
  },
  {
    time: ['安帝永初', 3],
    type: '年度总结',
    tags: ['人相食'],
    incident:
      '这一年，京师及四十一个郡国下冰雹。并凉二州大饥荒，出现了人吃人的现象。',
  },
  {
    time: ['安帝永初', 4, 1, 1],
    type: '其他',
    incident: '朝会，撤销演奏礼乐的仪式，不陈列充庭车等物品。',
  },
  {
    time: ['安帝永初', 4, 1, '辛卯'],
    type: '救济',
    incident:
      '皇帝下令因三辅连年遭受抢掠战乱之害，百姓流落四方，免除三年欠下的田租、更税、人丁税、草料；开上郡官仓供给贫民粮食各有差别。',
  },
  {
    time: ['安帝永初', 4, 1, '辛卯'],
    type: '战争',
    incident:
      '海贼张伯路又与渤海、平原大盗刘文和、周文光等攻打厌次，杀县令，派遣御史中丞王宗督青州刺史法雄讨伐打败他们。',
  },
  {
    time: ['安帝永初', 4, 1, '辛卯'],
    type: '战争',
    incident: '度辽将军梁慬、辽东太守耿夔讨伐打败南单于于属国故城。',
  },
  {
    time: ['安帝永初', 4, 1, '丙午'],
    type: '官吏',
    incident: '皇帝下令减少百官及州郡县官吏俸禄各有差别。',
  },
  {
    time: ['安帝永初', 4, 2, '丁巳'],
    type: '救济',
    incident: '开九江官仓供给贫困百姓粮食。',
  },
  {
    time: ['安帝永初', 4, 2, '丁巳'],
    type: '战争',
    incident: '南匈奴侵犯常山。',
  },
  {
    time: ['安帝永初', 4, 2, '乙丑'],
    type: '官吏',
    incident: '开始设置长安、雍二营都尉官。',
  },
  {
    time: ['安帝永初', 4, 2, '乙亥'],
    type: '其他',
    incident:
      '皇帝下令自建初年间以来，凡受各种妖言或其他过错牵连迁移到边疆去的，各自回到原来的郡；那些没收入官为奴婢的，免除奴婢为平民百姓。',
  },
  {
    time: ['安帝永初', 4, 2, '乙亥'],
    type: '文化',
    incident:
      '皇帝命令谒者刘珍及《五经》博士，校订东观《五经》、诸子、传记、百家艺术，整理脱漏讹误，订正文字。',
  },
  {
    time: ['安帝永初', 4, 3],
    type: '外交',
    incident: '南单于降。',
  },
  {
    time: ['安帝永初', 4, 3],
    type: '战争',
    incident: '先零羌侵犯褒中，汉中太守郑勤战死。',
  },
  {
    time: ['安帝永初', 4, 3],
    type: '疆界',
    incident: '迁移金城郡的首府到襄武。',
  },
  {
    time: ['安帝永初', 4, 3, '戊子'],
    type: '灾害',
    tags: ['火灾'],
    incident: '杜陵陵园发生火灾',
  },
  {
    time: ['安帝永初', 4, 3, '癸巳'],
    type: '灾害',
    incident: '九个郡国发生地震。',
    tags: ['地震'],
  },
  {
    time: ['安帝永初', 4, 4],
    type: '灾害',
    incident: '六个州出现蝗虫灾害。',
    tags: ['蝗灾'],
  },
  {
    time: ['安帝永初', 4, 4, '丁丑'],
    type: '其他',
    incident: '大赦天下。',
  },
  {
    time: ['安帝永初', 4, 7, '乙酉'],
    type: '灾害',
    incident: '三个郡国发大水。',
    tags: ['洪灾'],
  },
  {
    time: ['安帝永初', 4, 4, '己卯'],
    type: '官吏',
    incident: '骑都尉任仁下狱死。',
  },
  {
    time: ['安帝永初', 4, 9, '甲申'],
    type: '灾害',
    incident: '益州郡地震。',
    tags: ['地震'],
  },
  {
    time: ['安帝永初', 4, 10, '甲戌'],
    type: '外戚',
    incident: '新野君阴氏去世，使司空持节主持办理丧事。',
  },
  {
    time: ['安帝永初', 4, 10, '甲戌'],
    type: '官吏',
    incident: '大将军邓骘被罢官。',
  },
  {
    time: ['安帝永初', 5, 1, '庚辰'],
    type: '天文',
    incident: '日食',
    tags: ['日食'],
  },
  {
    time: ['安帝永初', 5, 1, '丙戌'],
    type: '灾害',
    incident: '十个郡国发生地震。',
    tags: ['地震'],
  },
  {
    time: ['安帝永初', 5, 1, '己丑'],
    type: '官吏',
    incident: '太尉张禹被免职。',
  },
  {
    time: ['安帝永初', 5, 1, '甲申'],
    type: '官吏',
    incident: '光禄勋李修任太尉。',
  },
  {
    time: ['安帝永初', 5, 2, '丁卯'],
    type: '其他',
    incident: '皇帝下令减少郡国贡献和太官到口粮。',
  },
  {
    time: ['安帝永初', 5, 2, '丁卯'],
    type: '战争',
    incident: '先零羌侵犯河东，随后到河内。',
  },
  {
    time: ['安帝永初', 5, 3],
    type: '疆界',
    incident:
      '皇帝下令把陇西首府迁往襄武，安定迁往美阳，北地迁往池阳，上郡迁往衙。',
  },
  {
    time: ['安帝永初', 5, 3],
    type: '战争',
    incident: '夫馀夷侵犯边塞，杀伤官吏人民。',
  },
  {
    time: ['安帝永初', 5, -4, '丁酉'],
    type: '其他',
    incident: '赦凉州河西四郡。', // ？？？
  },
  {
    time: ['安帝永初', 5, -4, '戊戌'],
    type: '推举人才',
    incident:
      '诏令三公、特进、侯、中二千石、二千石、郡守、诸侯相等推荐贤良方正的人。',
    tags: ['举贤良'],
  },
  {
    time: ['安帝永初', 5, 6, '甲辰'],
    type: '宗室',
    incident: '乐成王刘巡薨。',
  },
  {
    time: ['安帝永初', 5, 7, '己巳'],
    type: '推举人才',
    incident:
      '皇帝令三公、特进、九卿、校尉，举荐列将子孙中通晓作战布阵能任将帅的人。',
  },
  {
    time: ['安帝永初', 5, 9],
    type: '战争',
    incident: '汉阳人杜琦、王信叛变，同先零诸种羌贡献上邽城。',
  },
  {
    time: ['安帝永初', 5, 12],
    type: '战争',
    incident: '汉阳太守赵博派遣刺客暗杀杜琦。',
  },
  {
    time: ['安帝永初', 5],
    type: '年度总结',
    incident: '这一年，有九个州出现蝗虫灾害，八个郡国下雨发大水。',
    tags: ['蝗灾', '洪灾'],
  },
  {
    time: ['安帝永初', 6, 1, '庚申'],
    type: '其他',
    incident:
      '诏越巂置长利、高望、始昌三苑，又令益州郡置万岁苑，犍为置汉平苑。',
  },
  {
    time: ['安帝永初', 6, 3],
    type: '灾害',
    incident: '十个州发生蝗虫为害。',
    tags: ['蝗灾'],
  },
  {
    time: ['安帝永初', 6, 4, '乙丑'],
    type: '官吏',
    incident: '司空张敏被罢官。',
    tags: ['三公'],
  },
  {
    time: ['安帝永初', 6, 4, '己卯'],
    type: '官吏',
    incident: '太常刘凯任司空。',
    tags: ['三公'],
  },
  {
    time: ['安帝永初', 6, 5],
    type: '灾害',
    incident: '天旱。',
    tags: ['旱灾'],
  },
  {
    time: ['安帝永初', 6, 5, '丙寅'],
    type: '官吏',
    incident:
      '皇帝令中二千石以下至黄绶等官员，一律恢复爵级返还赎金，赏赐爵位给有差别。', // ？？？
  },
  {
    time: ['安帝永初', 6, 5, '戊辰'],
    type: '律法',
    incident: '皇太后到洛阳寺，查讯囚徒罪状，清理冤狱。',
  },
  {
    time: ['安帝永初', 6, 6, '壬辰'],
    type: '灾害',
    incident: '豫章、员溪、原山发生山崩。',
    tags: ['山崩'],
  },
  {
    time: ['安帝永初', 6, 6, '辛巳'],
    type: '律法',
    incident: '大赦天下。',
  },
  {
    time: ['安帝永初', 6, 6, '辛巳'],
    type: '战争',
    incident: '派遣侍御史唐喜讨伐汉阳盗匪王信，打败杀了他。',
  },
  {
    time: ['安帝永初', 6, 11, '辛丑'],
    type: '官吏',
    incident: '护乌桓校尉吴祉下狱，被监禁而死。',
  },
  {
    time: ['安帝永初', 6],
    type: '年度总结',
    incident: '这一年，先零羌滇零死，他儿子零昌又继承伪称号',
    tags: ['先零羌'],
  },
  {
    time: ['安帝永初', 7, 1, '庚戌'],
    type: '祭祀',
    incident: '皇太后率领大臣命妇们拜谒宗庙。',
  },
  {
    time: ['安帝永初', 7, 2, '丙午'],
    type: '灾害',
    incident: '十八个郡国发生地震。',
    tags: ['地震'],
  },
  {
    time: ['安帝永初', 7, 4, '乙未'],
    type: '宗室',
    incident: '平原王刘胜薨。',
  },
  {
    time: ['安帝永初', 7, 4, '丙申'],
    type: '天文',
    incident: '日食',
    tags: ['日食'],
  },
  {
    time: ['安帝永初', 7, 5, '庚子'],
    type: '灾害',
    incident: '京师大旱，举行祈雨仪式。',
    tags: ['旱灾'],
  },
  {
    time: ['安帝永初', 7, '秋'],
    type: '战争',
    incident: '护羌校尉侯霸、骑都尉马贤打败先零羌。',
    tags: ['先零羌'],
  },
  {
    time: ['安帝永初', 7, 8, '丙寅'],
    type: '灾害',
    incident: '京师刮大风，蝗虫飞过洛阳。',
    tags: ['大风', '蝗灾'],
  },
  {
    time: ['安帝永初', 7, 8, '丙寅'],
    type: '救济',
    incident: '皇帝令赏赐百姓爵位。减免郡国到租税。',
    source: '诏赐民爵。郡国被蝗伤稼十五以上，勿收今年田租；不满者，以实除之。',
  },
  {
    time: ['安帝永初', 7, 9],
    type: '救济',
    incident:
      '调零陵、桂阳、丹阳、豫章、会稽租米，救济南阳、广陵、下邳、彭城、山阳、庐江、九江饥民；又调沿水路县的谷粮到敖仓。',
  },
  {
    time: ['安帝元初', 1, 1, '甲子'],
    type: '改元',
    incident: '改元元初',
    source:
      '改元元初。赐民爵，人二级，孝悌、力田人三级，爵过公乘，得移与子若同产、同产子，民脱无名数及流民欲占者人一级；鳏、寡、孤、独、笃缮、不能自存者谷，人三斛，贞妇帛，人一匹。',
    tags: ['赏赐'],
  },
  {
    time: ['安帝元初', 1, 2, '己卯'],
    type: '灾害',
    incident: '日南发生地裂。',
    tags: ['地裂'],
  },
  {
    time: ['安帝元初', 1, 3, '癸酉'],
    type: '天文',
    incident: '日食',
    tags: ['日食'],
  },
  {
    time: ['安帝元初', 1, 4, '丁酉'],
    type: '律法',
    incident: '大赦天下',
  },
  {
    time: ['安帝元初', 1, 4, '丁酉'],
    type: '灾害',
    incident: '京师及五个郡国天旱，发生蝗灾。',
    tags: ['旱灾', '蝗灾'],
  },
  {
    time: ['安帝元初', 1, 4, '丁酉'],
    type: '推举人才',
    incident:
      '皇帝令三公、特进、列侯、中二千石、二千石、郡守等举荐敦厚正直的，各一人。',
  },
  {
    time: ['安帝元初', 1, 5],
    type: '战争',
    incident: '先零羌侵犯雍城。',
    tags: ['先零羌'],
  },
  {
    time: ['安帝元初', 1, 6, '丁巳'],
    type: '灾害',
    incident: '河东发生地陷',
    tags: ['地陷'],
  },
  {
    time: ['安帝元初', 1, 7],
    type: '战争',
    incident: '蜀郡夷侵犯蚕陵，杀县令。',
  },
  {
    time: ['安帝元初', 1, 9, '乙丑'],
    type: '官吏',
    incident: '太尉李修被罢官。',
    tags: ['三公'],
  },
  {
    time: ['安帝元初', 1, 9, '乙丑'],
    type: '战争',
    incident: '先零羌侵犯武都、汉中，截断陇中通道。',
    tags: ['先零羌'],
  },
  {
    time: ['安帝元初', 1, 9, '辛未'],
    type: '官吏',
    incident: '大司农山阳司马苞为太尉。',
    tags: ['三公'],
  },
  {
    time: ['安帝元初', 1, 10, '戊子'],
    type: '天文',
    incident: '日食',
    tags: ['日食'],
  },
  {
    time: ['安帝元初', 1, 10, '戊子'],
    type: '战争',
    incident: '先零羌打败凉州刺史皮阳于狄道。',
  },
  {
    time: ['安帝元初', 1, 10, '乙卯'],
    type: '财政',
    incident: '皇帝令免除三辅三年田租、更赋、人丁税。',
    tags: ['租税'],
  },
  {
    time: ['安帝元初', 1, 11],
    type: '年度总结',
    incident: '这一年，十五个郡国发生地震。',
    tags: ['地震'],
  },
  {
    time: ['安帝元初', 2, 1],
    type: '救济',
    incident: '皇帝令三辅及并、凉六郡开官仓供给流离失所的贫苦百姓。',
  },
  {
    time: ['安帝元初', 2, 1],
    type: '外交',
    incident: '蜀郡青衣道夷贡献物品内附。',
  },
  {
    time: ['安帝元初', 2, 1],
    type: '其他',
    incident: '修理西门豹所分漳水为支渠的河道，用来灌溉民田。',
  },
  {
    time: ['安帝元初', 2, 2, '戊戌'],
    type: '救济',
    incident:
      '派遣中谒者收埋那些外地流落京师而死无家属认领以及棺椁朽败的人，都为他们设令牌祭奠；那些有家属，但特别贫困而无力埋葬的，赐给钱每人五千。',
  },
  {
    time: ['安帝元初', 2, 2, '辛酉'],
    type: '其他',
    incident:
      '皇帝令三辅、河内、河东、上党、赵国、太原各地修理旧渠，疏通水道，用来灌溉公田和私田。',
  },
  {
    time: ['安帝元初', 2, 3, '癸亥'],
    type: '灾害',
    incident: '京师刮大风。',
    tags: ['大风'],
  },
  {
    time: ['安帝元初', 2, 3, '癸亥'],
    type: '战争',
    incident: '派遣中郎将尹就讨伐他们。',
  },
  {
    time: ['安帝元初', 2, 4, '丙午'],
    type: '外戚',
    incident: '立贵人阎氏为皇后。',
  },
  {
    time: ['安帝元初', 2, 5],
    type: '灾害',
    incident: '京师天旱，河南及十九个郡国发生蝗虫灾害。',
    tags: ['旱灾', '蝗灾'],
  },
  {
    time: ['安帝元初', 2, 5, '甲戌'],
    type: '其他',
    incident: '诏书警告官吏隐瞒灾情之事。',
    source:
      '诏曰：“朝廷不明，庶事失中，灾异不息，忧心悼惧。被蝗以来，七年于兹，而州郡隐匿，裁言顷亩。今群飞蔽天，为害广远，所言所见，宁相副邪？三司之职，内外是监，既不奏闻，又无举正。天灾至重，欺罔罪大。今方盛夏，且复假贷，以观厥后。其务消救灾眚，安辑黎元。”',
  },
  {
    time: ['安帝元初', 2, 6, '丙戌'],
    type: '官吏',
    incident: '太尉司马苞薨。',
    tags: ['三公'],
  },
  {
    time: ['安帝元初', 2, 6, '丙戌'],
    type: '灾害',
    incident: '洛阳新城地区发生地裂。',
    tags: ['地裂'],
  },
  {
    time: ['安帝元初', 2, 7, '辛巳'],
    type: '官吏',
    incident: '太仆太山马英任太尉。',
    tags: ['三公'],
  },
  {
    time: ['安帝元初', 2, 8],
    type: '战争',
    incident: '辽东鲜卑围攻无虑县。',
    tags: ['鲜卑'],
  },
  {
    time: ['安帝元初', 2, 9],
    type: '战争',
    incident: '鲜卑又攻夫犁营，杀县令。',
    tags: ['鲜卑'],
  },
  {
    time: ['安帝元初', 2, 9, '壬午'],
    type: '天文',
    incident: '日食',
    tags: ['日食'],
  },
  {
    time: ['安帝元初', 2, 10],
    type: '战争',
    incident: '派遣中郎将任尚屯兵三辅。',
  },
  {
    time: ['安帝元初', 2, 10],
    type: '其他',
    incident: '遣送囚徒去加入军队屯守，减免囚徒的罪责。',
    source:
      '诏郡国中都官系囚减死一等。勿笞，诣冯翊、扶风屯，妻子自随，占著所在；女子勿输。亡命死罪以下赎，各有差。其吏人聚为盗贼，有悔过者，除其罪。',
  },
  {
    time: ['安帝元初', 2, 10, '乙未'],
    type: '战争',
    incident:
      '右扶风仲光、安定太守杜恢、京兆虎牙都尉耿溥与先零羌战于丁奚城，仲光等大败，全军覆没。左冯翊司马钧下狱，自杀。',
    tags: ['先零羌'],
  },
  {
    time: ['安帝元初', 2, 11, '庚申'],
    type: '灾害',
    incident: '十个郡国发生地震',
    tags: ['地震'],
  },
  {
    time: ['安帝元初', 2, 12],
    type: '战争',
    incident: '武陵澧中蛮叛变，州郡击破之。',
  },
  {
    time: ['安帝元初', 2, 12, '己酉'],
    type: '官吏',
    incident: '司徒夏勤被罢官。',
    tags: ['三公'],
  },
  {
    time: ['安帝元初', 2, 12, '庚戌'],
    type: '官吏',
    incident: '司空刘恺为司徒，光禄勋袁敞为司空。',
    tags: ['三公'],
  },
  {
    time: ['安帝元初', 3, 1, '甲戌'],
    type: '水土工程',
    incident: '修理太原旧沟渠，灌溉官田和私田。',
  },
  {
    time: ['安帝元初', 3, 1, '甲戌'],
    type: '祥瑞',
    incident: '东平陆县上奏说发现连理木。',
  },
  {
    time: ['安帝元初', 3, 1, '甲戌'],
    type: '战争',
    incident: '苍梧、郁林、合浦蛮夷反叛。',
  },
  {
    time: ['安帝元初', 3, 2],
    type: '战争',
    incident: '派遣侍御史任逴督促郡兵去讨伐他们。',
  },
  {
    time: ['安帝元初', 3, 2],
    type: '灾害',
    incident: '十个郡国发生地震。',
    tags: ['地震'],
  },
  {
    time: ['安帝元初', 3, 3, '辛亥'],
    type: '天文',
    incident: '日食',
    tags: ['日食'],
  },
  {
    time: ['安帝元初', 3, 3, '丙辰'],
    type: '战争',
    incident: '赦免苍梧、郁林、合浦、南海官吏和百姓被叛贼胁迫而参加叛乱的。',
  },
  {
    time: ['安帝元初', 3, 4],
    type: '灾害',
    incident: '京师天旱。',
    tags: ['旱灾'],
  },
  {
    time: ['安帝元初', 3, 5],
    type: '战争',
    incident: '武陵蛮又叛变，州郡讨伐打败了他们。',
    tags: ['武陵蛮'],
  },
  {
    time: ['安帝元初', 3, 5, '癸酉'],
    type: '战争',
    incident: '度辽将军邓遵率南匈奴击先零羌于灵州，打败他们。',
  },
  {
    time: ['安帝元初', 3, 5, '癸酉'],
    type: '外交',
    incident: '越巂境外夷全部内附。',
  },
  {
    time: ['安帝元初', 3, 6],
    type: '战争',
    incident: '中郎将任尚派遣军队打败先零羌在丁西城。',
  },
  {
    time: ['安帝元初', 3, 7],
    type: '战争',
    incident: '武陵蛮又反叛，州郡讨伐平定他们。',
  },
  {
    time: ['安帝元初', 3, 7],
    type: '灾害',
    incident: '缑氏发生地裂。',
    tags: ['地裂'],
  },
  {
    time: ['安帝元初', 3, 9, '辛巳'],
    type: '宗室',
    incident: '赵王刘宏薨。',
  },
  {
    time: ['安帝元初', 3, 11],
    type: '战争',
    incident: '苍梧、郁林、合浦蛮夷投降。',
  },
  {
    time: ['安帝元初', 3, 11, '丙戌'],
    type: '官吏',
    incident: '开始同意大臣、二千石、刺史实行三年丧礼的制度。',
  },
  {
    time: ['安帝元初', 3, 11, '癸卯'],
    type: '灾害',
    incident: '有九个郡国发生地震。',
    tags: ['地震'],
  },
  {
    time: ['安帝元初', 3, 12, '丁巳'],
    type: '战争',
    incident: '任尚派遣军队打败先零羌于北地。',
  },
  {
    time: ['安帝元初', 4, 2, '乙巳'],
    type: '天文',
    incident: '日食',
    tags: ['日食'],
  },
  {
    time: ['安帝元初', 4, 2, '乙卯'],
    type: '其他',
    incident: '大赦天下。',
  },
  {
    time: ['安帝元初', 4, 2, '壬戌'],
    type: '灾害',
    incident: '武库发生火灾。',
    tags: ['火灾'],
  },
  {
    time: ['安帝元初', 4, 4, '戊申'],
    type: '官吏',
    incident: '司空袁敞薨。',
    tags: ['三公'],
  },
  {
    time: ['安帝元初', 4, 4, '己巳'],
    type: '战争',
    incident: '鲜卑侵犯辽西，辽西郡兵同乌桓打败他们。',
  },
  {
    time: ['安帝元初', 4, 5, '丁丑'],
    type: '官吏',
    incident: '太常李合为司空。',
  },
  {
    time: ['安帝元初', 4, 6, '戊辰'],
    type: '灾害',
    incident: '三个郡下冰雹。',
  },
  {
    time: ['安帝元初', 4, 7, '辛丑'],
    type: '宗室',
    incident: '陈王刘钧薨。',
  },
  {
    time: ['安帝元初', 4, 7, '辛丑'],
    type: '灾害',
    incident: '京师及十个郡国下大雨。',
    source:
      '	京师及郡国十雨水。诏曰：“今年秋稼茂好，垂可收获，而连雨未霁，惧必淹伤。夕惕惟忧，思念厥咎。夫霖雨者，人怨之所致。其武吏以威暴下，文吏妄行苛刻，乡吏因公生奸，为百姓所患苦者，有司显明其罚。又月令‘仲秋养衰老，授几杖，行糜粥。’。方今案比之时，郡县多不奉行。虽有糜粥，糠秕相半，长吏怠事，莫有躬亲，甚违诏书养老之意。其务崇仁恕，赈护寡独，称朕意焉。”',
    tags: ['大雨'],
  },
  {
    time: ['安帝元初', 4, 9],
    type: '战争',
    incident: '护羌校尉任尚派遣刺客暗杀叛羌零昌。',
  },
  {
    time: ['安帝元初', 4, 11, '己卯'],
    type: '宗室',
    incident: '彭城王刘恭薨。',
  },
  {
    time: ['安帝元初', 4, 12],
    type: '战争',
    incident: '越巂夷侵犯遂久，杀县令。',
  },
  {
    time: ['安帝元初', 4, 12, '甲子'],
    type: '战争',
    incident:
      '任尚及骑都尉马贤与先零羌战于富平上河，大败他们。虔人羌率众降，陇右平定。',
  },
  {
    time: ['安帝元初', 4],
    type: '年度总结',
    incident: '这一年，十三个郡国发生地震。',
  },
  {
    time: ['安帝元初', 5, 1],
    type: '战争',
    incident: '越巂夷叛变。',
  },
  {
    time: ['安帝元初', 5, 2, '壬戌'],
    type: '宗室',
    incident: '中山王刘宪薨。',
  },
  {
    time: ['安帝元初', 5, 3],
    type: '灾害',
    incident: '京师及五个郡国天旱，皇帝令开官仓供给遭旱灾贫困百姓的粮食。',
    tags: ['旱灾'],
  },
  {
    time: ['安帝元初', 5, 6],
    type: '战争',
    incident: '高句骊与秽貊侵犯玄菟。',
  },
  {
    time: ['安帝元初', 5, 7],
    type: '战争',
    incident: '越巂蛮夷及旄牛豪叛变，杀长吏。',
  },
  {
    time: ['安帝元初', 5, 7, '丙子'],
    type: '其他',
    incident: '诏书告诫官吏要节俭。',
    source:
      '丙子，诏曰：“旧令制度，各有科品，欲令百姓务崇节约。遭永初之际，人离荒厄，朝廷躬自菲薄，去绝奢饰，食不兼味，衣无二彩。比年虽获丰穰，尚乏储积，而小人无虑，不图久长，嫁娶送终，纷华靡丽，至有走卒奴婢被绮縠，著珠玑。京师尚若斯，何以示四远？设张法禁，恳恻分明，而有司惰任，讫不奉行。秋节既立，鸷鸟将用，且复重申，以观后效。”',
  },
  {
    time: ['安帝元初', 5, 8, '丙申'],
    type: '天文',
    incident: '日食',
    tags: ['日食'],
  },
  {
    time: ['安帝元初', 5, 8, '丙申'],
    type: '战争',
    incident: '鲜卑侵犯代郡。',
  },
  {
    time: ['安帝元初', 5, 10],
    type: '战争',
    incident: '鲜卑侵犯上谷。',
  },
  {
    time: ['安帝元初', 5, 12, '丁巳'],
    type: '官吏',
    incident: '中郎将任尚有罪，斩杀示众。',
  },
  {
    time: ['安帝元初', 5],
    type: '年度总结',
    incident: '这一年，十四个郡国发生地震。',
    tags: ['地震'],
  },
  {
    time: ['安帝元初', 6, 2, '乙巳'],
    type: '灾害',
    incident: '京师及四十二个郡国发生地震，有的地方出现大裂缝，泉水喷涌而出。',
  },
  {
    time: ['安帝元初', 6, 2, '壬子'],
    type: '官吏',
    incident:
      '皇帝令三府选拔成绩优异的辅助官员，能取得成效管理州县的各五人，光禄勋同中郎将选举孝廉郎宽容博学有谋略、品质清白而行为高尚的五十人，到外地去补充令、长、丞、尉等官职。',
  },
  {
    time: ['安帝元初', 6, 2, '乙卯'],
    type: '其他',
    incident: '诏书说要赏赐贫困百姓，奖励贞洁妇女，为她们立牌坊。',
    tags: ['立牌坊'],
    source:
      '诏曰：“夫政，先京师，后诸夏。月令仲春‘养幼小，存诸孤’，季春‘赐贫穷，赈乏绝，省妇使，表贞女’，所以顺阳气，崇生长也。其赐人尤贫困、孤弱、单独谷，人三斛；贞妇有节义十斛，甄表门闾，旌显厥行。”',
  },
  {
    time: ['安帝元初', 6, 3, '庚辰'],
    type: '祭祀',
    incident: '开始建立六宗祠，祭祀在洛阳城西北。',
  },
  {
    time: ['安帝元初', 6, 4],
    type: '灾害',
    incident:
      '会稽发生大瘟疫，派遣光禄大夫带领太医巡行治疗疾病，赐给棺木，免除田租、人口赋。',
    tags: ['瘟疫'],
  },
  {
    time: ['安帝元初', 6, 4],
    type: '灾害',
    incident: '沛国、渤海刮大风，下冰雹。',
    tags: ['大风', '冰雹'],
  },
  {
    time: ['安帝元初', 6, 5],
    type: '灾害',
    incident: '京师天旱。',
    tags: ['旱灾'],
  },
  {
    time: ['安帝元初', 6, 6, '丁丑'],
    type: '宗室',
    incident: '乐成王刘宾薨。',
  },
  {
    time: ['安帝元初', 6, 6, '丙戌'],
    type: '宗室',
    incident: '平原王刘得薨。',
  },
  {
    time: ['安帝元初', 6, 7],
    type: '战争',
    incident: '鲜卑侵犯马城，度辽将军邓遵率领南单于击败了他们。',
  },
  {
    time: ['安帝元初', 6, 9, '癸巳'],
    type: '宗室',
    incident: '陈王刘竦薨。',
  },
  {
    time: ['安帝元初', 6, 12, '戊午'],
    type: '灾害',
    incident: '有日食发生，是日全食。',
    tags: ['日食'],
  },
  {
    time: ['安帝元初', 6, 12, '戊午'],
    type: '灾害',
    incident: '八个郡国地震。',
    tags: ['地震'],
  },
  {
    time: ['安帝元初', 6],
    type: '年度总结',
    incident:
      '这一年，永昌、益州蜀郡夷叛乱，同越雟夷杀长吏，焚烧城镇，益州刺史张乔讨伐打败使他们投降。',
  },
  {
    time: ['安帝永宁', 1, 1, '甲辰'],
    type: '宗室',
    incident: '任城王刘安薨。',
  },
  {
    time: ['安帝永宁', 1, 3, '丁酉'],
    type: '宗室',
    incident: '济北王刘寿薨。',
  },
  {
    time: ['安帝永宁', 1, 3, '丁酉'],
    type: '战争',
    incident: '车师后王叛变，杀部司马。',
  },
  {
    time: ['安帝永宁', 1, 3, '丁酉'],
    type: '战争',
    incident: '沈氐羌寇张掖。',
  },
  {
    time: ['安帝永宁', 1, 4, '丙寅'],
    type: '改元',
    incident: '立皇子刘保为皇太子，改年号为永宁，大赦天下。赏赐官员和百姓。',
    source:
      '立皇子保为皇太子，改元永宁，大赦天下。赐王、主、三公、列侯下至郎吏、从官金帛；又赐民爵及布粟各有差。',
    tags: ['废立太子'],
  },
  {
    time: ['安帝永宁', 1, 4, '己巳'],
    type: '宗室',
    incident:
      '继续封陈王刘羡的儿子刘崇为陈王，济北王儿子刘苌为乐成王，河闲王儿子刘翼为平原王。',
  },
  {
    time: ['安帝永宁', 1, 4, '壬午'],
    type: '宗室',
    incident: '琅邪王刘寿薨。',
  },
  {
    time: ['安帝永宁', 1, 6],
    type: '战争',
    incident: '沈氐种羌叛，侵犯张掖，护羌校尉马贤讨伐沈氐羌，破之。',
  },
  {
    time: ['安帝永宁', 1, 7, '乙酉'],
    type: '天文',
    incident: '有日食发生。',
    tags: ['日食'],
  },
  {
    time: ['安帝永宁', 1, 10, '己巳'],
    type: '官吏',
    incident: '司空李合被免职。',
    tags: ['三公'],
  },
  {
    time: ['安帝永宁', 1, 10, '癸酉'],
    type: '官吏',
    incident: '卫尉庐江陈褒为司空。',
    tags: ['三公'],
  },
  {
    time: [
      ['安帝永宁', 1, 3],
      ['安帝永宁', 1, 10],
    ],
    type: '灾害',
    incident: '京师及三十三个郡国刮大风，下雨发大水。',
    tags: ['大风', '水灾'],
  },
  {
    time: ['安帝永宁', 1, 12],
    type: '外交',
    incident: '永昌境外掸国遣使贡献物品。',
  },
  {
    time: ['安帝永宁', 1, 12, '戊辰'],
    type: '官吏',
    incident: '司徒刘恺被罢官。',
    tags: ['三公'],
  },
  {
    time: ['安帝永宁', 1, 12, '戊辰'],
    type: '战争',
    incident: '辽西鲜卑投降。',
  },
  {
    time: ['安帝永宁', 1, 12, '癸酉'],
    type: '官吏',
    incident: '太常杨震任司徒。',
    tags: ['三公'],
  },
  {
    time: ['安帝永宁', 1],
    type: '年度总结',
    incident:
      '这一年，二十三个郡国发生地震。夫馀王派遣儿子到朝廷贡献物品。烧当羌叛变。',
    tags: ['地震'],
  },
  {
    time: ['安帝建光', 1, 1],
    type: '战争',
    incident: '幽州刺史冯焕率领两个郡国太守讨伐高句骊、秽貊，没有取胜。',
  },
  {
    time: ['安帝建光', 1, 2, '癸亥'],
    type: '官吏',
    incident:
      '大赦天下。赏给守园陵的宫人、王、主、公、卿以下官员钱帛各有差别。选用公、卿、校尉、尚书的儿子一人为郎、舍人等职。',
  },
  {
    time: ['安帝建光', 1, 3, '癸巳'],
    type: '外戚',
    incident: '皇太后邓氏崩。',
  },
  {
    time: ['安帝建光', 1, 3, '丙午'],
    type: '其他',
    incident: '安葬和熹皇后。',
  },
  {
    time: ['安帝建光', 1, 3, '丁未'],
    type: '宗室',
    incident: '乐安王刘宠薨。',
  },
  {
    time: ['安帝建光', 1, 3, '戊申'],
    type: '其他',
    incident:
      '追尊皇父清河孝王曰孝德皇帝，皇母左氏曰孝德皇后，皇祖母宋贵人曰敬隐皇后。',
  },
  {
    time: ['安帝建光', 1, 4],
    type: '战争',
    incident: '秽貊又与鲜卑侵犯辽东，辽东太守蔡讽追击，战死。',
  },
  {
    time: ['安帝建光', 1, 4, '丙辰'],
    type: '疆界',
    incident: '把广川合并给清河国。',
  },
  {
    time: ['安帝建光', 1, 4, '丁巳'],
    type: '其他',
    incident: '尊孝德皇帝之妃耿氏为甘陵大贵人。',
  },
  {
    time: ['安帝建光', 1, 4, '甲子'],
    type: '宗室',
    incident: '乐成王刘苌有罪，废为临湖侯。',
  },
  {
    time: ['安帝建光', 1, 4, '己巳'],
    type: '推举人才',
    incident:
      '令公、卿、特进、侯、中二千石、二千石、郡国守相，选举有道德的各一人。赏给鳏、寡、孤、独、贫困不能自己生存的，每人谷米三斛。',
  },
  {
    time: ['安帝建光', 1, 4, '甲戌'],
    type: '官吏',
    incident: '辽东属国都尉庞奋，呈假印书信杀玄菟太守姚光。',
  },
  {
    time: ['安帝建光', 1, 5, '庚辰'],
    type: '官吏',
    incident: '特进邓骘和度辽将军邓遵，因遭人诬陷自杀。',
  },
  {
    time: ['安帝建光', 1, 5, '丙申'],
    type: '宗室',
    incident: '贬平原王刘翼为都乡侯。',
  },
  {
    time: ['安帝建光', 1, 7, '己卯'],
    type: '改元',
    incident: '改年号为建光，大赦天下。',
  },
  {
    time: ['安帝建光', 1, 7, '壬寅'],
    type: '官吏',
    incident: '太尉马英去世。',
    tags: ['三公'],
  },
  {
    time: ['安帝建光', 1, 8],
    type: '战争',
    incident: '护羌校尉马贤讨伐烧当羌于金城，没有胜利。',
  },
  {
    time: ['安帝建光', 1, 8, '甲子'],
    type: '官吏',
    incident: '前司徒刘恺为太尉。',
    tags: ['三公'],
  },
  {
    time: ['安帝建光', 1, 8, '甲子'],
    type: '战争',
    incident: '鲜卑侵犯居庸关。',
  },
  {
    time: ['安帝建光', 1, 9],
    type: '战争',
    incident:
      '云中太守成严迎击鲜卑，战死。鲜卑围攻乌桓校尉于马城，度辽将军耿夔救援它。',
  },
  {
    time: ['安帝建光', 1, 9, '戊子'],
    type: '官吏',
    incident: '皇帝到卫尉冯石府。',
  },
  {
    time: ['安帝建光', 1, '秋'],
    type: '灾害',
    incident: '京师及二十九个郡国下雨涨大水。',
    tags: ['水灾'],
  },
  {
    time: ['安帝建光', 1, 11, '己丑'],
    type: '灾害',
    incident:
      '三十五个郡国发生地震，或者地裂。皇帝令三公以下官员，各自密奏陈述成功与失败的问题。派遣光禄大夫巡行察访，赏给私人的钱，每人二千。免除今年田租。那些遭灾厉害的，不收人口赋。',
    tags: ['地震'],
  },
  {
    time: ['安帝建光', 1, 11, '己丑'],
    type: '战争',
    incident: '鲜卑侵犯玄菟。',
  },
  {
    time: ['安帝建光', 1, 11, '庚子'],
    type: '官吏',
    incident: '再次判定二千石以上官员服丧三年。',
  },
  {
    time: ['安帝建光', 1, 11, '癸卯'],
    type: '推举人才',
    incident: '皇帝令三公、特进、侯、卿、校尉，推举勇猛可以任将帅的各五人。',
  },
  {
    time: ['安帝建光', 1, 11, '丙午'],
    type: '救济',
    incident: '皇帝令京师及郡国受雨水伤害庄稼的，根据受害的顷亩数减免田租。',
  },
  {
    time: ['安帝建光', 1, 11, '甲子'],
    type: '战争',
    incident: '开始设置渔阳营兵。',
  },
  {
    time: ['安帝建光', 1, 12],
    type: '战争',
    incident:
      '高句骊、马韩、秽貊等围攻玄菟城，夫馀王派遣儿子与州郡合力讨破之。',
  },
  {
    time: ['安帝延光', 1, 2],
    type: '战争',
    incident:
      '夫馀王派遣儿子领兵救助玄菟，攻击高句骊、马韩、秽貊，打败了他们，随后派遣使者贡献物品。',
  },
  {
    time: ['安帝延光', 1, 3, '丙午'],
    type: '改元',
    incident: '改年号为延光。大赦天下。赏赐万民。',
    source:
      '改元延光。大赦天下。还徙者，复户邑属籍。赐民爵及三老、孝悌、力田，人二级；加赐鳏、寡、孤、独、笃缮、贫不能自存者粟，人三斛；贞妇帛，人二匹。',
  },
  {
    time: ['安帝延光', 1, 4, '癸未'],
    type: '灾害',
    incident: '京师和二十一个郡国下冰雹。',
    tags: ['冰雹'],
  },
  {
    time: ['安帝延光', 1, 4, '癸巳'],
    type: '官吏',
    incident: '司空陈褒被免职。',
    tags: ['三公'],
  },
  {
    time: ['安帝延光', 1, 5, '庚戌'],
    type: '官吏',
    incident: '宗正彭城刘授任司空。',
    tags: ['三公'],
  },
  {
    time: ['安帝延光', 1, 5, '己巳'],
    type: '疆界',
    incident: '改乐成国为安平，封河间王刘开的儿子刘得为安平王。',
  },
  {
    time: ['安帝延光', 1, 6],
    type: '灾害',
    incident: '郡国蝗虫为害。',
    tags: ['蝗灾'],
  },
  {
    time: ['安帝延光', 1, 7, '癸卯'],
    type: '灾害',
    incident: '京师及十三个郡国发生地震。',
    tags: ['地震'],
  },
  {
    time: ['安帝延光', 1, 7, '癸卯'],
    type: '战争',
    incident: '高句骊投降。',
  },
  {
    time: ['安帝延光', 1, 7, '癸卯'],
    type: '战争',
    incident: '虔人羌叛变，度辽将军耿夔讨破之。',
  },
  {
    time: ['安帝延光', 1, 8, '戊子'],
    type: '灾害',
    incident: '阳陵陵园发生火灾。',
    tags: ['火灾'],
  },
  {
    time: ['安帝延光', 1, 8, '辛卯'],
    type: '祥瑞',
    incident: '九真说黄龙出现在无功。',
  },
  {
    time: ['安帝延光', 1, 8, '己亥'],
    type: '推举人才',
    incident:
      '皇帝令三公、中二千石，推举刺史、二千石、令、长、相，任职办事一年以上到十年。刺史推举所属部门，郡国太守相推举墨绶。',
    source:
      '诏三公、中二千石，举刺史、二千石、令、长、相，视事一岁以上至十岁，清白爱利，能敕身率下，防奸理烦，有益于人者，无拘官簿。刺史举所部，郡国太守相举墨绶，隐亲悉心，勿取浮华。',
  },
  {
    time: ['安帝延光', 1, 9, '甲戌'],
    type: '灾害',
    incident: '二十七个郡国发生地震。',
    tags: ['地震'],
  },
  {
    time: ['安帝延光', 1, 10],
    type: '战争',
    incident: '鲜卑侵犯雁门、定襄。',
  },
  {
    time: ['安帝延光', 1, 11],
    type: '战争',
    incident: '鲜卑侵犯太原。',
  },
  {
    time: ['安帝延光', 1, 11],
    type: '战争',
    incident: '烧当羌头领投降。',
  },
  {
    time: ['安帝延光', 1, 12],
    type: '外交',
    incident: '九真境外蛮夷贡献物品内附。',
  },
  {
    time: ['安帝延光', 1],
    type: '年度总结',
    incident:
      '这一年，京师及二十七个郡国下雨发大水，刮大风，死了人。虔人羌攻击谷罗城，度辽将军耿夔讨破之。',
    source:
      '京师及郡国二十七雨水，大风，杀人。诏赐压溺死者年七岁以上钱，人二千；其坏败庐舍、失亡谷食，粟，人三斛；又田被淹伤者，一切勿收田租；若一家皆被灾害而弱小存者，郡县为收敛之。虔人羌反攻谷罗城，度辽将军耿夔讨破之。',
  },
  {
    time: ['安帝延光', 2, 1],
    type: '战争',
    incident: '旄牛夷叛变，侵犯灵关，杀县令。益州刺史蜀郡西部都尉讨之。',
  },
  {
    time: ['安帝延光', 2, 1],
    type: '文化',
    incident:
      '皇帝令选举三署郎及官吏人民能精通《古文尚书》、《毛诗》、《谷梁春秋》各一人。',
  },
  {
    time: ['安帝延光', 2, 1, '丙辰'],
    type: '灾害',
    incident: '河东、颍川刮大风。',
    tags: ['大风'],
  },
  {
    time: ['安帝延光', 2, 6, '壬午'],
    type: '灾害',
    incident: '十一个郡国刮大风。',
    tags: ['大风'],
  },
  {
    time: ['安帝延光', 2, 6, '壬午'],
    type: '祥瑞',
    incident: '九真说有嘉禾生长。',
  },
  {
    time: ['安帝延光', 2, 6, '丙申'],
    type: '宗室',
    incident: '北海王刘普薨。',
  },
  {
    time: ['安帝延光', 2, 7],
    type: '灾害',
    incident: '丹阳山崩。',
    tags: ['山崩'],
  },
  {
    time: ['安帝延光', 2, 8, '庚午'],
    type: '推举人才',
    incident: '开始令三署郎通达经术管制百姓的，任职三年以上，都可以推举。',
  },
  {
    time: ['安帝延光', 2, 11, '甲辰'],
    type: '其他',
    incident: '射猎在上林苑',
  },
  {
    time: ['安帝延光', 2, 11, '甲辰'],
    type: '战争',
    incident: '鲜卑打败南匈奴于曼柏。',
  },
  {
    time: ['安帝延光', 2],
    type: '年度总结',
    incident: '这一年，分蜀郡西部为属国都尉。京师及三个郡国发生地震。',
    tags: ['地震'],
  },
  {
    time: ['安帝延光', 3, 2, '丙子'],
    type: '其他',
    incident: '往东巡视射猎。',
  },
  {
    time: ['安帝延光', 3, 2, '丁丑'],
    type: '祭祀',
    incident:
      '告诉陈留太守，祭祀南顿君、光武皇帝于济阳，免除济阳今年的田租、干草饲。',
  },
  {
    time: ['安帝延光', 3, 2, '丙寅'],
    type: '祭祀',
    incident: '派遣使者祭祀唐尧于成阳。',
  },
  {
    time: ['安帝延光', 3, 2, '戊子'],
    type: '祥瑞',
    incident:
      '济南上奏说，有凤凰集台县丞霍收的房舍旁的树上。赏给台县长帛五十匹，县丞二十匹，县尉二十匹的一半，吏卒每人三匹。凤皇所过亭部，不出今年田租。赐男子爵，人二级。',
  },
  {
    time: ['安帝延光', 3, 2, '辛卯'],
    type: '祭祀',
    incident: '皇帝到泰山，烧柴祭告岱宗。',
  },
  {
    time: ['安帝延光', 3, 2, '辛卯'],
    type: '宗室',
    incident: '齐王刘无忌、北海王刘翼、乐安王刘延来朝拜。',
  },
  {
    time: ['安帝延光', 3, 2, '壬辰'],
    type: '祭祀',
    incident: '祭祀祖宗五帝于汶上明堂。',
  },
  {
    time: ['安帝延光', 3, 2, '癸巳'],
    type: '祭祀',
    incident:
      '告祭高祖、世祖、太宗、世宗、中宗、显宗、肃宗、穆宗，慰劳赏赐郡县，举行演奏礼乐仪式。',
  },
  {
    time: ['安帝延光', 3, 3, '甲午'],
    type: '宗室',
    incident: '陈王刘崇薨。',
  },
  {
    time: ['安帝延光', 3, 3, '戊戌'],
    type: '祭祀',
    incident:
      '祭祀孔子及他的七十二弟子于阙里，从鲁相、令、丞、尉及孔氏亲属、妇女、各儒生全来聚会，赐褒成侯以下帛各有差。还，幸东平，至东郡，历魏郡、河内。',
  },
  {
    time: ['安帝延光', 3, 3, '壬戌'],
    type: '出行',
    incident: '皇帝回京师，到太学。',
  },
  {
    time: ['安帝延光', 3, 3, '壬戌'],
    type: '官吏',
    incident: '太尉杨震被免官。',
  },
  {
    time: ['安帝延光', 3, 4, '乙丑'],
    type: '出行',
    incident: '皇帝回到宫中，到祖庙。',
  },
  {
    time: ['安帝延光', 3, 4, '壬戌'],
    type: '祥瑞',
    incident: '沛国上奏说及时雨降落在丰县。',
  },
  {
    time: ['安帝延光', 3, 4, '戊辰'],
    type: '官吏',
    incident: '光禄勋冯石担任太尉。',
    tags: ['三公'],
  },
  {
    time: ['安帝延光', 3, 5],
    type: '战争',
    incident: '南匈奴左日逐王叛变，使匈奴中郎将马翼讨伐打败了他们。',
  },
  {
    time: ['安帝延光', 3, 5],
    type: '外交',
    incident: '日南境外蛮夷内附。',
  },
  {
    time: ['安帝延光', 3, 6],
    type: '战争',
    incident: '鲜卑侵犯玄菟。',
  },
  {
    time: ['安帝延光', 3, 6, '庚午'],
    type: '灾害',
    incident: '阆中山崩。',
    tags: ['山崩'],
  },
  {
    time: ['安帝延光', 3, 6, '辛未'],
    type: '祥瑞',
    incident: '扶风上奏说有白鹿出现在雍。',
  },
  {
    time: ['安帝延光', 3, 6, '辛巳'],
    type: '其他',
    incident: '派遣侍御史分别到青翼二州调查灾害情况，督促审查盗贼。',
  },
  {
    time: ['安帝延光', 3, 7, '丁酉'],
    type: '官吏',
    incident: '开始恢复右校、左校令丞官。',
  },
  {
    time: ['安帝延光', 3, 7, '丁酉'],
    type: '外交',
    incident: '日南境外蛮首领到朝廷贡献物品。',
  },
  {
    time: ['安帝延光', 3, 7, '丁酉'],
    type: '祥瑞',
    incident:
      '冯翊上奏说有及时雨降落在频阳、衙。颍川上奏说有连理木。白鹿、麒麟在阳翟出现。',
  },
  {
    time: ['安帝延光', 3, 7, '丁酉'],
    type: '战争',
    incident: '鲜卑侵犯高柳。',
  },
  {
    time: ['安帝延光', 3, 7, '丁酉'],
    type: '宗室',
    incident: '梁王刘坚薨。',
  },
  {
    time: ['安帝延光', 3, 8, '辛巳'],
    type: '官吏',
    incident: '大鸿胪耿宝为大将军。',
  },
  {
    time: ['安帝延光', 3, 8, '戊子'],
    type: '祥瑞',
    incident: '颍川上奏说有麒麟一头、白虎二只出现在阳翟。',
  },
  {
    time: ['安帝延光', 3, 9, '丁酉'],
    type: '其他',
    incident: '废皇太子刘保，贬为济阴王。',
    tags: ['废立太子'],
  },
  {
    time: ['安帝延光', 3, 9, '乙巳'],
    type: '其他',
    incident:
      '皇帝令郡国中都官将死罪监禁囚犯减罪一等，送往敦煌、陇西及度辽营；那些犯去右趾以下及逃亡到赎罪，各有差别。',
  },
  {
    time: ['安帝延光', 3, 9, '辛亥'],
    type: '祥瑞',
    incident: '济南上奏说黄龙出现在历城。',
  },
  {
    time: ['安帝延光', 3, 9, '庚申'],
    type: '天文',
    incident: '月末，有日食发生。',
    tags: ['日食'],
  },
  {
    time: ['安帝延光', 3, 10],
    type: '出行',
    incident: '皇帝出行到长安。',
  },
  {
    time: ['安帝延光', 3, 10, '壬午'],
    type: '祥瑞',
    incident: '新丰上奏说凤凰集于西界亭。',
  },
  {
    time: ['安帝延光', 3, 10, '丁亥'],
    type: '官吏',
    incident: '会见三辅守、令、掾史于长安，举行演奏礼乐仪式。',
  },
  {
    time: ['安帝延光', 3, -10, '乙未'],
    type: '祭祀',
    incident:
      '祭祀高祖庙，随后祭祀十一陵墓，游览上林、昆明池。派遣使者祭祀太上皇于万年，以中牢礼品祭祀萧何、曹参、霍光。',
  },
  {
    time: ['安帝延光', 3, 11, '乙丑'],
    type: '出行',
    incident: '从长安回到宫中。',
  },
  {
    time: ['安帝延光', 3, 12, '乙未'],
    type: '祥瑞',
    incident: '琅琊上奏黄龙出现在诸县。',
  },
  {
    time: ['安帝延光', 3],
    type: '年度总结',
    incident:
      '这一年，京师及二十三个郡国发生地震；三十六个郡下雨发大水，刮大风。下冰雹。',
    tags: ['地震', '水灾', '大风', '冰雹'],
  },
  {
    time: ['安帝延光', 4, 1, '壬午'],
    type: '祥瑞',
    incident: '东郡上奏说有黄龙二条、麒麟一头出现在濮阳。',
  },
  {
    time: ['安帝延光', 4, 2, '乙亥'],
    type: '宗室',
    incident: '下邳王衍薨。',
  },
  {
    time: ['安帝延光', 4, 2, '甲辰'],
    type: '出行',
    incident: '皇帝向南方巡视射猎。',
  },
  {
    time: ['安帝延光', 4, 3, '戊午'],
    type: '天文',
    incident: '初一，有日食发生。',
    tags: ['日食'],
  },
  {
    time: ['安帝延光', 4, 3, '庚申'],
    type: '出行',
    incident: '皇帝到宛，身体不舒服。',
  },
  {
    time: ['安帝延光', 4, 3, '辛酉'],
    type: '官吏',
    incident: '令大将军耿宝行太尉事。',
  },
  {
    time: ['安帝延光', 4, 3, '辛酉'],
    type: '祭祀',
    incident: '祭祀章陵园庙，告诉长沙、零陵太守，祭祀定王、节侯、郁林府君。',
  },
  {
    time: ['安帝延光', 4, 3, '乙丑'],
    type: '出行',
    incident: '从宛返回。',
  },
  {
    time: ['安帝延光', 4, 3, '丁卯'],
    type: '出行',
    incident:
      '皇帝到叶，崩于乘坐到车中。年三十二岁。秘密不敢宣布，所在地方上饮食起居和平常一样。',
    tags: ['驾崩'],
  },
  {
    time: ['安帝延光', 4, 3, '庚午'],
    type: '出行',
    incident: '回到宫中。',
  },
  {
    time: ['安帝延光', 4, 3, '辛未'],
    type: '其他',
    incident:
      '皇帝发丧。尊称皇后为皇太后。太后临朝，任命太后哥哥大鸿胪阎显为车骑将军，在宫中决定，立章帝孙子济北惠王刘寿的儿子北乡侯刘懿为皇帝。',
  },
  {
    time: ['安帝延光', 4, 3, '甲戌'],
    type: '宗室',
    incident: '济南王刘香薨。',
  },
  {
    time: ['安帝延光', 4, 3, '乙酉'],
    type: '其他',
    incident: '北乡侯即皇帝位。',
    tags: ['即皇帝位'],
  },
  {
    time: ['安帝延光', 4, 4, '丁酉'],
    type: '官吏',
    incident: '太尉冯石任太傅，司徒刘熹任太尉，参录尚书事；前司空李合任司徒。',
  },
  {
    time: ['安帝延光', 4, 4, '辛卯'],
    type: '官吏',
    incident:
      '大将军耿宝、中常侍樊丰、侍中谢恽、周广、乳母野王君王圣，坐相阿党，樊丰、谢恽、周广下狱死，耿宝自杀，王圣迁移到雁门。',
  },
  {
    time: ['安帝延光', 4, 4, '己酉'],
    type: '其他',
    incident: '葬孝安皇帝于恭陵。庙号曰恭宗。',
  },
  {
    time: ['安帝延光', 4, 6, '乙巳'],
    type: '其他',
    incident: '大赦天下。皇帝下令先帝巡视射猎所到的地方，都减半交纳今年田租。',
  },
  {
    time: ['安帝延光', 4, 7],
    type: '战争',
    incident: '西域长吏班勇攻击车师后王，杀死他。',
  },
  {
    time: ['安帝延光', 4, 7, '丙午'],
    type: '宗室',
    incident: '东海王刘肃薨。',
  },
  {
    time: ['安帝延光', 4, 10, '丙午'],
    type: '灾害',
    incident: '越巂发生山崩。',
    tags: ['山崩'],
  },
  {
    time: ['安帝延光', 4, 10, '辛亥'],
    type: '其他',
    incident: '少帝薨。',
    tags: ['驾崩'],
  },
  {
    time: ['安帝延光', 4, '冬'],
    type: '灾害',
    incident: '京师发生大瘟疫。',
  },
];

// 顺帝--刘保
const 顺帝: Incident[] = [
  {
    time: ['安帝永宁', 1],
    type: '其他',
    incident: '刘保被立为皇太子',
  },
  {
    time: ['安帝延光', 3],
    type: '其他',
    incident:
      '安帝乳母王圣、大长秋江京诬陷太子乳母王男、厨监邴吉，杀了他们，太子多次为他们唉声叹气。王圣等人恐怕留下后患，于是和樊丰、江京共同设计陷害太子，太子因此被废贬为济阴王。',
    source:
      '永宁元年，立为皇太子。延光三年，安帝乳母王圣、大长秋江京、中常侍樊丰谮太子乳母王男、厨监邴吉，杀之，太子数为叹息。王圣等惧有后祸，遂与丰、京共构陷太子，太子坐废为济阴王。',
  },
  {
    time: ['安帝延光', 4, 3],
    type: '其他',
    incident:
      '安帝崩，北乡侯立。济阴王因为被废贬，不能亲自上殿到安帝灵堂祭奠，悲痛得放声大哭不进饭食，朝廷内外群僚百官没有不为他感到悲哀的。等到北乡侯去世，车骑将军阎显及江京同中常侍刘安、陈达等人禀告太后，秘不发丧，而另外从诸侯王的儿子中征求为太子的，于是紧闭宫门，屯兵把守。',
    source:
      '明年三月，安帝崩，北乡侯立，济阴王以废黜，不得上殿亲临梓宫，悲号不食，内外群僚莫不哀之。及北乡侯薨，车骑将军阎显及江京，与中常侍刘安、陈达等白太后，秘不发丧，而更徵立诸国王子，乃闭宫门，屯兵自守。',
  },
  {
    time: ['安帝延光', 4, 11, '丁巳'],
    type: '灾害',
    incident: '京师及十六个郡国发生地震。',
    tags: ['地震'],
    source: '十一月丁巳，京师及郡国十六地震。',
  },
  {
    time: ['安帝延光', 4, 11, '丁巳'],
    type: '其他',
    tags: ['顺帝政变夺位'],
    incident:
      '这天夜里，中黄门孙程等十九人共同斩杀江京、刘安、陈达等人，迎接济阴王于德阳殿西钟囚室中，即皇帝位，年仅十一岁。',
    source:
      '是夜，中黄门孙程等十九人共斩江京、刘安、陈达等，迎济阴王于德阳殿西锺下，即皇帝位，年十一。近臣尚书以下，从辇到南宫，登云台，召百官。尚书令刘光等奏言：“孝安皇帝圣德明茂，早弃天下。陛下正统，当奉宗庙，而奸臣交构，遂令陛下龙潜蕃国，群僚远近莫不失望。天命有常，北乡不永，汉德盛明，福祚孔章。近臣建策，左右扶翼，内外同心，稽合神明。陛下践祚，奉遵鸿绪，为郊庙主，承续祖宗无穷之烈，上当天心，下猒民望。而即位仓卒，典章多缺，请条案礼仪，分别具奏。”制曰：“可。”乃召公卿百僚，使虎贲、羽林士屯南、北宫诸门。阎显兄弟闻帝立，率兵入北宫，尚书郎镇与交锋刃，遂斩显弟卫尉景。',
  },
  {
    time: ['安帝延光', 4, 11, '戊午'],
    type: '其他',
    tags: ['顺帝政变夺位'],
    incident:
      '派遣使者进入尚书省，夺得皇帝大印，便到嘉德殿，派遣侍御史持符收捕阎显及其弟城门校尉阎耀、执金吾阎晏，下狱杀死。',
    source:
      '戊午，遣使者入省，夺得玺绶，乃幸嘉德殿，遣侍御史持节收阎显及其弟城门校尉耀、执金吾晏，并下狱诛。',
  },
  {
    time: ['安帝延光', 4, 11, '己未'],
    type: '其他',
    tags: ['顺帝政变夺位'],
    incident: '开宫门，撤销把守的兵丁。',
    source: '己未，开门，罢屯兵。',
  },
  {
    time: ['安帝延光', 4, 11, '壬戌'],
    type: '其他',
    tags: ['顺帝政变夺位'],
    incident: '下诏从宽赦免除阎显、江京近亲以外的人。',
    source: '壬戌，诏司隶校尉：“惟阎显、江京近亲当伏辜诛，其馀务崇宽贷。”',
  },
  {
    time: ['安帝延光', 4, 11, '壬申'],
    type: '祭祀',
    incident: '拜谒高祖庙',
    source: '壬申，谒高庙。',
  },
  {
    time: ['安帝延光', 4, 11, '癸酉'],
    type: '祭祀',
    incident: '拜谒光武庙',
    source: '癸酉，谒光武庙。',
  },
  {
    time: ['安帝延光', 4, 11, '己亥'],
    type: '疆界',
    incident: '下诏令益州刺史撤销子午道，开放褒斜路。',
    source: '乙亥，诏益州刺史罢子午道，通褒斜路。',
  },
  {
    time: ['安帝延光', 4, 11, '己卯'],
    type: '其他',
    incident: '葬少帝以诸侯王的礼节。',
    source: '葬少帝以诸王礼。',
  },
  {
    time: ['安帝延光', 4, 11, '己卯'],
    type: '官吏',
    incident: '司空刘授免。',
    source: '司空刘授免。',
    tags: ['三公'],
  },
  {
    time: ['安帝延光', 4, 11, '己卯'],
    type: '官吏',
    incident: '赏赐公卿群臣。',
    source: '赐公卿以下钱谷各有差。',
    tags: ['赏赐'],
  },
  {
    time: ['安帝延光', 4, 12, '甲申'],
    type: '官吏',
    incident: '以少府河南陶敦为司空。',
    source: '以少府河南陶敦为司空。',
  },
  {
    time: ['安帝延光', 4, 12, '甲申'],
    type: '官吏',
    incident: '以少府河南陶敦为司空。',
    source: '以少府河南陶敦为司空。',
  },
  {
    time: ['安帝延光', 4, 12, '甲申'],
    type: '推举人才',
    incident: '举孝廉',
    source: '其令郡国守相视事未满岁者，一切得举孝廉吏。',
    tags: ['举孝廉'],
  },
  {
    time: ['安帝延光', 4, 12, '癸卯'],
    type: '其他',
    incident:
      '尚书奏请下面有关主管，收回延光三年九月丁酉日贬皇太子为济阴王的诏书。奏议得到执行。',
    source:
      '癸卯，尚书奏请下有司，收还延光三年九月丁酉以皇太子为济阴王诏书。奏可。',
  },
  {
    time: ['安帝延光', 4, 12, '癸卯'],
    type: '灾害',
    incident: '京师大瘟疫。',
    source: '京师大疫。',
    tags: ['瘟疫'],
  },
  {
    time: ['安帝延光', 4, 12, '辛亥'],
    type: '推举人才',
    incident: '举贤良',
    source: '辛亥，诏公卿、郡守、国相，举贤良方正、能直言极谏之士各一人。',
    tags: ['举贤良'],
  },
  {
    time: ['安帝延光', 4, 12, '辛亥'],
    type: '其他',
    incident: '赏赐尚书令以下随从皇帝车架到南宫到的官员。',
    source: '尚书令以下从辇幸南宫者，皆增秩赐布各有差。',
    tags: ['赏赐'],
  },
  {
    time: ['顺帝永建', 1, 1, '甲寅'],
    type: '其他',
    incident: '大赦天下。',
    source:
      '永建元年春正月甲寅，诏曰：“先帝圣德，享祚未永，早弃鸿烈。奸慝缘闲，人庶怨讟，上干和气，疫疠为灾。朕奉承大业，未能宁济。盖至理之本，稽私德惠，荡涤宿恶，与人更始，其大赦天下。赐男子爵，人二级，为父后、三老、孝悌、力田三级，流民欲自占者一级；鳏、寡、孤、独、笃缮、贫不能自存者粟，人五斛；贞妇帛，人三匹。坐法当徙，勿徙；亡徒当传，勿传。宗室以罪绝，皆复属籍。其与阎显、江京等交通者，悉勿考。勉修厥职，以康我民。”',
    tags: ['大赦天下'],
  },
  {
    time: ['顺帝永建', 1, 1, '辛未'],
    type: '后宫',
    incident: '皇太后阎氏崩。',
    source: '皇太后阎氏崩。',
  },
  {
    time: ['顺帝永建', 1, 1, '辛巳'],
    type: '官吏',
    incident: '太傅冯石、太尉刘熹、司徒李合免。',
    source: '太傅冯石、太尉刘熹、司徒李合免。',
    tags: ['三公'],
  },
  {
    time: ['顺帝永建', 1, 2, '甲申'],
    type: '后宫',
    incident: '葬安思皇后。',
    source: '葬安思皇后。',
  },
  {
    time: ['顺帝永建', 1, 2, '丙戌'],
    type: '官吏',
    incident:
      '太常桓焉为太傅；大鸿胪朱宠为太尉，参录尚书事；长乐少府九江朱伥为司徒。',
    source:
      '太常桓焉为太傅；大鸿胪朱宠为太尉，参录尚书事；长乐少府九江朱伥为司徒。',
    tags: ['三公'],
  },
  {
    time: ['顺帝永建', 1, 2, '丙戌'],
    type: '官吏',
    incident: '赏赐百官随皇帝车驾宿卫及拜官授职的各有差别。',
    source: '赐百官随辇宿卫及拜除者布各有差。',
    tags: ['赏赐'],
  },
  {
    time: ['顺帝永建', 1, 2, '丙戌'],
    type: '战争',
    incident: '陇西钟羌叛变，护羌校尉马贤讨伐打败了他们。',
    source: '陇西钟羌叛，护羌校尉马贤讨破之。',
  },
  {
    time: ['顺帝永建', 1, 5, '丁丑'],
    type: '战争',
    incident:
      '下诏幽、并、凉州刺史加紧整修边境要塞，修缮设施和屯积防备。立秋以后，检阅操练军马。',
    source:
      '夏五月丁丑，诏幽、并、凉州刺史，使各实二千石以下至黄绶，年老劣弱不任军事者，上名。严敕障塞，缮设屯备，立秋之后，简习戎马。',
  },
  {
    time: ['顺帝永建', 1, 6, '己亥'],
    type: '宗室',
    incident: '封济南王刘错子刘显为济南王。',
    source: '六月己亥，封济南王错子显为济南王。',
  },
  {
    time: ['顺帝永建', 1, 7, '庚午'],
    type: '官吏',
    incident: '卫尉来历为车骑将军。',
    source: '秋七月庚午，卫尉来历为车骑将军。',
  },
  {
    time: ['顺帝永建', 1, 8],
    type: '战争',
    incident: '鲜卑侵犯代郡，代郡太守李超战死。',
    source: '八月，鲜卑寇代郡，代郡太守李超战殁。',
  },
  {
    time: ['顺帝永建', 1, 9, '辛亥'],
    type: '官吏',
    incident: '开始令三公、尚书入宫陈述情况。',
    source: '九月辛亥，初令三公、尚书入奏事。',
  },
  {
    time: ['顺帝永建', 1, 10, '辛巳'],
    type: '其他',
    incident: '下诏减免死罪以下囚徒迁移到边疆；那些逃亡的可以赎罪。',
    source: '冬十月辛巳，诏减死罪以下徙边；其亡命赎，各有差。',
  },
  {
    time: ['顺帝永建', 1, 10, '丁亥'],
    type: '官吏',
    incident: '司空陶敦免。',
    source: '丁亥，司空陶敦免。',
  },
  {
    time: ['顺帝永建', 1, 10, '丁亥'],
    type: '战争',
    incident: '鲜卑侵犯边境。',
    source: '鲜卑犯边。',
  },
  {
    time: ['顺帝永建', 1, 10, '庚寅'],
    type: '战争',
    incident:
      '派遣黎阳营兵出去屯守中山北部边界。通告幽州刺史，要他命沿边郡县增加设置步兵，安排驻防在险要关口。选调五营弓弩师，每郡推选五人，让他们教练战斗射击。',
    source:
      '庚寅，遣黎阳营兵出屯中山北界。告幽州刺史，其令缘边郡增置步兵，列屯塞下。调五营弩师，郡举五人，令教习战射。',
  },
  {
    time: ['顺帝永建', 1, 10, '壬寅'],
    type: '官吏',
    incident: '廷尉张皓为司空。',
    source: '壬寅，廷尉张皓为司空。',
  },
  {
    time: ['顺帝永建', 1, 10, '甲辰'],
    type: '救济',
    incident: '下诏减免田租以救济因瘟疫水灾受到影响的灾民。',
    source:
      '甲辰，诏以疫疠水潦，令人半输今年田租；伤害什四以上，勿收责；不满者，以实除之。',
  },
  {
    time: ['顺帝永建', 1, 12, '辛巳'],
    type: '官吏',
    incident: '赏赐王公及官员。',
    source: '十二月辛巳，赐王、主、贵人、公卿以下布各有差。',
  },
  {
    time: ['顺帝永建', 2, 1, '戊申'],
    type: '宗室',
    incident: '乐安王刘鸿来朝。',
    source: '二年春正月戊申，乐安王鸿来朝。',
  },
  {
    time: ['顺帝永建', 2, 1, '丁卯'],
    type: '宗室',
    incident: '常山王常山王章薨。章薨。',
    source: '丁卯，常山王章薨。',
  },
  {
    time: ['顺帝永建', 2, 2],
    type: '战争',
    incident: '鲜卑侵犯辽东、玄菟。',
    source: '二月，鲜卑寇辽东、玄菟。',
  },
  {
    time: ['顺帝永建', 2, 2, '甲辰'],
    type: '救济',
    incident: '下诏荆、豫、兖、冀四州开官仓借贷粮食给贫民。',
    source: '甲辰，诏禀贷荆、豫、兖、冀四州流冗贫人，所在安业之；疾病致医药。',
  },
  {
    time: ['顺帝永建', 2, 2, '甲辰'],
    type: '战争',
    incident: '护乌桓校尉耿晔率南单于击鲜卑，破之。',
    source: '护乌桓校尉耿晔率南单于击鲜卑，破之。',
  },
  {
    time: ['顺帝永建', 2, 3],
    type: '灾害',
    incident: '天旱。',
    source: '三月，旱。',
  },
  {
    time: ['顺帝永建', 2, 3],
    type: '其他',
    incident: '派遣使者审查囚徒。',
    source: '遣使者录囚徒。',
  },
  {
    time: ['顺帝永建', 2, 3],
    type: '外交',
    incident: '疏勒国派遣使者上朝奉献物品。',
    source: '疏勒国遣使奉献。',
  },
  {
    time: ['顺帝永建', 2, 6, '乙酉'],
    type: '后宫',
    incident: '追尊谥皇母李氏为恭愍皇后，葬于恭北陵。',
    source: '追尊谥皇妣李氏为恭愍皇后，葬于恭北陵。',
  },
  {
    time: ['顺帝永建', 2, 6, '乙酉'],
    type: '战争',
    incident:
      '西域长史班勇、敦煌太守张朗讨焉耆、尉犁、危须三国，破之；三国遣子贡献。',
    source:
      '西域长史班勇、敦煌太守张朗讨焉耆、尉犁、危须三国，破之；并遣子贡献。',
  },
  {
    time: ['顺帝永建', 2, 7, '甲戌'],
    type: '天文',
    incident: '有日食发生。',
    source: '秋七月甲戌朔，日有食之。',
    tags: ['日食'],
  },
  {
    time: ['顺帝永建', 2, 7, '壬午'],
    type: '官吏',
    incident: '太尉朱宠、司徒朱伥被罢免。',
    source: '壬午，太尉朱宠、司徒朱伥罢。',
  },
  {
    time: ['顺帝永建', 2, 7, '庚子'],
    type: '官吏',
    incident: '太常刘光为太尉，录尚书事；光禄勋许敬为司徒。',
    source: '太常刘光为太尉，录尚书事；光禄勋许敬为司徒。',
  },
  {
    time: ['顺帝永建', 2, 7, '辛丑'],
    type: '宗室',
    incident: '下邳王刘成薨。',
    source: '辛丑，下邳王成薨。',
  },
  {
    time: ['顺帝永建', 3, 1, '丙子'],
    type: '灾害',
    incident: '京师地震，汉阳地面下陷裂开。',
    source: '三年春正月丙子，京师地震，汉阳地陷裂。',
    tags: ['地震', '地陷'],
  },
  {
    time: ['顺帝永建', 3, 1, '甲午'],
    type: '救济',
    incident: '下诏核实受伤的人，进行救济。',
    source:
      '甲午，诏实核伤害者，赐年七岁以上钱，人二千；一家被害，郡县为收敛。',
  },
  {
    time: ['顺帝永建', 3, 1, '乙未'],
    type: '救济',
    incident: '下诏勿收汉阳今天的田租、口赋。',
    source: '乙未，诏勿收汉阳今年田租、口赋。',
  },
  {
    time: ['顺帝永建', 3, 4, '癸卯'],
    type: '救济',
    incident: '派遣光禄大夫巡察汉阳及河内、魏郡、陈留、东郡，开仓救济。',
    source:
      '夏四月癸卯，遣光禄大夫案行汉阳及河内、魏郡、陈留、东郡，禀贷贫人。',
  },
  {
    time: ['顺帝永建', 3, 6],
    type: '灾害',
    incident: '天旱。',
    source: '六月，旱。',
    tags: ['旱灾'],
  },
  {
    time: ['顺帝永建', 3, 6],
    type: '其他',
    incident: '派遣使者审查囚犯的犯罪记录，清理出罪轻而被监禁的囚犯。',
    source: '遣使者录囚徒，理轻系。',
  },
  {
    time: ['顺帝永建', 3, 6, '甲寅'],
    type: '宗室',
    incident: '济南王刘显薨。',
    source: '甲寅，济南王显薨。',
  },
  {
    time: ['顺帝永建', 3, 7, '丁酉'],
    type: '灾害',
    incident: '茂陵园遭灾，皇帝身穿白色丧服避开正殿。',
    source: '秋七月丁酉，茂陵园实灾，帝缟素避正殿。',
  },
  {
    time: ['顺帝永建', 3, 7, '辛亥'],
    type: '祭祀',
    incident: '派太常王龚持节告祭茂陵。',
    source: '辛亥，使太常王龚持节告祠茂陵。',
  },
  {
    time: ['顺帝永建', 3, 9],
    type: '战争',
    incident: '鲜卑侵犯渔阳。',
    source: '九月，鲜卑寇渔阳。',
  },
  {
    time: ['顺帝永建', 3, 12, '己亥'],
    type: '官吏',
    incident: '太傅桓焉免。',
    source: '冬十二月己亥，太傅桓焉免。',
  },
  {
    time: ['顺帝永建', 3],
    type: '其他',
    incident: '车骑将军来历被罢免。',
    source: '是岁，车骑将军来历罢。',
  },
  {
    time: ['顺帝永建', 4, 1, '丙寅'],
    type: '其他',
    incident: '大赦天下。',
    source:
      '四年春正月丙寅，诏曰：“朕托王公之上，涉道日寡，政失厥中，阴阳气隔，寇盗肆暴，庶狱弥繁，忧悴永叹，疢如疾首。《诗》云：‘君子如祉，乱庶遄已。’三朝之会，朔旦立春，嘉与海内洗心自新。其赦天下。从甲寅赦令已来复秩属籍，三年正月已来还赎。其阎显、江京等知识婚姻禁锢，一原除之。务崇宽和，敬顺时令，遵典去苛，以称朕意。”',
    tags: ['大赦天下'],
  },
  {
    time: ['顺帝永建', 4, 1, '丙子'],
    type: '其他',
    incident: '皇帝举行加冠仪式。赏赐群臣百姓。',
    source:
      '丙子，帝加元服。赐王、主、贵人、公卿以下金帛各有差。赐男子爵及流民欲占者人一级，为父后、三老、孝悌、力田人二级；鳏、寡、孤、独、笃缮、不能自存帛，一匹。',
  },
  {
    time: ['顺帝永建', 4, 2, '戊戌'],
    type: '其他',
    incident:
      '下诏因百姓入山凿石，发泄地中藏气的，命令有关主管检察当即禁止，按建武、永平年间的规定处理。',
    source:
      '二月戊戌，诏以民入山凿石，发泄藏气，敕有司检察所当禁绝，如建武、永平故事。',
  },
  {
    time: ['顺帝永建', 4, 5, '壬辰'],
    type: '其他',
    incident: '下诏退还桂阳太守献上的珍宝。',
    source:
      '夏五月壬辰，诏曰：“海内颇有灾异，朝廷修政，太官减膳，珍玩不御。而桂阳太守文砻，不惟竭忠，宣畅本朝，而远献大珠，以求幸媚，今封以还之。”',
  },
  {
    time: ['顺帝永建', 4, 5, '壬辰'],
    type: '灾害',
    incident: '五个州下雨发大水。',
    source: '五州雨水。',
    tags: ['水灾'],
  },
  {
    time: ['顺帝永建', 4, 8, '庚子'],
    type: '救济',
    incident: '派使者核实受水灾死亡的人数，收敛埋葬，开官仓攻击粮食。',
    source: '秋八月庚子，遣使实核死亡，收敛禀赐。',
  },
  {
    time: ['顺帝永建', 4, 8, '丁巳'],
    type: '官吏',
    incident: '太尉刘光、司空张皓被罢免。',
    source: '丁巳，太尉刘光、司空张皓免。',
  },
  {
    time: ['顺帝永建', 4, 9],
    type: '其他',
    incident: '恢复迁移到安定、北地、上郡居民的原籍，回故乡居住。',
    source: '九月，复安定、北地、上郡归旧土。',
  },
  {
    time: ['顺帝永建', 4, 9, '癸酉'],
    type: '官吏',
    incident: '大鸿胪庞参为太尉，录尚书事。太常王龚为司空。',
    source: '癸酉，大鸿胪庞参为太尉，录尚书事。太常王龚为司空。',
  },
  {
    time: ['顺帝永建', 4, 11, '庚辰'],
    type: '官吏',
    incident: '司徒许敬被罢免。',
    source: '冬十一月庚辰，司徒许敬免。',
    tags: ['三公'],
  },
  {
    time: ['顺帝永建', 4, 11, '庚辰'],
    type: '战争',
    incident: '鲜卑侵犯朔方。',
    source: '鲜卑寇朔方。',
  },
  {
    time: ['顺帝永建', 4, 12, '乙卯'],
    type: '官吏',
    incident: '宗正刘崎为司徒。',
    source: '十二月乙卯，宗正刘崎为司徒。',
  },
  {
    time: ['顺帝永建', 4],
    type: '疆界',
    incident: '分会稽的部分地方为吴郡。',
    source: '是岁，分会稽为吴郡。',
  },
  {
    time: ['顺帝永建', 4],
    type: '外交',
    incident: '拘弥国遣使贡献。',
    source: '拘弥国遣使贡献。',
  },
  {
    time: ['顺帝永建', 5, 1],
    type: '外交',
    incident:
      '疏勒王派遣儿子入朝侍奉皇帝，以及大宛、莎车王都派使者向朝廷贡献的物品。',
    source: '五年春正月，疏勒王遣侍子，及大宛、莎车王皆奉使贡献。',
  },
  {
    time: ['顺帝永建', 5, 4],
    type: '灾害',
    incident: '京师天旱。',
    source: '夏四月，京师旱。',
  },
  {
    time: ['顺帝永建', 5, 4, '辛巳'],
    type: '救济',
    incident: '下诏免除郡国受灾的百姓今年的更役赋税。',
    source: '辛巳，诏郡国贫人被灾者，勿收责今年过更。',
  },
  {
    time: ['顺帝永建', 5, 4, '辛巳'],
    type: '灾害',
    incident: '京师及十二个郡国发生蝗灾。',
    source: '京师及郡国十二蝗。',
  },
  {
    time: ['顺帝永建', 5, 10, '丙辰'],
    type: '其他',
    incident: '下诏郡国中都官对死罪的囚犯减罪一等，送往北地、上郡、安定戍守。',
    source:
      '冬十月丙辰，诏郡国中都官死罪系囚皆减罪一等，诣北地、上郡、安定戍。',
  },
  {
    time: ['顺帝永建', 5, 10, '乙亥'],
    type: '其他',
    incident: '定远侯班始因杀他的妻子阴城公主，被腰斩，同母兄弟被处死示众。',
    source: '乙亥，定远侯班始坐杀其妻阴城公主，腰斩，同产皆弃市。',
  },
  {
    time: ['顺帝永建', 6, 2, '庚午'],
    type: '宗室',
    incident: '河闲王刘开薨。',
    source: '六年春二月庚午，河闲王开薨。',
  },
  {
    time: ['顺帝永建', 6, 3, '辛亥'],
    type: '官吏',
    incident: '恢复伊吾屯田，恢复设置伊吾司马一人。',
    source: '三月辛亥，复伊吾屯田，复置伊吾司马一人。',
  },
  {
    time: ['顺帝永建', 6, 9, '辛巳'],
    type: '其他',
    incident: '兴建太学。',
    source: '秋九月辛巳，缮起太学。',
  },
  {
    time: ['顺帝永建', 6, 9, '辛巳'],
    type: '战争',
    incident: '护乌桓校尉耿晔遣兵击鲜卑，破之。',
    source: '护乌桓校尉耿晔遣兵击鲜卑，破之。',
  },
  {
    time: ['顺帝永建', 6, 9, '丁酉'],
    type: '外交',
    incident: '于阗王派遣儿子入朝侍奉皇帝贡献物品。',
    source: '丁酉，于阗王遣侍子贡献。',
  },
  {
    time: ['顺帝永建', 6, 11, '辛亥'],
    type: '救济',
    incident: '下诏免除冀州地区今年的田租、干草料。',
    source:
      '冬十一月辛亥，诏曰：“连年灾潦，冀部尤甚。比蠲除实伤，赡恤穷匮，而百姓犹有弃业，流亡不绝。疑郡县用心怠惰，恩泽不宣。易美‘损上益下’，书称‘安民则惠’。其令冀部勿收今年田租、刍稿。”',
  },
  {
    time: ['顺帝永建', 6, 12],
    type: '外交',
    incident: '日南境外叶调国、掸国遣使贡献。',
    source: '十二月，日南徼外叶调国、掸国遣使贡献。',
  },
  {
    time: ['顺帝永建', 6, 12, '壬申'],
    type: '天文',
    incident: '客星在牵牛星座出现。',
    source: '壬申，客星出牵牛。',
  },
  {
    time: ['顺帝永建', 6, 12, '壬申'],
    type: '外交',
    incident: '于阗王派遣儿子到朝廷侍奉并贡献物品。',
    source: '于阗王遣侍子诣阙贡献。',
  },
  {
    time: ['顺帝阳嘉', 1, 1, '乙巳'],
    type: '后宫',
    incident: '立皇后梁氏。赏赐天下。',
    source:
      '阳嘉元年春正月乙巳，立皇后梁氏。赐爵，人二级，三老、孝悌、力田三级，爵过公乘，得移与子若同产、同产子，民无名数及流民欲占著者人一级；鳏、寡、孤、独、笃缮、贫不能自存者粟，人五斛。',
  },
  {
    time: ['顺帝阳嘉', 1, 2],
    type: '战争',
    incident:
      '海贼曾旌等侵犯会稽，杀句章、鄞、鄮三个县的县长，攻击会稽东部都尉。皇帝令沿海各自屯兵戍守。',
    source:
      '二月，海贼曾旌等寇会稽，杀句章、鄞、鄮三县长，攻会稽东部都尉。诏缘海县各屯兵戍。',
  },
  {
    time: ['顺帝阳嘉', 1, 2, '丁巳'],
    type: '祭祀',
    incident: '皇后拜谒高祖庙、光武庙。',
    source: '丁巳，皇后谒高庙、光武庙。',
  },
  {
    time: ['顺帝阳嘉', 1, 2, '丁巳'],
    type: '救济',
    incident: '下诏甘陵开官仓救济贫民。',
    source: '诏禀甘陵贫人，大小口各有差。',
  },
  {
    time: ['顺帝阳嘉', 1, 2, '丁巳'],
    type: '灾害',
    incident: '京师天旱。',
    source: '京师旱。',
  },
  {
    time: ['顺帝阳嘉', 1, 2, '庚申'],
    type: '其他',
    incident:
      '皇帝令郡国二千石官员各自祈祷名山岳渎，派遣大夫、谒者到嵩高、首阳山，并祭祀河、洛，求雨。',
    source:
      '庚申，敕郡国二千石各祷名山岳渎，遣大夫、谒者诣嵩高、首阳山，并祠河、洛，请雨。',
  },
  {
    time: ['顺帝阳嘉', 1, 2, '戊辰'],
    type: '其他',
    incident: '举行祈雨的仪式。',
    source: '戊辰，雩。',
  },
  {
    time: ['顺帝阳嘉', 1, 2, '戊辰'],
    type: '救济',
    incident:
      '因冀州连年水灾，皇帝令巡行察访开官仓借贷，勉励农业耕作，救济穷困的人。',
    source: '以冀部比年水潦，民食不赡，诏案行禀贷，劝农功，赈乏绝。',
  },
  {
    time: ['顺帝阳嘉', 1, 2, '甲戌'],
    type: '其他',
    incident:
      '下诏派遣侍中王辅等持节到岱山、东海、荥阳、黄河、洛河，尽心祈祷。',
    source:
      '甲戌，诏曰：“政失厥和，阴阳隔并，冬鲜宿雪，春无澍雨。分祷祈请，靡神不禜。深恐在所慢违‘如在’之义，今遣侍中王辅等，持节分诣岱山、东海、荥阳、河、洛，尽心祈焉。”',
  },
  {
    time: ['顺帝阳嘉', 1, 3],
    type: '战争',
    incident: '杨州六郡盗贼章河等侵犯四十九县，杀伤长吏。',
    source: '三月，杨州六郡妖贼章河等寇四十九县，杀伤长吏。',
  },
  {
    time: ['顺帝阳嘉', 1, 3, '庚寅'],
    type: '改元',
    incident:
      '皇帝到辟雍举行射礼，大赦天下，改年号阳嘉。宗室簿籍中除名的，一律恢复族籍；开冀州官仓供给贫民，不收今年的更役、租税、人口赋。',
    source:
      '庚寅，帝临辟雍飨射，大赦天下，改元阳嘉。诏宗室绝属籍者，一切复籍；禀冀州尤贫民，勿收今年更、租、口赋。',
  },
  {
    time: ['顺帝阳嘉', 1, 5, '戊寅'],
    type: '宗室',
    incident: '阜陵王刘恢薨。',
    source: '夏五月戊寅，阜陵王恢薨。',
  },
  {
    time: ['顺帝阳嘉', 1, 7],
    type: '其他',
    incident: '史官开始制作候风地动铜仪。',
    source: '秋七月，史官始作候风地动铜仪。',
  },
  {
    time: ['顺帝阳嘉', 1, 7, '丙辰'],
    type: '其他',
    incident:
      '以太学新建成，考试明经落第的补充弟子，增甲、乙科员各十人。授郡国老儒九十人补充郎、舍人。',
    source:
      '丙辰，以太学新成，试明经下第者补弟子，增甲、乙科员各十人。除郡国耆儒九十人补郎、舍人。',
  },
  {
    time: ['顺帝阳嘉', 1, 9],
    type: '其他',
    incident: '皇帝令郡国中都官监禁囚犯都减死罪一等，逃亡的人可以赎罪。',
    source: '九月，诏郡国中都官系囚皆减死一等，亡命者赎，各有差。',
  },
  {
    time: ['顺帝阳嘉', 1, 9],
    type: '战争',
    incident: '鲜卑侵犯辽东。',
    source: '鲜卑寇辽东。',
  },
  {
    time: ['顺帝阳嘉', 1, 11, '甲申'],
    type: '灾害',
    incident:
      '望都、蒲阴有狼咬死女子九十七人，皇帝下令赏赐狼所杀的人钱，每人三千。',
    source:
      '冬十一月甲申，望都、蒲阴狼杀女子九十七人，诏赐狼所杀者钱，人三千。',
  },
  {
    time: ['顺帝阳嘉', 1, 11, '辛卯'],
    type: '推举人才',
    incident: '开始令郡国推举孝廉。',
    source:
      '辛卯，初令郡国举孝廉，限年四十以上，诸生通章句，文吏能笺奏，乃得应选；其有茂才异行，若颜渊、子奇，不拘年齿。',
  },
  {
    time: ['顺帝阳嘉', 1, 12, '丁未'],
    type: '宗室',
    incident: '东平王刘敞薨。',
    source: '十二月丁未，东平王敞薨。',
  },
  {
    time: ['顺帝阳嘉', 1, 12, '庚戌'],
    type: '疆界',
    incident: '恢复设置玄菟郡屯田六郡。',
    source: '庚戌，复置玄菟郡屯田六郡。',
  },
  {
    time: ['顺帝阳嘉', 1, -12, '丁亥'],
    type: '官吏',
    incident:
      '令各郡因皇帝命令授给郎官的，年岁四十以上考试如孝廉科的，才能参加举廉的选举，每年选举一人。',
    source:
      '闰月丁亥，令诸以诏除为郎，年四十以上课试如孝廉科者，得参廉选，岁举一人。',
  },
  {
    time: ['顺帝阳嘉', 1, 12, '戊子'],
    type: '天文',
    incident: '客星出现在天苑星座。',
    source: '戊子，客星出天苑。',
  },
  {
    time: ['顺帝阳嘉', 1, 12, '辛卯'],
    type: '官吏',
    incident: '下诏自今日起，刺史、二千石的选用，归三司任用。',
    source:
      '辛卯，诏曰：“闲者以来，吏政不勤，故灾咎屡臻，盗贼多有。退省所由，皆以选举不实，官非其人，是以天心未得，人情多怨。书歌股肱，诗刺三事。今刺史、二千石之选，归任三司。其简序先后，精核高下，岁月之次，文武之宜，务存厥衷。”',
  },
  {
    time: ['顺帝阳嘉', 1, 12, '庚子'],
    type: '灾害',
    incident: '恭陵百丈庑遭遇火灾。',
    source: '庚子，恭陵百丈庑灾。',
  },
  {
    time: ['顺帝阳嘉', 1],
    type: '其他',
    incident: '建造西苑，修饰宫殿。',
    source: '是岁，起西苑，修饰宫殿。',
  },
  {
    time: ['顺帝阳嘉', 2, 2, '甲申'],
    type: '救济',
    incident: '下诏因吴郡会稽饥荒，借给百姓种粮。',
    source: '二年春二月甲申，诏以吴郡、会稽饥荒，贷人种粮。',
  },
  {
    time: ['顺帝阳嘉', 2, 3],
    type: '战争',
    incident: '使匈奴中郎将王稠率左骨都侯等攻击鲜卑，破之。',
    source: '三月，使匈奴中郎将王稠率左骨都侯等击鲜卑，破之。',
  },
  {
    time: ['顺帝阳嘉', 2, 3, '辛酉'],
    type: '其他',
    incident: '授京师老儒年龄在六十岁以上的四十八人补充郎、舍人及诸王国郎。',
    source: '辛酉，除京师耆儒年六十以上四十八人补郎、舍人及诸王国郎。',
  },
  {
    time: ['顺帝阳嘉', 2, 4],
    type: '官吏',
    incident: '恢复设置陇西南部都尉官。',
    source: '夏四月，复置陇西南部都尉官。',
  },
  {
    time: ['顺帝阳嘉', 2, 4, '己亥'],
    type: '灾害',
    incident: '京师发生地震。',
    source: '己亥，京师地震。',
  },
  {
    time: ['顺帝阳嘉', 2, 5, '庚子'],
    type: '其他',
    incident: '皇帝下诏让官员指出自己的过失。',
    source:
      '五月庚子，诏曰：“朕以不德，统奉鸿业，无以奉顺乾坤，协序阴阳，灾眚屡见，咎徵仍臻。地动之异，发自京师，矜矜祗畏，不知所裁。群公卿士将何以匡辅不逮，奉荅戒异？异不空设，必有所应，其各悉心直言厥咎，靡有所讳。”',
  },
  {
    time: ['顺帝阳嘉', 2, 5, '庚午'],
    type: '官吏',
    incident: '司空王龚被免职。',
    source: '戊午，司空王龚免。',
  },
  {
    time: ['顺帝阳嘉', 2, 6, '辛未'],
    type: '官吏',
    incident: '太常鲁国孔扶为司空。',
    source: '六月辛未，太常鲁国孔扶为司空。',
  },
  {
    time: ['顺帝阳嘉', 2, 6, '辛未'],
    type: '外交',
    incident: '疏勒国献狮子、封牛。',
    source: '疏勒国献师子、封牛。',
  },
  {
    time: ['顺帝阳嘉', 2, 6, '丁丑'],
    type: '灾害',
    incident: '洛阳地陷。',
    source: '丁丑，洛阳地陷。',
  },
  {
    time: ['顺帝阳嘉', 2, 6],
    type: '灾害',
    incident: '天旱。',
    source: '是月，旱。',
  },
  {
    time: ['顺帝阳嘉', 2, 7, '乙未'],
    type: '官吏',
    incident: '太尉庞参被免职。',
    source: '秋七月己未，太尉庞参免。',
  },
  {
    time: ['顺帝阳嘉', 2, 8, '己巳'],
    type: '官吏',
    incident: '大鸿胪沛国施延为太尉。',
    source: '八月己巳，大鸿胪沛国施延为太尉。',
  },
  {
    time: ['顺帝阳嘉', 2, 8, '己巳'],
    type: '战争',
    incident: '鲜卑侵犯代郡。',
    source: '鲜卑寇代郡。',
  },
  {
    time: ['顺帝阳嘉', 2, 10, '庚午'],
    type: '其他',
    incident:
      '在辟雍举行典礼仪式，演奏应钟，开始恢复黄钟，作乐器音调长短要随月律。',
    source: '冬十月庚午，行礼辟雍，奏应锺，始复黄锺，作乐器随月律。',
  },
  {
    time: ['顺帝阳嘉', 3, 2, '己丑'],
    type: '其他',
    incident:
      '皇帝令因为久旱不雨，京师各种案件无论轻重都暂且不考查追究，须要得到及时雨。',
    source: '三年春二月己丑，诏以久旱，京师诸狱无轻重皆且勿考竟，须得澍雨。',
  },
  {
    time: ['顺帝阳嘉', 3, 3, '庚戌'],
    type: '战争',
    incident: '益州盗贼劫持令长为人质，杀列侯。',
    source: '三月庚戌，益州盗贼劫质令长，杀列侯。',
  },
  {
    time: ['顺帝阳嘉', 3, 4, '丙寅'],
    type: '战争',
    incident:
      '车师后部司马率后部王加特奴等人袭击匈奴，大败他们，俘获他的叔母。',
    source:
      '夏四月丙寅，车师后部司马率后部王加特奴等掩击匈奴，大破之，获其季母。',
  },
  {
    time: ['顺帝阳嘉', 3, 5, '戊戌'],
    type: '其他',
    incident: '下诏大赦天下，赏赐百姓。',
    source:
      '五月戊戌，制诏曰：“昔我太宗，丕显之德，假于上下，俭以恤民，政致康乂。朕秉事不明，政失厥道，天地谴怒，大变仍见。春夏连旱，寇贼弥繁，元元被害，朕甚愍之。嘉与海内洗心更始。其大赦天下，自殊死以下谋反大逆诸犯不当得赦者，皆赦除之。赐民年八十以上米，一斛，肉二十斤，酒五斗；九十以上加赐帛，人二匹，絮三斤。”',
  },
  {
    time: ['顺帝阳嘉', 3, 7, '庚戌'],
    type: '战争',
    incident: '锺羌侵犯陇西、汉阳。',
    source: '秋七月庚戌，锺羌寇陇西、汉阳。',
  },
  {
    time: ['顺帝阳嘉', 3, 10],
    type: '战争',
    incident: '护羌校尉马续击败了他们。',
    source: '冬十月，护羌校尉马续击破之。',
  },
  {
    time: ['顺帝阳嘉', 3, 11, '壬寅'],
    type: '官吏',
    incident: '司徒刘崎、司空孔扶被免职。',
    source: '十一月壬寅，司徒刘崎、司空孔扶免。',
  },
  {
    time: ['顺帝阳嘉', 3, 11, '乙巳'],
    type: '官吏',
    incident: '大司农南郡黄尚为司徒，光禄勋河东王卓为司空。',
    source: '乙巳，大司农南郡黄尚为司徒，光禄勋河东王卓为司空。',
  },
  {
    time: ['顺帝阳嘉', 3, 11, '丙午'],
    type: '战争',
    incident: '武都塞上屯羌及外羌攻破屯官，驱赶抢劫人和牲畜。',
    source: '丙午，武都塞上屯羌及外羌攻破屯官，驱略人畜。',
  },
  {
    time: ['顺帝阳嘉', 4, 2, '丙子'],
    type: '官吏',
    incident: '开始同意中官可以养子为后嗣，世代继承封爵。',
    source: '四年春二月丙子，初听中官得以养子为后，世袭封爵。',
  },
  {
    time: [
      ['顺帝阳嘉', 3, '冬'],
      ['顺帝阳嘉', 4, 2],
    ],
    type: '灾害',
    incident: '天旱。',
    source: '自去冬旱，至于是月。',
  },
  {
    time: ['顺帝阳嘉', 4, 2],
    type: '战争',
    incident: '谒者马贤攻击锺羌，大破之。',
    source: '谒者马贤击锺羌，大破之。',
  },
  {
    time: ['顺帝阳嘉', 4, 4, '甲子'],
    type: '官吏',
    incident: '太尉施延被免职。',
    source: '夏四月甲子，太尉施延免。',
  },
  {
    time: ['顺帝阳嘉', 4, 4, '戊寅'],
    type: '官吏',
    incident: '执金吾梁商为大将军，前太尉庞参为太尉。',
    source: '戊寅，执金吾梁商为大将军，前太尉庞参为太尉。',
  },
  {
    time: ['顺帝阳嘉', 4, 6, '己未'],
    type: '宗室',
    incident: '梁王刘匡薨。',
    source: '六月己未，梁王匡薨。',
  },
  {
    time: ['顺帝阳嘉', 4, 7, '己亥'],
    type: '宗室',
    incident: '济北王刘登薨。',
    source: '秋七月己亥，济北王登薨。',
  },
  {
    time: ['顺帝阳嘉', 4, -8, '丁亥'],
    type: '天文',
    incident: '有日食发生。',
    source: '闰月丁亥朔，日有食之。',
  },
  {
    time: ['顺帝阳嘉', 4, 10],
    type: '战争',
    incident: '乌桓侵犯云中。',
    source: '冬十月，乌桓寇云中。',
  },
  {
    time: ['顺帝阳嘉', 4, 11],
    type: '战争',
    incident: '乌桓围度辽将军耿晔于兰池，派遣诸郡兵救援他们，乌桓退走。',
    source: '十一月，围度辽将军耿晔于兰池，发诸郡兵救之，乌桓退走。',
  },
  {
    time: ['顺帝阳嘉', 4, 12, '甲寅'],
    type: '灾害',
    incident: '京师地震。',
    source: '十二月甲寅，京师地震。',
  },
  {
    time: ['顺帝永和', 1, 1],
    type: '外交',
    incident: '夫馀王来朝。',
    source: '永和元年春正月，夫馀王来朝。',
  },
  {
    time: ['顺帝永和', 1, 1, '乙卯'],
    type: '其他',
    incident: '因为近期的灾害，皇帝下诏让群臣各自上奏指出得失。',
    source:
      '乙卯，诏曰：“朕秉政不明，灾眚屡臻。典籍所忌，震食为重。今日变方远，地摇京师，咎徵不虚，必有所应。群公百僚其各上封事，指陈得失，靡有所讳。”',
  },
  {
    time: ['顺帝永和', 1, 1, '乙巳'],
    type: '改元',
    incident: '在明堂祭祀祖宗，登灵台看星相，改元永和，大赦天下。',
    source: '己巳，宗祀明堂，登灵台，改元永和，大赦天下。',
  },
  {
    time: ['顺帝永和', 1, 7],
    type: '灾害',
    incident: '偃师发生蝗灾。',
    source: '秋七月，偃师蝗。',
  },
  {
    time: ['顺帝永和', 1, 10, '丁亥'],
    type: '灾害',
    incident: '承福殿发生火灾，皇帝避开正殿到云台。',
    source: '冬十月丁亥，承福殿火，帝避御云台。',
  },
  {
    time: ['顺帝永和', 1, 11, '丙子'],
    type: '官吏',
    incident: '太尉庞参被罢免。',
    source: '十一月丙子，太尉庞参罢。',
  },
  {
    time: ['顺帝永和', 1, 12],
    type: '战争',
    incident: '象林蛮夷叛变。',
    source: '十二月，象林蛮夷叛。',
  },
  {
    time: ['顺帝永和', 1, 12, '己巳'],
    type: '官吏',
    incident: '前司空王龚为太尉。',
    source: '乙巳，以前司空王龚为太尉。',
  },
  {
    time: ['顺帝永和', 2, 1],
    type: '战争',
    incident: '武陵蛮叛变，围攻充县，又侵犯夷道。',
    source: '二年春正月，武陵蛮叛，围充县，又寇夷道。',
  },
  {
    time: ['顺帝永和', 2, 2],
    type: '战争',
    incident: '广汉属国都尉击败了白马羌。',
    source: '二月，广汉属国都尉击破白马羌。',
  },
  {
    time: ['顺帝永和', 2, 2],
    type: '战争',
    incident: '武陵太守李进攻击叛蛮，破之。',
    source: '武陵太守李进击叛蛮，破之。',
  },
  {
    time: ['顺帝永和', 2, 3, '辛亥'],
    type: '宗室',
    incident: '北海王刘翼薨。',
    source: '三月辛亥，北海王翼薨。',
  },
  {
    time: ['顺帝永和', 2, 3, '乙卯'],
    type: '官吏',
    incident: '司空王卓薨。',
    source: '乙卯，司空王卓薨。',
  },
  {
    time: ['顺帝永和', 2, 3, '丁丑'],
    type: '官吏',
    incident: '光禄勋冯翊郭虔为司空。',
    source: '丁丑，光禄勋冯翊郭虔为司空。',
  },
  {
    time: ['顺帝永和', 2, 4, '丙申'],
    type: '灾害',
    incident: '京师地震。',
    source: '夏四月丙申，京师地震。',
  },
  {
    time: ['顺帝永和', 2, 5],
    type: '战争',
    incident: '日南叛蛮攻击郡府。',
    source: '五月，日南叛蛮攻郡府。',
  },
  {
    time: ['顺帝永和', 2, 7],
    type: '战争',
    incident: '九真、交址二郡兵造反。',
    source: '七月，九真、交址二郡兵反。',
  },
  {
    time: ['顺帝永和', 2, 8, '庚子'],
    type: '天文',
    incident: '荧惑星侵犯南斗星。',
    source: '八月庚子，荧惑犯南斗。',
  },
  {
    time: ['顺帝永和', 2, 8, '庚子'],
    type: '战争',
    incident: '江夏盗贼杀邾长。',
    source: '江夏盗贼杀邾长。',
  },
  {
    time: ['顺帝永和', 2, 10, '甲申'],
    type: '出行',
    incident: '皇帝出行到长安。',
    source:
      '冬十月甲申，行幸长安，所过鳏、寡、孤、独、贫不能自存者赐粟，人五斛。',
  },
  {
    time: ['顺帝永和', 2, 10, '庚子'],
    type: '出行',
    incident: '到未央宫，会见三辅郡守、都尉及官属，慰劳赐宴奏乐。',
    source: '庚子，幸未央宫，会三辅郡守、都尉及官属，劳赐作乐。',
  },
  {
    time: ['顺帝永和', 2, 11, '丙午'],
    type: '祭祀',
    incident: '祭祀高祖庙。',
    source: '十一月丙午，祠高庙。',
  },
  {
    time: ['顺帝永和', 2, 11, '丁未'],
    type: '祭祀',
    incident: '祭祀十一陵。',
    source: '丁未，遂有事十一陵。',
  },
  {
    time: ['顺帝永和', 2, 11, '丁卯'],
    type: '灾害',
    incident: '京师地震',
    source: '丁卯，京师地震。',
  },
  {
    time: ['顺帝永和', 2, 12, '乙亥'],
    type: '出行',
    incident: '从长安返回宫中。',
    source: '十二月乙亥，至自长安。',
  },
  {
    time: ['顺帝永和', 3, 2, '乙亥'],
    type: '灾害',
    incident: '京师及金城、陇西地震，二郡山岸崩，地陷。',
    source: '三年春二月乙亥，京师及金城、陇西地震，二郡山岸崩，地陷。',
  },
  {
    time: ['顺帝永和', 3, 2, '戊子'],
    type: '天文',
    incident: '太白星侵犯荧惑星。',
    source: '戊子，太白犯荧惑。',
  },
  {
    time: ['顺帝永和', 3, 4],
    type: '战争',
    incident: '九江贼人蔡伯流侵犯郡界，到广陵，杀江都长。',
    source: '夏四月，九江贼蔡伯流寇郡界，及广陵，杀江都长。',
  },
  {
    time: ['顺帝永和', 3, 4, '戊戌'],
    type: '救济',
    incident:
      '派遣光禄大夫察访金城、陇西，救助被山崩地陷祸及的人。免除今年田租，受灾严重的不收人丁赋。',
    source:
      '戊戌，遣光禄大夫案行金城、陇西，赐压死者年七岁以上钱，人二千；一家皆被害，为收敛之。除今年田租，尤甚者勿收口赋',
  },
  {
    time: ['顺帝永和', 3, -4],
    type: '战争',
    incident: '蔡伯流等率众到徐州刺史应志处投降。',
    source: '闰月，蔡伯流等率众诣徐州刺史应志降。',
  },
  {
    time: ['顺帝永和', 3, -4, '己酉'],
    type: '灾害',
    incident: '京师地震。',
    source: '己酉，京师地震。',
  },
  {
    time: ['顺帝永和', 3, 5],
    type: '战争',
    incident: '吴郡丞羊珍造反，攻打郡府，太守王衡大败杀了他。',
    source: '五月，吴郡丞羊珍反，攻郡府，太守王衡破斩之。',
  },
  {
    time: ['顺帝永和', 3, 6, '辛丑'],
    type: '宗室',
    incident: '琅邪王刘遵薨。',
    source: '六月辛丑，琅邪王遵薨。',
  },
  {
    time: ['顺帝永和', 3, 6, '辛丑'],
    type: '战争',
    incident:
      '九真太守祝良、交址刺史张乔慰劳诱导日南叛蛮，降服了他们，岭外平定。',
    source: '九真太守祝良、交址刺史张乔慰诱日南叛蛮，降之，岭外平。',
  },
  {
    time: ['顺帝永和', 3, 7, '丙戌'],
    type: '宗室',
    incident: '济北王刘多薨。',
    source: '秋七月丙戌，济北王多薨。',
  },
  {
    time: ['顺帝永和', 3, 8, '己未'],
    type: '官吏',
    incident: '司徒黄尚被免职。',
    source: '八月己未，司徒黄尚免。',
  },
  {
    time: ['顺帝永和', 3, 9, '己酉'],
    type: '官吏',
    incident: '光禄勋长沙刘寿为司徒。',
    source: '九月己酉，光禄勋长沙刘寿为司徒。',
  },
  {
    time: ['顺帝永和', 3, 9, '丙戌'],
    type: '推举人才',
    incident:
      '令大将军、三公各自举荐原来任过刺史、二千石及现任令、长、郎、谒者、四府官属刚毅武猛有谋略能任将帅者各二人，特进、卿、校尉各一人。',
    source:
      '丙戌，令大将军、三公各举故刺史、二千石及见令、长、郎、谒者、四府掾属刚毅武猛有谋谟任将帅者各二人，特进、卿、校尉各一人。',
  },
  {
    time: ['顺帝永和', 3, 10],
    type: '战争',
    incident: '烧当羌侵犯金城，护羌校尉马贤打败了他们，羌人互相呼应叛变。',
    source: '冬十月，烧当羌寇金城，护羌校尉马贤击破之，羌遂相招而叛。',
  },
  {
    time: ['顺帝永和', 3, 12, '戊戌'],
    type: '天文',
    incident: '有日食发生。',
    source: '十二月戊戌朔，日有食之。',
  },
  {
    time: ['顺帝永和', 4, 1, '庚辰'],
    type: '官吏',
    incident:
      '中常侍张逵、蘧政、杨定等有罪被杀，牵连到弘农太守张凤、安平相杨皓，被监禁而死。',
    source:
      '四年春正月庚辰，中常侍张逵、蘧政、杨定等有罪诛，连及弘农太守张凤、安平相杨皓，下狱死。',
  },
  {
    time: ['顺帝永和', 4, 3, '乙亥'],
    type: '灾害',
    incident: '京师地震。',
    source: '三月乙亥，京师地震。',
  },
  {
    time: ['顺帝永和', 4, 4, '癸卯'],
    type: '战争',
    incident: '护羌校尉马贤讨伐烧当羌，大破之。',
    source: '夏四月癸卯，护羌校尉马贤讨烧当羌，大破之。',
  },
  {
    time: ['顺帝永和', 4, 4, '戊午'],
    type: '其他',
    incident: '大赦天下。赏赐百姓爵位和粟帛。',
    source: '戊午，大赦天下。赐民爵及粟帛各有差。',
  },
  {
    time: ['顺帝永和', 4, 5, '戊辰'],
    type: '宗室',
    incident: '封故济北惠王刘寿的儿子刘安为济北王。',
    source: '五月戊辰，封故济北惠王寿子安为济北王。',
  },
  {
    time: ['顺帝永和', 4, 8],
    type: '灾害',
    incident: '太原郡天旱，百姓流利失所。',
    source: '秋八月，太原郡旱，民庶流冗。',
  },
  {
    time: ['顺帝永和', 4, 8, '癸丑'],
    type: '救济',
    incident: '派遣光禄大夫察访官仓借贷粮食，免除更赋。',
    source: '癸丑，遣光禄大夫案行禀贷，除更赋。',
  },
  {
    time: ['顺帝永和', 4, 10, '戊午'],
    type: '出行',
    incident: '皇帝校猎上林苑，经过函谷关返回来。',
    source: '冬十月戊午，校猎上林苑，历函谷关而还。',
  },
  {
    time: ['顺帝永和', 4, 11, '丙寅'],
    type: '出行',
    incident: '皇帝到广成苑。',
    source: '十一月丙寅，幸广成苑。',
  },
  {
    time: ['顺帝永和', 5, 2, '戊申'],
    type: '灾害',
    incident: '京师地震。',
    source: '五年春二月戊申，京师地震。',
  },
  {
    time: ['顺帝永和', 5, 4, '庚子'],
    type: '宗室',
    incident: '中山王刘弘薨。',
    source: '夏四月庚子，中山王弘薨。',
  },
  {
    time: ['顺帝永和', 5, 4, '庚子'],
    type: '战争',
    incident: '南匈奴左部句龙大人吾斯、车纽等叛变，围攻美稷。',
    source: '南匈奴左部句龙大人吾斯、车纽等叛，围美稷。',
  },
  {
    time: ['顺帝永和', 5, 5],
    type: '战争',
    incident: '度辽将军马续讨伐吾斯、车纽，破之，使匈奴中郎将陈龟迫杀南单于。',
    source:
      '五月，度辽将军马续讨吾斯、车纽，破之，使匈奴中郎将陈龟迫杀南单于。',
  },
  {
    time: ['顺帝永和', 5, 5, '己丑'],
    type: '天文',
    incident: '有日食发生。',
    source: '己丑晦，日有食之。',
  },
  {
    time: ['顺帝永和', 5, 5, '己丑'],
    type: '战争',
    incident: '且冻羌侵犯三辅，杀令长。',
    source: '且冻羌寇三辅，杀令长。',
  },
  {
    time: ['顺帝永和', 5, 5, '丁丑'], // ？？？ 丁丑在乙丑前
    type: '其他',
    incident: '令死罪以下及逃亡的可以用财物赎罪。',
    source: '丁丑，令死罪以下及亡命赎，各有差。',
  },
  {
    time: ['顺帝永和', 5, 9],
    type: '战争',
    incident: '令扶风、汉阳修筑陇道土堡三百所，设置屯兵。',
    source: '九月，令扶风、汉阳筑陇道坞三百所，置屯兵。',
  },
  {
    time: ['顺帝永和', 5, 9, '辛未'],
    type: '官吏',
    incident: '太尉王龚被罢免。',
    source: '辛未，太尉王龚罢。',
  },
  {
    time: ['顺帝永和', 5, 9, '辛未'],
    type: '战争',
    incident: '且冻羌侵犯武都，烧毁陇关。',
    source: '且冻羌寇武都，烧陇关。',
  },
  {
    time: ['顺帝永和', 5, 9, '壬午'],
    type: '官吏',
    incident: '太常桓焉为太尉。',
    source: '壬午，太常桓焉为太尉。',
  },
  {
    time: ['顺帝永和', 5, 9, '丁亥'],
    type: '其他',
    incident: '迁移西河郡的百姓到离石居住，上郡到夏阳居住，朔方到五原居住。',
    source: '丁亥，徙西河郡居离石，上郡居夏阳，朔方居五原。',
  },
  {
    time: ['顺帝永和', 5, 9, '丁亥'],
    type: '战争',
    incident: '句龙大人吾斯等往东打退乌桓，西收羌胡，侵犯上郡，立车纽为单于。',
    source: '句龙大人吾斯等东引乌桓，西收羌胡，寇上郡，立车纽为单于。',
  },
  {
    time: ['顺帝永和', 5, 11, '辛巳'],
    type: '战争',
    incident: '派遣使匈奴中郎将张耽打破吾斯和车纽，车纽投降。',
    source: '冬十一月辛巳，遣使匈奴中郎将张耽击破之，车纽降。',
  },
  {
    time: ['顺帝永和', 6, 1, '丙子'],
    type: '战争',
    incident:
      '征西将军马贤与且冻羌战于射姑山，马贤军队覆没，安定太守郭璜被监禁而死。',
    source:
      '六年春正月丙子，征西将军马贤与且冻羌战于射姑山，贤军败没，安定太守郭璜下狱死。',
  },
  {
    time: ['顺帝永和', 6, 1, '丙子'],
    type: '财政',
    incident: '皇帝令借贷王、侯国租一年。',
    source: '诏贷王、侯国租一岁。',
  },
  {
    time: ['顺帝永和', 6, -1],
    type: '战争',
    incident: '巩唐羌侵犯陇西，随后到三辅。',
    source: '闰月，巩唐羌寇陇西，遂及三辅。',
  },
  {
    time: ['顺帝永和', 6, 2, '丁巳'],
    type: '天文',
    incident: '有彗星出现在营室星座。',
    source: '二月丁巳，有星孛于营室。',
  },
  {
    time: ['顺帝永和', 6, 3],
    type: '战争',
    incident: '武都太守赵冲讨伐巩唐羌，破之。',
    source: '三月，武都太守赵冲讨巩唐羌，破之。',
  },
  {
    time: ['顺帝永和', 6, 3, '庚子'],
    type: '官吏',
    incident: '司空郭虔被免职。',
    source: '庚子，司空郭虔免。',
  },
  {
    time: ['顺帝永和', 6, 3, '丁巳'],
    type: '宗室',
    incident: '河闲王刘政薨。',
    source: '丁巳，河闲王政薨。',
  },
  {
    time: ['顺帝永和', 6, 3, '丙午'],
    type: '官吏',
    incident: '太仆赵戒为司空。',
    source: '丙午，太仆赵戒为司空。',
  },
  {
    time: ['顺帝永和', 6, 5, '庚子'],
    type: '宗室',
    incident: '齐王刘无忌薨。',
    source: '夏五月庚子，齐王无忌薨。',
  },
  {
    time: ['顺帝永和', 6, 5, '庚子'],
    type: '战争',
    incident: '使匈奴中郎将张耽大破乌桓、羌胡于天山。',
    source: '使匈奴中郎将张耽大破乌桓、羌胡于天山。',
  },
  {
    time: ['顺帝永和', 6, 5, '庚子'],
    type: '战争',
    incident: '巩唐羌侵犯北地。',
    source: '巩唐羌寇北地。',
  },
  {
    time: ['顺帝永和', 6, 7, '甲午'],
    type: '财政',
    incident: '皇帝令借百姓有资财的每户钱一千。',
    source: '秋七月甲午，诏假民有赀者户钱一千。',
  },
  {
    time: ['顺帝永和', 6, 8, '丙辰'],
    type: '官吏',
    incident: '大将军梁商薨。',
    source: '八月丙辰，大将军梁商薨。',
  },
  {
    time: ['顺帝永和', 6, 8, '壬戌'],
    type: '官吏',
    incident: '河南尹梁冀为大将军。',
    source: '壬戌，河南尹梁冀为大将军。',
  },
  {
    time: ['顺帝永和', 6, 9],
    type: '战争',
    incident: '诸种羌侵犯武威。',
    source: '九月，诸种羌寇武威。',
  },
  {
    time: ['顺帝永和', 6, 9, '辛亥'],
    type: '天文',
    incident: '有日食发生。',
    source: '辛亥晦，日有食之。',
  },
  {
    time: ['顺帝永和', 6, 10, '癸丑'],
    type: '其他',
    incident: '迁徙安定的百姓到扶风居住，北地的百姓到冯翊居住。',
    source: '冬十月癸丑，徙安定居扶风，北地居冯翊。',
  },
  {
    time: ['顺帝永和', 6, 11, '庚子'],
    type: '战争',
    incident: '以执金吾张乔代理车骑将军事，率领军队屯守三辅。',
    source: '十一月庚子，以执金吾张乔行车骑将军事，将兵屯三辅。',
  },
  {
    time: ['顺帝汉安', 1, 1, '癸巳'],
    type: '改元',
    incident: '在明堂祭祀祖宗，大赦天下，改元汉安。',
    source: '汉安元年春正月癸巳，宗祀明堂，大赦天下，改元汉安。',
  },
  {
    time: ['顺帝汉安', 1, 2, '丙辰'],
    type: '推举人才',
    incident: '皇帝令大将军、公、卿等举荐贤良方正能探索玄妙道理的各一人。',
    source: '二月丙辰，诏大将军、公、卿举贤良方正、能探赜索隐者各一人。',
  },
  {
    time: ['顺帝汉安', 1, 7],
    type: '其他',
    incident: '开始设置承华厩。',
    source: '秋七月，始置承华厩。',
  },
  {
    time: ['顺帝汉安', 1, 8],
    type: '战争',
    incident: '南匈奴左部大人句龙吾斯与薁鞬台耆等反叛。',
    source: '八月，南匈奴左部大人句龙吾斯与薁鞬台耆等反叛。',
  },
  {
    time: ['顺帝汉安', 1, 8, '丁卯'],
    type: '官吏',
    incident:
      '派遣侍中杜乔、光禄大夫周举、守光禄大夫郭遵、冯羡、栾巴、张纲、周栩、刘班等八人分别巡防州郡，宣扬风俗教化，检举核实善恶好坏。',
    source:
      '丁卯，遣侍中杜乔、光禄大夫周举、守光禄大夫郭遵、冯羡、栾巴、张纲、周栩、刘班等八人分行州郡，班宣风化，举实臧否。',
  },
  {
    time: ['顺帝汉安', 1, 9, '庚寅'],
    type: '战争',
    incident: '广陵盗贼张婴等侵犯郡县。',
    source: '九月庚寅，广陵盗贼张婴等寇郡县。',
  },
  {
    time: ['顺帝汉安', 1, 10, '辛未'],
    type: '官吏',
    incident: '太尉桓焉、司徒刘寿被免职。',
    source: '冬十月辛未，太尉桓焉、司徒刘寿免。',
  },
  {
    time: ['顺帝汉安', 1, 10, '甲戌'],
    type: '官吏',
    incident: '行车骑将军张乔被罢免。',
    source: '甲戌，行车骑将军张乔罢。',
  },
  {
    time: ['顺帝汉安', 1, 11, '壬午'],
    type: '官吏',
    incident: '司隶校尉赵峻为太尉，大司农胡广为司徒。',
    source: '十一月壬午，司隶校尉赵峻为太尉，大司农胡广为司徒。',
  },
  {
    time: ['顺帝汉安', 1, 11, '癸卯'],
    type: '推举人才',
    incident: '皇帝令大将军、三公选拔勇猛试用有效验能担任将校的各一人。',
    source: '癸卯，诏大将军、三公选武猛试用有效验任为将校者各一人。',
  },
  {
    time: ['顺帝汉安', 1],
    type: '战争',
    incident: '广陵贼人张婴等到太守张纲处投降。',
    source: '是岁，广陵贼张婴等诣太守张纲降。',
  },
  {
    time: ['顺帝汉安', 2, 2, '丙辰'],
    type: '外交',
    incident: '鄯善国遣使贡献。',
    source: '二年春二月丙辰，鄯善国遣使贡献。',
  },
  {
    time: ['顺帝汉安', 2, 4, '庚戌'],
    type: '战争',
    incident: '护羌校尉赵冲与汉阳太守张贡击烧当羌于参读，破之。',
    source: '夏四月庚戌，护羌校尉赵冲与汉阳太守张贡击烧当羌于参读，破之。',
  },
  {
    time: ['顺帝汉安', 2, 6, '乙丑'],
    type: '天文',
    incident: '荧惑星侵犯镇星。',
    source: '六月乙丑，荧惑犯镇星。',
  },
  {
    time: ['顺帝汉安', 2, 6, '丙寅'],
    type: '外交',
    incident: '立南匈奴守义王兜楼储为南单于。',
    source: '丙寅，立南匈奴守义王兜楼储为南单于。',
  },
  {
    time: ['顺帝汉安', 2, 10, '辛丑'],
    type: '其他',
    incident:
      '令郡国中都官对监禁囚犯犯死罪以下罪行的出缣赎罪，各有差别；不能交纳的，遣送到临羌县服劳役二年。',
    source:
      '冬十月辛丑，令郡国中都官系囚殊死以下出缣赎，各有差；其不能入赎者，遣诣临羌县居作二岁。',
  },
  {
    time: ['顺帝汉安', 2, 10, '甲辰'],
    type: '财政',
    incident: '减百官俸禄。',
    source: '甲辰，减百官奉。',
  },
  {
    time: ['顺帝汉安', 2, 10, '丙午'],
    type: '财政',
    incident: '禁止卖酒，又借贷王、侯国租一年。',
    source: '丙午，禁沽酒，又贷王、侯国租一岁。',
  },
  {
    time: ['顺帝汉安', 2, -10],
    type: '战争',
    incident: '赵冲攻击烧当羌于河阳，破之。',
    source: '闰月，赵冲击烧当羌于河阳，破之。',
  },
  {
    time: ['顺帝汉安', 2, 11],
    type: '战争',
    incident: '使匈奴中郎将马寔遣人刺杀句龙吾斯。',
    source: '十一月，使匈奴中郎将马寔遣人刺杀句龙吾斯。',
  },
  {
    time: ['顺帝汉安', 2, 12],
    type: '战争',
    incident: '杨州、徐州盗贼攻烧城寺，杀害抢掠吏民。',
    source: '十二月，杨、徐盗贼攻烧城寺，杀略吏民。',
  },
  {
    time: ['顺帝汉安', 2],
    type: '年度总结',
    incident: '凉州地区发生一百八十次地震。',
    source: '是岁，凉州地百八十震。',
  },
  {
    time: ['顺帝建康', 1, 1, '辛丑'],
    type: '其他',
    incident:
      '因为陇西、汉阳、张掖、北地、武威、武都自去年九月起，发生了一百八十次地震。下诏派遣光禄大夫巡行察访，宣扬恩泽。',
    source:
      '建康元年春正月辛丑，诏曰：“陇西、汉阳、张掖、北地、武威、武都，自去年九月已来，地百八十震，山谷坼裂，坏败城寺，杀害民庶。夷狄叛逆，赋役重数，内外怨旷，惟咎叹息。其遣光禄大夫案行，宣畅恩泽，惠此下民，勿为烦扰。”',
  },
  {
    time: ['顺帝建康', 1, 3, '庚子'],
    type: '宗室',
    incident: '沛王刘广薨。',
    source: '三月庚子，沛王广薨。',
  },
  {
    time: ['顺帝建康', 1, 3, '庚子'],
    type: '战争',
    incident: '代领护羌校尉卫琚追讨叛羌，破之。',
    source: '领护羌校尉卫琚追讨叛羌，破之。',
  },
  {
    time: ['顺帝建康', 1, 3, '庚子'],
    type: '战争',
    incident: '南郡、江夏盗贼寇掠城邑，州郡讨伐平定了他们。',
    source: '南郡、江夏盗贼寇掠城邑，州郡讨平之。',
  },
  {
    time: ['顺帝建康', 1, 4],
    type: '战争',
    incident:
      '使匈奴中郎将马寔击南匈奴左部，破之，于是胡羌、乌桓全到马寔处投降。',
    source:
      '夏四月，使匈奴中郎将马寔击南匈奴左部，破之，于是胡羌、乌桓悉诣寔降。',
  },
  {
    time: ['顺帝建康', 1, 4, '辛巳'],
    type: '改元',
    incident: '立皇子炳为皇太子，改年建康，大赦天下。赐给人民爵位各有差别。',
    source: '辛巳，立皇子炳为皇太子，改年建康，大赦天下。赐人爵各有差。',
  },
  {
    time: ['顺帝建康', 1, 7, '丙午'],
    type: '宗室',
    incident: '清河王刘延平薨。',
    source: '秋七月丙午，清河王延平薨。',
  },
  {
    time: ['顺帝建康', 1, 8],
    type: '战争',
    incident:
      '杨州、徐州盗贼范容、周生等寇掠城邑，派遣御史中丞冯赦督州郡兵讨之。',
    source:
      '八月，杨、徐盗贼范容、周生等寇掠城邑，遣御史中丞冯赦督州郡兵讨之。',
  },
  {
    time: ['顺帝建康', 1, 8, '庚午'],
    type: '其他',
    incident:
      '顺帝崩于玉堂前殿，时年三十。遗诏不修建寝庙，收敛埋葬用的旧衣服，珠宝玉器玩好物品都不准用来陪葬。',
    source:
      '庚午，帝崩于玉堂前殿，时年三十。遗诏无起实庙，敛以故服，珠玉玩好皆不得下。',
  },
];

// 冲帝--刘炳
// 孝冲皇帝讳炳，顺帝之子也。母曰虞贵人。
const 冲帝: Incident[] = [
  {
    time: ['顺帝建康', 1, 8, '庚午'],
    type: '其他',
    incident: '顺帝即皇帝位，年二岁。尊皇后叫皇太后。太后临朝。',
    source:
      '建康元年立为皇太子，其年八月庚午，即皇帝位，年二岁。尊皇后曰皇太后。太后临朝。',
  },
  {
    time: ['顺帝建康', 1, 8, '丁丑'],
    type: '官吏',
    incident: '以太尉赵峻为太傅；大司农李固为太尉，参录尚书事。',
    source: '丁丑，以太尉赵峻为太傅；大司农李固为太尉，参录尚书事。',
  },
  {
    time: ['顺帝建康', 1, 9, '丙午'],
    type: '其他',
    incident: '葬孝顺皇帝于宪陵，庙号为敬宗。',
    source: '九月丙午，葬孝顺皇帝于宪陵，庙曰敬宗。',
  },
  {
    time: ['顺帝建康', 1, 9, '丙午'],
    type: '灾害',
    incident: '京师及太原、雁门地震，三郡水涌土裂。',
    source: '是日，京师及太原、雁门地震，三郡水涌土裂。',
  },
  {
    time: ['顺帝建康', 1, 9, '庚戌'],
    type: '推举人才',
    incident:
      '皇帝令三公、特进、侯、卿、校尉，举贤良方正、幽逸修道之士各一人，百官都秘密上奏陈述意见。',
    source:
      '庚戌，诏三公、特进、侯、卿、校尉，举贤良方正、幽逸修道之士各一人，百僚皆上封事。',
  },
  {
    time: ['顺帝建康', 1, 9, '己未'],
    type: '官吏',
    incident: '九江太守丘腾有罪，被监禁而死。',
    source: '己未，九江太守丘腾有罪，下狱死。',
  },
  {
    time: ['顺帝建康', 1, 9, '己未'],
    type: '战争',
    incident:
      '杨州刺史尹耀、九江太守邓显讨贼范容等于历阳，军队被打败，尹耀、邓显为贼所杀。',
    source:
      '杨州刺史尹耀、九江太守邓显讨贼范容等于历阳，军败，耀、显为贼所殁。',
  },
  {
    time: ['顺帝建康', 1, 10],
    type: '战争',
    incident: '日南蛮夷攻烧城邑，交址刺史夏方招诱降之。',
    source: '冬十月，日南蛮夷攻烧城邑，交址刺史夏方招诱降之。',
  },
  {
    time: ['顺帝建康', 1, 10, '壬申'],
    type: '宗室',
    incident: '常山王刘仪薨。',
    source: '壬申，常山王仪薨。',
  },
  {
    time: ['顺帝建康', 1, 10, '己卯'],
    type: '官吏',
    incident: '零陵太守刘康坐杀无辜，被监禁而死。',
    source: '己卯，零陵太守刘康坐杀无辜，下狱死。',
  },
  {
    time: ['顺帝建康', 1, 11],
    type: '战争',
    incident: '九江盗贼徐凤、马勉等称“无上将军”，攻烧城邑。',
    source: '十一月，九江盗贼徐凤、马勉等称“无上将军”，攻烧城邑。',
  },
  {
    time: ['顺帝建康', 1, 11, '乙酉'],
    type: '其他',
    incident:
      '令郡国中都官对监禁对囚犯减死罪一等，迁移到边疆；谋反大逆，不用此令。',
    source: '己酉，令郡国中都官系囚减死一等，徙边；谋反大逆，不用此令。',
  },
  {
    time: ['顺帝建康', 1, 12],
    type: '战争',
    incident: '九江贼人黄虎等攻合肥。',
    source: '十二月，九江贼黄虎等攻合肥。',
  },
  {
    time: ['顺帝建康', 1],
    type: '其他',
    incident: '群盗挖掘宪陵。',
    source: '是岁，群盗发宪陵。',
  },
  {
    time: ['顺帝建康', 1],
    type: '战争',
    incident: '护羌校尉赵冲追击叛羌于鸇阴河，战死。',
    source: '护羌校尉赵冲追击叛羌于鸇阴河，战殁。',
  },
  {
    time: ['冲帝永嘉', 1, 1, '戊戌'],
    type: '其他',
    incident: '冲帝崩于玉堂前殿，年三岁。',
    source: '帝崩于玉堂前殿，年三岁。',
  },
  {
    time: ['冲帝永嘉', 1, 1, '戊戌'],
    type: '宗室',
    incident: '清河王刘蒜征召至京师。',
    source: '清河王蒜征至京师。',
  },
];

// 质帝--刘缵
// 孝质皇帝讳缵，肃宗玄孙。曾祖父千乘贞王伉，祖父乐安夷王宠，父勃海孝王鸿，母陈夫人。
const 质帝: Incident[] = [
  {
    time: ['冲帝永嘉', 1, 1, '丙辰'],
    type: '其他',
    incident:
      '派梁冀持符节，用王青盖车迎刘缵入南宫。丁巳，封刘缵为建平侯，其日即皇帝位，是为质帝，年八岁。',
    source:
      '冲帝不豫，大将军梁冀徵帝到洛阳都亭。及冲帝崩，皇太后与冀定策禁中，丙辰，使冀持节，以王青盖车迎帝入南宫。丁巳，封为建平侯，其日即皇帝位，年八岁。',
  },
  {
    time: ['冲帝永嘉', 1, 1, '己未'],
    type: '其他',
    incident: '葬孝冲皇帝于怀陵。',
    source: '己未，葬孝冲皇帝于怀陵。',
  },
  {
    time: ['冲帝永嘉', 1, 1, '己未'],
    type: '战争',
    incident:
      '广陵贼张婴等再次反叛，攻杀堂邑、江都长。九江贼徐凤等攻杀曲阳、东城长。',
    source:
      '广陵贼张婴等复反，攻杀堂邑、江都长。九江贼徐凤等攻杀曲阳、东城长。',
  },
  {
    time: ['冲帝永嘉', 1, 1, '甲申'],
    type: '祭祀',
    incident: '拜谒高祖庙。',
    source: '甲申，谒高庙。',
  },
  {
    time: ['冲帝永嘉', 1, 1, '乙酉'],
    type: '祭祀',
    incident: '拜谒光武庙。',
    source: '乙酉，谒光武庙。',
  },
  {
    time: ['冲帝永嘉', 1, 2],
    type: '官吏',
    incident: '豫章太守虞续因贪赃，被监禁而死。',
    source: '二月，豫章太守虞续坐赃，下狱死。',
  },
  {
    time: ['冲帝永嘉', 1, 2, '乙酉'],
    type: '其他',
    incident: '大赦天下，赐百姓爵位及粟帛各有差别。退还王侯们被削掉的户邑。',
    source: '乙酉，大赦天下，赐人爵及粟帛各有差。还王侯所削户邑。',
  },
  {
    time: ['冲帝永嘉', 1, 2, '乙酉'],
    type: '宗室',
    incident: '彭城王刘道薨。',
    source: '彭城王道薨。',
  },
  {
    time: ['冲帝永嘉', 1, 2, '乙酉'],
    type: '战争',
    incident: '叛羌到左冯翊梁并处投降。',
    source: '叛羌诣左冯翊梁并降。',
  },
  {
    time: ['冲帝永嘉', 1, 3],
    type: '战争',
    incident:
      '九江贼马勉称“黄帝”。九江都尉滕抚讨伐马勉、范容、周生，大破斩之。',
    source:
      '三月，九江贼马勉称“黄帝”。九江都尉滕抚讨马勉、范容、周生、大破斩之。',
  },
  {
    time: ['冲帝永嘉', 1, 4, '壬申'],
    type: '祭祀',
    incident: '举行祈雨仪式。',
    source: '夏四月壬申，雩。',
  },
  {
    time: ['冲帝永嘉', 1, 4, '庚辰'],
    type: '宗室',
    incident: '济北王刘安薨。',
    source: '庚辰，济北王安薨。',
  },
  {
    time: ['冲帝永嘉', 1, 4, '庚辰'],
    type: '战争',
    incident: '丹阳贼陆宫等围城，烧亭寺，丹阳太守江汉击破之。',
    source: '丹阳贼陆宫等围城，烧亭寺，丹阳太守江汉击破之。',
  },
  {
    time: ['冲帝永嘉', 1, 5, '甲午'],
    type: '其他',
    incident:
      '因近期大旱，下诏令中都官将罪不至死且审查未完的囚犯一律保释出狱，等到立秋再论。郡国有名山大泽能兴云布雨的，二千石长吏各自虔心祈祷。派遣使者巡行对没有家属以及贫穷没有资财而无法安葬的人，按实情抚恤。',
    source:
      '五月甲午，诏曰：“朕以不德，托母天下，布政不明，每失厥中。自春涉夏，大旱炎赫，忧心京京，故得祷祈明祀，冀蒙润泽。前虽得雨，而宿麦颇伤；比日阴云，还复开霁。寤寐永叹，重怀惨结。将二千石、令长不崇宽和，暴刻之为乎？其令中都官系囚罪非殊死考未竟者，一切任出，以须立秋。郡国有名山大泽能兴云雨者，二千石长吏各洁齐请祷，谒诚尽礼。又兵役连年，死亡流离，或支骸不敛，或停棺莫收，朕甚愍焉。昔文王葬枯骨，人赖其德。今遣使者案行，若无家属及贫无资者，随宜赐恤，以慰孤魂。”',
  },
  {
    time: ['冲帝永嘉', 1, 5],
    type: '战争',
    incident: '下邳人谢安应招募攻击徐凤等，斩之。',
    source: '是月，下邳人谢安应募击徐凤等，斩之。',
  },
  {
    time: ['冲帝永嘉', 1, 5, '丙辰'],
    type: '其他',
    incident:
      '下诏说，因为安帝即位在殇帝之后，然而之前的人却将安帝的恭陵安排在殇帝的康陵之上，先后颠倒。因此将顺序调整回来。',
    source:
      '丙辰，诏曰：“孝殇皇帝虽不永休祚，而即位逾年，君臣礼成。孝安皇帝承袭统业，而前世遂令恭陵在康陵之上，先后相逾，失其次序，非所以奉宗庙之重，垂无穷之制。昔定公追正顺祀，春秋善之。其令恭陵次康陵，宪陵次恭陵，以序亲秩，为万世法。”',
  },
  {
    time: ['冲帝永嘉', 1, 6],
    type: '战争',
    incident: '鲜卑侵犯代郡。',
    source: '六月，鲜卑寇代郡。',
  },
  {
    time: ['冲帝永嘉', 1, 7, '庚寅'],
    type: '宗室',
    incident: '阜陵王刘代薨。',
    source: '秋七月庚寅，阜陵王代薨。',
  },
  {
    time: ['冲帝永嘉', 1, 7, '庚寅'],
    type: '战争',
    incident: '庐江盗贼攻寻阳，又攻盱台，滕抚遣司马王章击破之。',
    source: '庐江盗贼攻寻阳，又攻盱台，滕抚遣司马王章击破之。',
  },
  {
    time: ['冲帝永嘉', 1, 9, '庚戌'],
    type: '官吏',
    incident: '太傅赵峻薨。',
    source: '九月庚戌，太傅赵峻薨。',
  },
  {
    time: ['冲帝永嘉', 1, 11, '己丑'],
    type: '官吏',
    incident: '南阳太守韩昭因贪赃被监禁而死。',
    source: '冬十一月己丑，南阳太守韩昭坐赃下狱死。',
  },
  {
    time: ['冲帝永嘉', 1, 11, '丙午'],
    type: '战争',
    incident: '中郎将滕抚击广陵贼张婴，破之。',
    source: '丙午，中郎将滕抚击广陵贼张婴，破之。',
  },
  {
    time: ['冲帝永嘉', 1, 11, '丁未'],
    type: '官吏',
    incident: '中郎将赵序因犯罪被处死示众。',
    source: '丁未，中郎将赵序坐事弃巿。',
  },
  {
    time: ['冲帝永嘉', 1, 11, '丁未'],
    type: '战争',
    incident:
      '历阳贼华孟自称“黑帝”，攻杀九江太守杨岑，滕抚率诸将击华孟等人，大破斩之。',
    source:
      '历阳贼华孟自称“黑帝”，攻杀九江太守杨岑，滕抚率诸将击孟等，大破斩之。',
  },
  {
    time: ['质帝本初', 1, 1, '丙申'],
    type: '其他',
    incident:
      '下诏命令有关主管，罪不至死的人，暂且不审理核实，作为崇尚宽和的表示。',
    source:
      '本初元年春正月丙申，诏曰：“昔尧命四子，以钦天道，鸿范九畴，休咎有象。夫瑞以和降，异因逆感，禁微应大，前圣所重。顷者，州郡轻慢宪防，竞逞残暴，造设科条，陷入无罪。或以喜怒驱逐长吏，恩阿所私，罚枉仇隙，至令守阙诉讼，前后不绝。送故迎新，人离其害，怨气伤和，以致灾眚。书云：‘明德慎罚。’方春东作，育微敬始。其敕有司，罪非殊死，且勿案验，以崇在宽。”',
  },
  {
    time: ['质帝本初', 1, 1, '壬子'],
    type: '官吏',
    incident: '广陵太守王喜因讨伐贼人逗留不前，被监禁而死。',
    source: '壬子，广陵太守王喜坐讨贼逗留，下狱死。',
  },
  {
    time: ['质帝本初', 1, 2, '庚辰'],
    type: '救济',
    incident:
      '下诏说，九江、广陵二郡多次遭侵害，破坏严重。命令调邻近郡的谷物，开官仓供给贫民，收埋枯骨。',
    source:
      '二月庚辰，诏曰：“九江、广陵二郡数离寇害，残夷最甚。生者失其资业，死者委尸原野。昔之为政，一物不得其所，若己为之，况我元元，婴此困毒。方春戒节，赈济乏厄，掩骼埋胔之时。其调比郡见谷，出禀穷弱，收葬枯骸，务加埋恤，以称朕意。”',
  },
  {
    time: ['质帝本初', 1, 4, '庚辰'],
    type: '推举人才',
    incident:
      '令郡国举荐精通经书的，年岁在五十以上，七十以下的到太学。自大将军至六百石，都派遣儿子受教育，满一年考试，用成绩优异的五人补充郎中，次一等的五人补充太子舍人。又千石、六百石、四府掾属、三署郎、四姓小侯先能通晓经典的，各令随一家师法，那些优异的记上官簿，应当以名次先后赏赐举荐。',
    source:
      '夏四月庚辰，令郡国举明经，年五十以上、七十以下诣太学。自大将军至六百石，皆遣子受业，岁满课试，以高第五人补郎中，次五人太子舍人。又千石、六百石、四府掾属、三署郎、四姓小侯先能通经者，各令随家法，其高第者上名牒，当以次赏进。',
  },
  {
    time: ['质帝本初', 1, 5, '庚寅'],
    type: '宗室',
    incident: '徙乐安王为勃海王。',
    source: '五月庚寅，徙乐安王为勃海王。',
  },
  {
    time: ['质帝本初', 1, 5, '庚寅'],
    type: '灾害',
    incident: '海水倒灌。',
    source: '海水溢。',
  },
  {
    time: ['质帝本初', 1, 5, '戊申'],
    type: '救济',
    incident: '派遣谒者巡行察访，收葬乐安、北海被水淹死的人，又开官仓给贫民。',
    source: '戊申，使谒者案行，收葬乐安、北海人为水所漂没死者，又禀给贫羸。',
  },
  {
    time: ['质帝本初', 1, 5, '庚戌'],
    type: '天文',
    incident: '太白星侵犯荧惑星座。',
    source: '庚戌，太白犯荧惑。',
  },
  {
    time: ['质帝本初', 1, 6, '丁巳'],
    type: '其他',
    incident: '大赦天下，赐给百姓爵位及粟帛各有差别。',
    source: '六月丁巳，大赦天下，赐民爵及粟帛各有差。',
  },
  {
    time: ['质帝本初', 1, -6, '甲申'],
    type: '其他',
    incident: '大将军梁冀暗中用鸩酒毒害质帝，质帝崩于玉堂前殿，年九岁。',
    source: '闰月甲申，大将军梁冀潜行鸩弑，帝崩于玉堂前殿，年九岁。',
  },
  {
    time: ['质帝本初', 1, -6, '丁亥'],
    type: '官吏',
    incident: '太尉李固被免职。',
    source: '丁亥，太尉李固免。',
  },
  {
    time: ['质帝本初', 1, -6, '戊子'],
    type: '官吏',
    incident: '司徒胡广为太尉，司空赵戒为司徒，与梁冀参录尚书事。太仆袁汤为司空。',
    source: '戊子，司徒胡广为太尉，司空赵戒为司徒，与梁冀参录尚书事。太仆袁汤为司空。',
  },
];

const data = [...和帝, ...殇帝, ...安帝, ...顺帝, ...冲帝, ...质帝];

data.forEach((item, i) => {
  item.id = i;
});

export default data;
